{
    "reported_to": "MTN Group",
    "reported_by": "aliyugombe ",
    "title": "No rate limit lead to otp brute forcing",
    "content": "\nSummary:\nHello.\nThere is no rate limit protection in the endpoint https://mtnonline.com/nim/submit , Which could lead to brute force otp code.\nHow To Reproduce:\nVisit https://mtnonline.com/nim and complete all the required field and submit.\nwhen next page load, user will be ask otp code.\nEnter any five digit number and intercept the request using burp suit.\nSend the request to intruder and clear all the payload except for otp.\nSelect brute forcer in payload type and clear the alphabetic character in character set and leave only digit.\nIn the min. length and max. length enter 5.\nClick on attact button.\nIn the attached image, all the response code where 303 which means see other, that is means try again.\nIf rate limit is working, from 3 to 4 request, their response should be 429 means too many request.\nSupporting Material/References:\n[attachment / reference]\nThanks\nImpact\nAttacker can send unlimited request before code the code to expire and guess the correct otp since it can be 5 minutes to expire.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Improper Restriction of Authentication Attempts"
    ],
    "screenshots": {},
    "disclosed_date": 1629158220,
    "report_url": "https://hackerone.com/reports/1060541",
    "vuln_category": "WEB_APP",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "steps": [
        [
            1,
            "Visit https://mtnonline.com/nim and complete all the required fields and submit."
        ],
        [
            2,
            "Intercept the OTP request using Burp Suite, send it to Intruder, configure a brute-force attack with 5-digit numeric payloads, and execute the attack."
        ]
    ],
    "vuln_description": "The endpoint https://mtnonline.com/nim/submit lacks rate limiting, allowing attackers to brute-force OTP codes by sending unlimited requests.",
    "reason": "The vulnerability involves a straightforward attack with no complex interactions or state manipulation. The lack of rate limiting is a common and easily identifiable issue.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}