{
    "reported_to": "Khan Academy",
    "reported_by": "renganathan ",
    "title": "Enumerate all the class codes via google dorking ",
    "content": "\nI used this particular google dork site:khanacademy.org/join/* to enumerate all the links of joining classes.\nGo to google and use the above query to enumerate all of them.\nCreate the student account by filling all the required details\nNow you're in the class without being actually invited by the teacher\nAttached POC:\n████████\nImpact\nAn attacker can enumerate all the classes and join in them and make chaos there are chances of IDOR too... a class code can look like a57d5d5548f302ef4a instead of A45JST\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Improper Access Control - Generic"
    ],
    "screenshots": {},
    "disclosed_date": 1626932640,
    "report_url": "https://hackerone.com/reports/1210043",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "HIGH",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Use the Google dork 'site:khanacademy.org/join/*' to enumerate all class join links."
        ],
        [
            2,
            "Create a student account and use one of the enumerated links to join a class without an invitation."
        ]
    ],
    "vuln_description": "This vulnerability allows an attacker to enumerate all class join links on Khan Academy using a simple Google dork and join any class without an invitation, potentially causing disruption or accessing unauthorized information.",
    "reason": "The attack involves a straightforward Google dork query and does not require any complex interactions or understanding of subtle application logic. The vulnerability is easily discoverable with basic knowledge of Google dorks.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null,
    "idor_detectable": true,
    "authnz_byppass_detectable": true,
    "is_simple_payload": false,
    "injection_metadata": {
        "is_simple_payload": true
    },
    "authnz_metadata": {
        "idor_detectable": true,
        "authnz_byppass_detectable": true
    }
}