{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "fms ",
  "title": "Path Traversal and Remote Code Execution in Apache HTTP Server 2.4.49 and 2.4.50 (incomplete fix of CVE-2021-41773) (CVE-2021-42013)",
  "content": "\nIt was found that the fix for CVE-2021-41773 in Apache HTTP Server 2.4.50 was insufficient. An attacker could use a path traversal attack to map URLs to files outside the directories configured by Alias-like directives.\nThis issue only affects Apache 2.4.49 and Apache 2.4.50 and not earlier versions.\nMy friend Juan Escobar @itsecurityco and me (Fernando Munoz) reported this internally to Apache HTTPd project and worked with them to test the new patch before the new version was released.\nImpact\nIf files outside of these directories are not protected by the usual default configuration \"require all denied\", these requests can succeed. If CGI scripts are also enabled for these aliased pathes, this could allow for remote code execution.\n\n",
  "severity": [
    9.0,
    10.0
  ],
  "bounty": 1000,
  "weaknesses": [
    "Path Traversal"
  ],
  "screenshots": {},
  "disclosed_date": 1637298840,
  "report_url": "https://hackerone.com/reports/1400238",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Identify a vulnerable Apache HTTP Server version (2.4.49 or 2.4.50)."
    ],
    [
      2,
      "Craft a URL with path traversal sequences (e.g., '/cgi-bin/.%2e/%2e%2e/%2e%2e/%2e%2e/etc/passwd') to bypass the incomplete fix for CVE-2021-41773."
    ],
    [
      3,
      "Send the crafted request to the server to access files outside the configured directories."
    ],
    [
      4,
      "If CGI scripts are enabled, use the path traversal to execute arbitrary code on the server."
    ]
  ],
  "vuln_description": "The vulnerability is a path traversal and remote code execution flaw in Apache HTTP Server versions 2.4.49 and 2.4.50. The fix for CVE-2021-41773 was insufficient, allowing attackers to bypass directory restrictions and access or execute files outside the intended directories. This can lead to unauthorized file access or remote code execution if CGI scripts are enabled.",
  "reason": "The vulnerability involves understanding the incomplete patch for CVE-2021-41773 and crafting a specific path traversal sequence to bypass it. While the attack requires knowledge of the server's configuration and the use of non-obvious path sequences, the components involved (path traversal and CGI execution) are well-known and the interaction between them is straightforward once the bypass is identified.",
  "new_complexity": "MEDIUM",
  "requires_code": true,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}