{
  "reported_to": "Brave Software",
  "reported_by": "nishimunea ",
  "title": "Universal XSS with Playlist feature",
  "content": "\nSummary:\nBrave iOS has three weaknesses described below. By combining them, Universal XSS can be achieved.\nExposure of UserScriptManager.securityToken\nPlaylist.js embeds the exact value of the $<notifyNode> into HTMLVideoElement.prototype.setAttribute. By reading the value, an attacker can retrieve the hidden security token.\nExposure of UserScriptManager.messageHandlerToken\nAlso, WindowRenderHelper.js embeds the exact value of the $<handler> into W{securityToken}.postMessage. By reading the value, an attacker can retrieve the hidden message handler token.\nUXSS in PlaylistHelper through nodeTag\nPlaylistHelper.swift concatenates strings to build a JavaScript code and executes it on the mainframe of a WebView. Then, nodeTag given from a webpage is directly included in the code. So, if the nodeTag, named as tagId in JS world, passed from the page contained ');alert(document.location);//, unintended alert() is executed on the mainframe.\nProducts affected:\nBrave iOS 1.32.3 and higher (include the latest Nightly)\nSteps To Reproduce:\nVisit the Google page: https://sites.google.com/view/nishimunea-brave-uxss1/page\nThis page contains a cross origin malicious page https://csrf.jp/brave/playlist.php in an iframe\nThe iframe exploits the above three weaknesses to send a message to playlistHelper\nPush Add to Brave Playlist and Open button in the setting menu\nAn alert dialog is appear on the sites.google.com\nSupporting Material/References:\nDemonstration movie is attached\nImpact\nUniversal XSS on the arbitrary domains\n\n",
  "severity": [
    8.3,
    null
  ],
  "bounty": 750,
  "weaknesses": [
    "Cross-site Scripting (XSS) - Stored"
  ],
  "screenshots": {},
  "disclosed_date": 1687427460,
  "report_url": "https://hackerone.com/reports/1436558",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "MOBILE",
  "steps": [
    [
      1,
      "Visit the Google page: https://sites.google.com/view/nishimunea-brave-uxss1/page which contains a cross-origin malicious page https://csrf.jp/brave/playlist.php in an iframe."
    ],
    [
      2,
      "Push 'Add to Brave Playlist and Open' button in the setting menu."
    ],
    [
      3,
      "Observe the alert dialog appearing on the sites.google.com domain."
    ]
  ],
  "vuln_description": "This vulnerability is a Universal XSS (Cross-Site Scripting) in Brave iOS, achieved by combining three weaknesses: exposure of UserScriptManager.securityToken, exposure of UserScriptManager.messageHandlerToken, and a UXSS in PlaylistHelper through nodeTag. The attack allows executing arbitrary JavaScript in the context of any domain visited by the user.",
  "reason": "The vulnerability involves multiple components (security token exposure, message handler token exposure, and UXSS via nodeTag), requires understanding subtle interactions between these components, and involves manipulating complex application states (Playlist feature, WebView mainframe execution). The novel logic of combining these weaknesses to achieve Universal XSS is not commonly found in other applications.",
  "new_complexity": "VERY_HIGH",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "injection_metadata": {
    "is_simple_payload": false
  },
  "authnz_metadata": {
    "reason": "The vulnerability involves exploiting weaknesses in Brave iOS's Playlist feature to achieve Universal XSS. The methodology described focuses on testing authentication and authorization boundaries within a single application by swapping user sessions, actions, and resource IDs. However, the Brave iOS vulnerability involves cross-origin iframe exploitation and JavaScript code injection, which are not covered by the described methodology. The methodology does not account for client-side code execution vulnerabilities or cross-origin attacks.",
    "is_detectable": false
  }
}