{
  "reported_to": "Brave Software",
  "reported_by": "nishimunea ",
  "title": "New XSS vector in ReaderMode with %READER-TITLE-NONCE%",
  "content": "\nSummary:\nPreviously, script execution in ReaderMode pages was prohibited by CSP. However, three months ago, this commit partially relaxed the CSP and scripts with nonce-%READER-TITLE-NONCE% are now allowed to be executed. This relaxation of the CSP rule can be exploited for XSS attacks on ReaderMode pages.\nHere, the attack vector is %READER-CREDITS% which is also included in the ReaderMode HTML template. The %READER-CREDITS% is replaced with the value of the <meta name=\"author\"> tag in the original page, but then the HTML tags are not escaped. So, when the following meta tag is embedded in the original page and the page is displayed in ReaderMode, this Swift code replaces %READER-TITLE-NONCE% with the correct nonce value.\nCode 120 Bytes\n1<meta name=\"author\" content=\"Evil &lt;script nonce=%READER-TITLE-NONCE%&gt;alert(document.location);&lt;/script&gt;!--\">\nAs a result, the malicious script will be executed on a page http://localhost:6571/reader-mode?uri={uri}&uuidkey={value}.\nIn Brave, all readalized pages are hosted on http://localhost:6571. Therefore, through this XSS, any cross-origin pages, that has been converted to ReaderMode, can be stolen by embedding an iframe and reading out them. Also, please find that the uuidkey is included in the URL query string. By obtaining this key, the attacker can gain access to Brave's privileged pages.\nProducts affected:\nBrave iOS 1.31.1 and higher (including the latest Nightly)\nSteps To Reproduce:\nShow https://csrf.jp/2021/brave/author_xss.php\nPush reader mode button on the address bar\nAn alert dialog is shown\nSupporting Material/References:\nSee the screenshot of the alert dialog when the bug is reproduced.\nImpact\nAny cross-origin pages, that has been converted to ReaderMode, can be stolen\nAttacker can gain access to Brave's privileged pages\n\n",
  "severity": [
    9.5,
    null
  ],
  "bounty": 1000,
  "weaknesses": [
    "Cross-site Scripting (XSS) - Generic"
  ],
  "screenshots": {},
  "disclosed_date": 1687427460,
  "report_url": "https://hackerone.com/reports/1436142",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "MOBILE",
  "steps": [
    [
      1,
      "Show https://csrf.jp/2021/brave/author_xss.php"
    ],
    [
      2,
      "Push reader mode button on the address bar"
    ],
    [
      3,
      "An alert dialog is shown"
    ]
  ],
  "vuln_description": "The vulnerability allows for XSS attacks in Brave's ReaderMode due to a relaxed CSP rule that permits script execution with a specific nonce. An attacker can inject malicious scripts via the <meta name=\"author\"> tag, which is not properly escaped, leading to script execution in the ReaderMode context. This can be exploited to steal cross-origin pages converted to ReaderMode and gain access to Brave's privileged pages.",
  "reason": "The attack requires understanding of the CSP relaxation, the nonce usage in ReaderMode, and the unescaped meta tag content. However, once these components are known, the exploitation is straightforward.",
  "new_complexity": "MEDIUM",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "injection_metadata": {
    "is_simple_payload": false
  },
  "authnz_metadata": {
    "reason": "The XSS vulnerability in Brave's ReaderMode involves script execution due to improper CSP relaxation and unescaped HTML tags in the %READER-CREDITS% replacement. This is not directly related to authentication or authorization bypasses, nor does it involve swapping user sessions or resource IDs as described in the methodologies. The vulnerability is more about injection and script execution rather than AuthN/AuthZ issues.",
    "is_detectable": false
  }
}