{
  "reported_to": "U.S. General Services Administration",
  "reported_by": "imthatt ",
  "title": "Account takeover leading to PII chained with stored XSS",
  "content": "\n\nI have found a vulnerability on https://vehiclestdb.fas.gsa.gov/ for account takeovers\nThe website is not using proper authentication to claim the user signing in is actually the account owner due to only requiring an email address to sign in and no password. This leads to an attacker being able to place a stored XSS payload within the victims profile and reveals PII including phone numbers of the victim.\nSteps To Reproduce:\n[add details for how we can reproduce the issue]\nVisit https://vehiclestdb.fas.gsa.gov/\nEnter email address in the signing form itsdavenn@gmail.com (or for official account use tesg@gsa.gov)\nYou have now signed in as a users account you do not own and if you browse to the profile you can see PII in the form of phone numbers.\nWe can do this with any registered user\nYou can place an XSS stored payload on the users profile in the first name field using ant\" autofocus onfocus=prompt(1) x=\"\nSupporting Material/References:\n[list any additional material (e.g. screenshots, logs, etc.)]\n[attachment / reference] Please re create these steps to see the impact\nImpact\nAn attacker can takeover any users account from just knowing the email address, from here on in they can find PII in the form of phone numbers and place stored XSS on the users profile to execute JavaScript code on the users profile.\n\n",
  "severity": "[",
  "bounty": null,
  "weaknesses": "[",
  "screenshots": {},
  "disclosed_date": 1650111600,
  "report_url": "https://hackerone.com/reports/1483201",
  "is_multi_component": true,
  "complexity": "MEDIUM",
  "novelty": "LOW",
  "vuln_category": "WEB_APP",
  "steps": "[",
  "Visit https": "//vehiclestdb.fas.gsa.gov/",
  "vuln_description": "The website lacks proper authentication, allowing account takeover by simply entering a registered email address. This leads to unauthorized access to PII (phone numbers) and enables stored XSS attacks via profile fields.",
  "reason": "The vulnerability is straightforward to discover as it only requires knowing a registered email address and does not involve complex interactions or novel logic. The attack chain is simple (no password auth → account takeover → PII/XSS).",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": false,
  "authnz_byppass_detectable": true,
  "injection_classification": "}"
}