{
    "reported_to": "U.S. Dept Of Defense",
    "reported_by": "badlifeguard ",
    "title": "Pull Any Automated Record Brief",
    "content": "\nDescription: With some simple URL manipulation, an authenticated user is able to request other soldiers ARB/ORBs.\nReferences\nI am able to pull my own \"Current Automated Record Brief\", \"Selection Board Record Brief\", and all validated ones, then manipulate numbers in the request URL, and then pull any other valid number to pull a soldier. URL ID: \"SRBHeaderID=#######\"\nImpact\nAfter pulling an ARB/ORB, someone would have access to view their last 4 SSN, Date of Birth, Place of birth, Clearance information, Mailing Address, and DODID. With most recent breaches of SSNs, one attacker would have enough information to verify and impersonate another soldier for malicious purposes.\nSystem Host(s)\n█████, ████\nAffected Product(s) and Version(s)\nCVE Numbers\nSteps to Reproduce\nAuthenticate to https://████/SelfService/home/selfservice\nThen you can test by clicking on your own \"My Record Brief\".\nEnter developer mode in your chosen browser.\nFirst choose your \"View Current Automated Record Brief\"\nIn developer mode watch for \"Network request\" (Where 000000 will be your ID for your non-board record: Index?SRBHeaderID=000000&isBoard=false&OT=0\nYou can manipulate the SRBHeaderID from 000001 to at least 4500000.\nSimilar to the other buttons, lead to the same results SRBHeaderID, Board, and OT change values.\nCurrent Automated Record Brief\nhttps://█████/SelfService/esrbss/PDF/Index?SRBHeaderID=000000&isBoard=false&OT=0\nCurrent Selection Board Record Brief\nhttps://█████████/SelfService/esrbss/PDF/Index?SRBHeaderID=000000&isBoard=true&OT=0\nValidated Automated Record Brief\nhttps://███████/SelfService/esrbss/PDF/Index?SRBHeaderID=0000000&isBoard=false&OT=2\nCertified Selection Board Record Brief\nhttps://█████/SelfService/esrbss/PDF/Index?SRBHeaderID=0000000&isBoard=true&OT=5\nSuggested Mitigation/Remediation Actions\nLock permissions on access to Record Brief files produced, generate the PDF from the backend, randomize/tokenize the URL to give one time URLs.\n\n",
    "severity": [
        9.0,
        10.0
    ],
    "bounty": null,
    "weaknesses": [
        "Information Disclosure"
    ],
    "screenshots": {},
    "disclosed_date": 1729884180,
    "report_url": "https://hackerone.com/reports/1541740",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Authenticate to the system at https://████/SelfService/home/selfservice."
        ],
        [
            2,
            "Navigate to 'My Record Brief' and use developer tools to monitor network requests."
        ],
        [
            3,
            "Identify the request URL containing 'SRBHeaderID=000000' where '000000' is your record ID."
        ],
        [
            4,
            "Manipulate the 'SRBHeaderID' parameter in the URL to access other users' records by changing the ID value."
        ]
    ],
    "vuln_description": "An authenticated user can manipulate the 'SRBHeaderID' parameter in the URL to access other soldiers' Automated Record Briefs (ARB/ORB), exposing sensitive personal information such as last 4 SSN, Date of Birth, Place of Birth, Clearance information, Mailing Address, and DODID.",
    "reason": "The vulnerability involves simple URL manipulation without requiring complex interactions or understanding of multiple components. The attack is straightforward once the URL parameter is identified.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}