{
    "reported_to": "Brave Software",
    "reported_by": "kalkii ",
    "title": "Browser is not following proper flow for redirection cause open redirect ",
    "content": "\nSummary:\nBrave browser is not following proper flow for redirection. Browser is directly redirecting to the site that is present in redirect parameter without confirming from the main site server.\nI have found this vulnerability and this is affecting Facebook. Facebook use l.facebook.com/l.php?u=<redirect_site> for redirection and when server gets the request it check whether the redirect_site is in the list of there malicious(linkshim) list or not. If not then Facebook redirect it properly.\nBut when we try to go to a site like https://l.facebook.com/l.php?u=https://test.facebook-whitehat.com/ then brave browser is directly requesting to https://test.facebook-whitehat.com/ (a domain resticted by facebook which can be used for testing prepose) without asking Facebook server whether should I redirect or not. But other browser are properly following the flow.\nProducts affected:\nWindows 11, Version 1.38.119 Chromium: 101.0.4951.67 (Official Build) (64-bit)\nSteps To Reproduce:\nOpen brave browser in windows\nIntercept the requests\nGo to https://l.facebook.com/l.php?u=https://test.facebook-whitehat.com/ and you will notice that it directly generating a request https://test.facebook-whitehat.com/ not to l.facebook.com\nSupporting Material/References:\nI also soon how other browser is responding and how brave is responder. POC video attached\nImpact\nBrave has seen a massive growth in 2021 quarter and Facebook is the one of the largest used social media.\nDue to this vulnerability users that are using Brave browser are directly affected which will affect brave reputation as only brave browser users are getting affect.\nAs well this vulnerability in brave browser is affecting facebook's security also.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": 500,
    "weaknesses": [
        "None"
    ],
    "screenshots": {},
    "disclosed_date": 1656625500,
    "report_url": "https://hackerone.com/reports/1579374",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Open Brave browser on Windows and intercept network requests (e.g., using DevTools)."
        ],
        [
            2,
            "Navigate to https://l.facebook.com/l.php?u=https://test.facebook-whitehat.com/ and observe the browser directly requests the test domain without consulting Facebook's server."
        ]
    ],
    "vuln_description": "Brave browser improperly handles Facebook's link redirection system by bypassing Facebook's server-side validation checks. Normally, Facebook's l.facebook.com/l.php endpoint validates redirect URLs against a malicious links list before redirection. However, Brave directly follows the redirect parameter without this validation, potentially exposing users to unsafe domains.",
    "reason": "The vulnerability involves understanding Facebook's redirection mechanism and noticing the browser's deviation from expected behavior. While the redirection logic is standard, identifying Brave's unique bypass requires comparing its behavior against other browsers, which is straightforward but requires awareness of the expected validation flow.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}