{
    "reported_to": "Reddit",
    "reported_by": "3amii ",
    "title": "Several Subdomains Takeover",
    "content": "\nthere are some subdomains in reddit.com those are vulnerable to takeover subdomain attack. I found these subdomains while I have been testing the subdomains of reddit.com.\nSteps To Reproduce:\n[add details for how we can reproduce the issue]\ncreate a user account in reddit.com.\nthere are some subdomain as sample: webcovid19.reddit.com (151.101.13.140) and click on this subdomain.\nyou will see \"Sorry, there aren’t any communities on Reddit with that name\" message.\nnow create an community with the same name \"webcovid19\".and you will not find any message as above.\nwell done. now you have the subdomain for your community.\nSupporting Material/References:\n[list any additional material (e.g. screenshots, logs, etc.)]\n1-for details, please find attached screenshots.\n2-use this subdomain finder to find subdomains.\nhttps://subdomainfinder.c99.nl/\nImpact\nattacker can use available unclaimed subdomains for malicious intention\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "None"
    ],
    "screenshots": {},
    "disclosed_date": 1654734960,
    "report_url": "https://hackerone.com/reports/1591085",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Create a user account on reddit.com."
        ],
        [
            2,
            "Identify an unclaimed subdomain (e.g., webcovid19.reddit.com) and verify it shows a 'Sorry, there aren’t any communities on Reddit with that name' message."
        ],
        [
            3,
            "Create a community with the same name as the subdomain (e.g., 'webcovid19')."
        ],
        [
            4,
            "Verify the subdomain now redirects to the newly created community, effectively claiming it."
        ]
    ],
    "vuln_description": "The vulnerability allows an attacker to claim unclaimed subdomains of reddit.com by creating a community with the same name as the subdomain. This could be exploited for malicious purposes such as phishing or spreading misinformation.",
    "reason": "The attack is straightforward and does not involve multiple components, complex states, or subtle interactions. It relies on a simple naming convention and does not require deep understanding of the application's internals.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}