{
    "reported_to": "Brave Software",
    "reported_by": "nishimunea ",
    "title": "Security token and handler name leak from window.braveBlockRequests",
    "content": "\nSummary:\nBrave for iOS protects privileged JS to native bridges by using random JavaScript handler names and security tokens.\nHowever, by altering window.braveBlockRequests property from scripts on the web page, these secret values can be stolen.\nTo be specific, braveBlockRequests property is set after the execution of the script on the page. Thus, by setting the malicious property as an immutable property from the page beforehand as shown below, it is possible to prevent overwriting by the legitimate property.\nCode 212 Bytes\n1Object.defineProperty(window, \"braveBlockRequests\", {\n2    enumerable: false,\n3    configurable: false,\n4    writable: false,\n5    value: function(args) { window.args = args } // Steal handler name and token here\n6});\nProducts affected:\nBrave for iOS Version 1.41.1 (22.7.27.20) with the default settings\nSteps To Reproduce:\nOpen https://csrf.jp/2022/brave_token_leak.php\nPush \"Attack\" button in the page\nSecret handler name and security token is shown on the page\nSupporting Material/References:\nAttached is a movie file that demonstrate the above steps to reproduce.\nImpact\nThe impact depends on which bridge is abused. As further features are implemented in the Brave, its potential risk tends to be increased.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": 700,
    "weaknesses": [
        "Information Disclosure"
    ],
    "screenshots": {},
    "disclosed_date": 1687427460,
    "report_url": "https://hackerone.com/reports/1668723",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "MOBILE",
    "steps": [
        [
            1,
            "Open https://csrf.jp/2022/brave_token_leak.php in Brave for iOS Version 1.41.1 (22.7.27.20)"
        ],
        [
            2,
            "Push the 'Attack' button on the page to execute the malicious script"
        ]
    ],
    "vuln_description": "Brave for iOS protects privileged JS to native bridges by using random JavaScript handler names and security tokens. However, by altering the window.braveBlockRequests property from scripts on the web page, these secret values can be stolen. This is possible because the property is set after the execution of the script on the page, allowing a malicious script to set it as immutable beforehand and intercept the handler name and token.",
    "reason": "The vulnerability involves understanding the timing of property assignment in JavaScript and the ability to set immutable properties to intercept sensitive data. While the attack itself is straightforward once the timing issue is identified, discovering this timing flaw and the method to exploit it requires insight into how Brave for iOS handles privileged JS to native bridges.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}