{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "zeyu2001 ",
  "title": "DNS rebinding in --inspect (insufficient fix of CVE-2022-32212 affecting macOS devices)",
  "content": "\nThe fix for CVE-2022-32212, covered the cases for routable IP addresses, however, there exists a specific behavior on macOS devices when handling the http://0.0.0.0 URL that allows an attacker-controlled DNS server to bypass the DNS rebinding protection by resolving hosts in the .local domain.\nOriginal HackerOne report\nNode.js Blog\nImpact\nAttacker with access to a compromised DNS server or the ability to spoof its responses can gain access to the Node.js debugger, which can result in remote code execution.\n\n",
  "severity": "[",
  "bounty": 4200,
  "weaknesses": "[",
  "screenshots": {},
  "disclosed_date": 1673564880,
  "report_url": "https://hackerone.com/reports/1714979",
  "is_multi_component": true,
  "complexity": "MEDIUM",
  "novelty": "MEDIUM",
  "vuln_category": "CODE",
  "steps": "[",
  "Trick a macOS user into visiting a malicious website that uses the http": "//0.0.0.0 URL to bypass DNS rebinding protection.",
  "vuln_description": "The vulnerability involves a DNS rebinding attack in Node.js's --inspect feature, specifically affecting macOS devices. The fix for CVE-2022-32212 did not account for the behavior of http://0.0.0.0 URLs on macOS, allowing an attacker-controlled DNS server to bypass DNS rebinding protection by resolving hosts in the .local domain. This can lead to remote code execution via the Node.js debugger.",
  "reason": "This vulnerability requires understanding of DNS rebinding attacks, the specific behavior of macOS with http://0.0.0.0 URLs, and the interaction between these components to bypass the protection. The attack also involves manipulating the DNS resolution process and exploiting a non-obvious interaction in the Node.js debugger's protection mechanism.",
  "new_complexity": "HIGH",
  "requires_code": true,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": false,
  "authnz_byppass_detectable": false,
  "injection_classification": "}"
}