{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "ooooooo_q ",
  "title": "ReDoS (Rails::Html::PermitScrubber.scrub_attribute)",
  "content": "\nI reported at https://hackerone.com/reports/1684163\nhttps://github.com/rails/rails-html-sanitizer/security/advisories/GHSA-5x79-w82f-gw8w\nCertain configurations of rails-html-sanitizer < 1.4.4 use an inefficient regular expression that is susceptible to excessive backtracking when attempting to sanitize certain SVG attributes. This may lead to a denial of service through CPU resource consumption.\nIt seems that the same problem existed on the Loofah side, so it was fixed as well. That has been fixed as CVE-2022-23514(https://github.com/flavorjones/loofah/security/advisories/GHSA-486f-hjj9-9vhh)\nImpact\nReDoS may occur if scrub is executed in Rails::Html::PermitScrubber.\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": 4000,
  "weaknesses": [
    "None"
  ],
  "screenshots": {},
  "disclosed_date": 1671076260,
  "report_url": "https://hackerone.com/reports/1804128",
  "is_multi_component": false,
  "complexity": "LOW",
  "novelty": "LOW",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Identify a Rails application using rails-html-sanitizer version < 1.4.4."
    ],
    [
      2,
      "Craft a malicious SVG file with attributes designed to trigger excessive backtracking in the regular expression used by Rails::Html::PermitScrubber.scrub_attribute."
    ]
  ],
  "vuln_description": "Certain configurations of rails-html-sanitizer < 1.4.4 use an inefficient regular expression that is susceptible to excessive backtracking when attempting to sanitize certain SVG attributes. This may lead to a denial of service through CPU resource consumption (ReDoS).",
  "reason": "The vulnerability involves understanding the specific regular expression inefficiency in the sanitizer and crafting an SVG that exploits it. While the concept of ReDoS is known, identifying the exact regex flaw in this context requires targeted analysis.",
  "new_complexity": "MEDIUM",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null
}