{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "czchen ",
  "title": "Argo CD reconciles apps outside configured namespaces when sharding is enabled",
  "content": "\nThe Application CRD outside configured namespace in Argo CD will be reconciled.\nThe following is how to reproduce the vulnerability:\nEnable apps-in-any-namespace and sharding features.\nCreate an Application CRD in namespace not configured in Argo CD.\nUpdate the Application CRD, and Argo CD will reconcile the Application CRD, despite not in configured namespace.\nImpact\nAttacker can use Argo CD permission to deploy resources in Kubernetes.\n\n",
  "severity": [
    8.5,
    null
  ],
  "bounty": 2000,
  "weaknesses": [
    "Improper Access Control - Generic"
  ],
  "screenshots": {},
  "disclosed_date": 1678052940,
  "report_url": "https://hackerone.com/reports/1847140",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "MEDIUM",
  "vuln_category": "API",
  "steps": [
    [
      1,
      "Enable apps-in-any-namespace and sharding features in Argo CD."
    ],
    [
      2,
      "Create an Application CRD in a namespace not configured in Argo CD."
    ],
    [
      3,
      "Update the Application CRD and observe that Argo CD reconciles it despite not being in a configured namespace."
    ]
  ],
  "vuln_description": "Argo CD reconciles Application CRDs outside of configured namespaces when sharding is enabled, allowing attackers to use Argo CD permissions to deploy resources in Kubernetes.",
  "reason": "The vulnerability involves understanding the interaction between the apps-in-any-namespace and sharding features, which is non-obvious. However, the steps to reproduce are straightforward once these features are known.",
  "new_complexity": "MEDIUM",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": true,
  "authnz_byppass_detectable": true,
  "is_simple_payload": false,
  "injection_metadata": {
    "is_simple_payload": false
  },
  "authnz_metadata": {
    "idor_detectable": false,
    "authnz_byppass_detectable": true
  }
}