{
    "reported_to": "U.S. Dept Of Defense",
    "reported_by": "b911bade858ce8e6a0f50f8 ",
    "title": "[█████] Bug Reports allow for Unrestricted File Upload",
    "content": "\nThe web page https://███████/ allows for users to submit bug reports. Users are allowed to attach a file to a bug report. The extension and size of files are not validated by the web server.\nImpact\nAn attacker can attach a malicious file to a bug report. If a support agent opened the malicious file, malware would be executed on the support agent's system.\nSystem Host(s)\n████████\nAffected Product(s) and Version(s)\nVersion: 3.4 Build: 35 Revision: 1\nCVE Numbers\nSteps to Reproduce\nNavigate to the following web page: https://████████/\nCreate an account\nLog in to the account that you created\nClick on the text that reads Report a Bug\nEnter any text in to the Description input field\nAttach a file with an allowed file extension to the bug report\nClick on the text that reads Submit\nIntercept the HTTP request and change the extension of the attached file to one that is not allowed\nObserve that the bug report was successfully submitted. This should not be the case, as the attached file has a file extension that is not allowed. The same method can be used to attach a file whose size is greater than 5 megabytes.\nSuggested Mitigation/Remediation Actions\nEnsure that the extension and size of a file are validated by the web server.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Violation of Secure Design Principles"
    ],
    "screenshots": {},
    "disclosed_date": 1677283620,
    "report_url": "https://hackerone.com/reports/1850065",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Navigate to the web page: https://████████/"
        ],
        [
            2,
            "Create an account and log in"
        ],
        [
            3,
            "Click on 'Report a Bug'"
        ],
        [
            4,
            "Enter any text in the Description field"
        ],
        [
            5,
            "Attach a file with an allowed extension"
        ],
        [
            6,
            "Intercept the HTTP request and change the file extension to a disallowed one"
        ],
        [
            7,
            "Submit the bug report and observe it is accepted despite the invalid extension"
        ]
    ],
    "vuln_description": "The web application allows unrestricted file uploads in bug reports by not validating file extensions or sizes on the server side. An attacker can upload malicious files, which could execute malware on a support agent's system when opened.",
    "reason": "The vulnerability involves straightforward steps without complex interactions or state manipulations. The attack requires basic understanding of HTTP request interception but does not involve novel or subtle logic.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}