{
  "reported_to": "HackerOne",
  "reported_by": "mikkocarreon ",
  "title": "[CVE-2022-44268] Arbitrary Remote Leak via ImageMagick",
  "content": "\nSummary:\nHackerOne's image upload is using ImageMagick to convert/resize images and is likely updated. Thus, it's vulnerable to CVE-2022-44268.\nDescription:\nSteps To Reproduce\nNavigate to your profile\nEdit and upload the attached image (im-lfi.png) as your profile picture\nSave changes and download the resized picture\nIssue the following command to view the downloaded image's profile data;\nCode 27 Bytes\n1identify -verbose image.png\nThen, copy the Raw profile type: and decode it using any tool or using Python like;\nCode 115 Bytes\n1python -c \"print(bytes.fromhex('2c2c2c3a2f72756e2f73797374656d643a2f7573722f7362696e2f6e6f6c6f67696e0a').decode())\"\nI've attached the resized image too which contains the content of /etc/passwd i.e. 86bca9490b71a481329efc85de3a82a98f6c29475f4926fd2b5fc844b96899c0.png\nImpact\nArbitrary Remote Leak\n\n",
  "severity": [
    9.9,
    null
  ],
  "bounty": 50,
  "weaknesses": [
    "Remote File Inclusion"
  ],
  "screenshots": {},
  "disclosed_date": 1678996320,
  "report_url": "https://hackerone.com/reports/1858574",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Navigate to your profile"
    ],
    [
      2,
      "Edit and upload the attached image (im-lfi.png) as your profile picture"
    ],
    [
      3,
      "Save changes and download the resized picture"
    ],
    [
      4,
      "Issue the following command to view the downloaded image's profile data: identify -verbose image.png"
    ],
    [
      5,
      "Copy the Raw profile type: and decode it using any tool or using Python"
    ]
  ],
  "vuln_description": "The vulnerability involves using ImageMagick to convert/resize images, which can be exploited to leak arbitrary files from the server by embedding malicious content in an image file. When the image is processed, the server's file content (e.g., /etc/passwd) is embedded in the output image's metadata, which can then be extracted and decoded.",
  "reason": "This vulnerability requires knowledge of the ImageMagick CVE and how to craft a malicious image file to trigger the file read. However, once the exploit image is created, the steps to reproduce are straightforward and do not involve complex interactions or state manipulation.",
  "new_complexity": "MEDIUM",
  "requires_code": false,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null,
  "injection_metadata": {
    "is_simple_payload": false
  },
  "authnz_metadata": {
    "reason": "The vulnerability involves exploiting ImageMagick's processing of a malicious image to leak arbitrary files (e.g., /etc/passwd). This is not an authentication or authorization bypass issue, nor does it involve manipulating user sessions or resource IDs within the same application. The methodology described focuses on AuthN/AuthZ and IDOR vulnerabilities within the same application context, which does not apply here.",
    "is_detectable": false
  }
}