{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "farcaller ",
  "title": "JWT audience claim is not verified",
  "content": "\nAll versions of Argo CD starting with v1.8.2 are vulnerable to an improper authorization bug causing the API to accept certain invalid tokens.\nOIDC providers include an aud (audience) claim in signed tokens. The value of that claim specifies the intended audience(s) of the token (i.e. the service or services which are meant to accept the token). Argo CD does validate that the token was signed by Argo CD's configured OIDC provider. But Argo CD does not validate the audience claim, so it will accept tokens that are not intended for Argo CD.\nImpact\nIf Argo CD's configured OIDC provider also serves other audiences (for example, a file storage service), then Argo CD will accept a token intended for one of those other audiences. Argo CD will grant the user privileges based on the token's groups claim, even though those groups were not intended to be used by Argo CD.\nThis bug also increases the blast radius of a stolen token. If an attacker steals a valid token for a different audience, they can use it to access Argo CD.\n\n",
  "severity": "[",
  "bounty": 2000,
  "weaknesses": "[",
  "screenshots": {},
  "disclosed_date": 1681684980,
  "report_url": "https://hackerone.com/reports/1889161",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "MEDIUM",
  "vuln_category": "API",
  "steps": "[",
  "vuln_description": "Argo CD does not validate the audience claim (aud) in JWT tokens issued by its configured OIDC provider. This allows tokens intended for other services to be accepted by Argo CD, potentially granting unauthorized access based on the token's groups claim.",
  "reason": "The vulnerability involves understanding JWT tokens, OIDC providers, and audience claims. While the components are standard in authentication systems, the interaction where Argo CD fails to validate the audience claim is subtle but not overly complex.",
  "new_complexity": "MEDIUM",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": false,
  "authnz_byppass_detectable": true,
  "injection_classification": "}"
}