{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "donnchac ",
  "title": "RCE on default Ubuntu Desktop >= 12.10 Quantal",
  "content": "\nI recently reported a number of vulnerabilities in Canonical's Apport crash report software. These bugs provided RCE on a default install of Ubuntu Desktop >= 12.10 upon opening a malicious file. I reported the issues to the Apport maintainers and we coordinate the disclosure of these issues.\nIs the Internet Bug Bounty interested in providing bounties for RCE bugs affecting default Ubuntu installations? I have included a link to the Launchpad ticket and my blog post describing the issues in detail. Please let me know if this is something that you are interested in. I am happy to provide any further information that you require.\nhttps://bugs.launchpad.net/bugs/1648806\nhttps://donncha.is/2016/12/compromising-ubuntu-desktop/\n\n",
  "severity": [
    9.6,
    null
  ],
  "bounty": null,
  "weaknesses": [
    "Command Injection - Generic"
  ],
  "screenshots": {},
  "disclosed_date": 1573620540,
  "report_url": "https://hackerone.com/reports/192512",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "MEDIUM",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Identify a vulnerability in Canonical's Apport crash report software that allows Remote Code Execution (RCE) on a default Ubuntu Desktop installation (>= 12.10 Quantal)."
    ],
    [
      2,
      "Create a malicious file that triggers the Apport crash report software when opened."
    ],
    [
      3,
      "Deliver the malicious file to a target user on a default Ubuntu Desktop installation."
    ],
    [
      4,
      "Upon opening the file, the Apport crash report software executes the malicious payload, leading to RCE."
    ]
  ],
  "vuln_description": "The vulnerability involves multiple RCE bugs in Canonical's Apport crash report software, which is installed by default on Ubuntu Desktop systems. When a user opens a malicious file, the Apport software processes it insecurely, allowing arbitrary code execution. This affects default installations of Ubuntu Desktop versions 12.10 (Quantal) and later.",
  "reason": "The attack involves understanding the Apport crash report software's behavior, crafting a malicious file that triggers the vulnerability, and exploiting it to achieve RCE. While the vulnerability itself is not highly complex, the discovery required knowledge of the Apport software's internals and its interaction with the Ubuntu Desktop environment.",
  "new_complexity": "MEDIUM",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "injection_metadata": {
    "is_simple_payload": true
  },
  "authnz_metadata": {
    "reason": "The RCE vulnerability in Ubuntu's Apport crash report software involves a malicious file triggering the vulnerability upon opening, which is not related to authentication or authorization boundaries within a single application. The proposed methodologies focus on testing AuthN/AuthZ boundaries by swapping user sessions or resource IDs within the same application context, which does not apply here.",
    "is_detectable": false
  }
}