{
    "reported_to": "Brave Software",
    "reported_by": "roland_hack ",
    "title": "Open redirect due to scanning QR code via brave browser",
    "content": "\nNOTE! Thanks for submitting a report! Please fill all sections below with the pertinent details. Remember, the more detail you provide, the easier it is for us to verify and then potentially issue a bounty.\nSummary:\nThis vulnerability was discovered in Brave's QR code scanner, which allows users to read QR codes and open corresponding links. Exploitation of this vulnerability allows attackers to direct users to malicious sites without their consent or knowledge. This vulnerability can put the security of Brave users at risk and allow them to be exposed to phishing, phishing and malware attacks. In this report, we'll describe the vulnerability in more detail, assess its severity, and provide recommendations to address it.\nProducts affected:\nBrave 1.50.114, Chromium 112.0.5615.49 on Android 11; Build/RP1A.200720.011\nSteps To Reproduce:\n<image_0>\nThe QR code above is the one I generated to replicate the attack.\nTo create my QR code, I used the site https://app.qr-code-generator.com.\nI included a malicious link in this QR code. As an example link, I used www.evil.com\nSteps To Reproduce\nOpen the browser\nThen in your browser you can click on the \"scan a QR code\" option and scan the QR code in which I have included my malicious link. This will automatically redirect you to the malicious site I inserted in the QR code, without even asking your opinion.\nHowever, some QR code scanners do not automatically redirect the user to the malicious site, but rather display the link with the \"Go to site\" option. Other scanners don't even show this option.\nHowever, in the case of Brave, the browser automatically redirects the user to the malicious site without their consent, which poses a significant security risk to users.\nSupporting Material/References:\nhttps://resources.infosecinstitute.com/topic/security-attacks-via-malicious-qr-codes/\nhttps://shahjerry33.medium.com/open-redirection-qr-code-magic-18ace1a0170f\nImpact\nHere are some potential business impacts that this security vulnerability could have in Brave 1.50.114, Chromium 112.0.5615.49 on Android 11; Build/RP1A.200720.011:\nThe fact that Brave's QR code scanner opens the link without the user's notice has a big impact on user security. This vulnerability allows an attacker to redirect a Brave user to a malicious site without the user being able to see the link and make an informed decision. This can lead to exposure to malware or phishing attacks that can compromise user data.\nThe actual impact depends on the nature of the malicious link to which the user is redirected. In the worst case, the link may be designed to steal sensitive information, such as credit card information, credentials, or other personal information. This can lead to loss of privacy and financial damage to the user.\nMoreover, if the user is redirected to a malicious site that contains malware, then it can compromise the security of the user's device and lead to loss of important data. Overall, the fact that Brave's QR code scanner automatically opens malicious links without user's notice poses a significant risk to user security and should be fixed as soon as possible.\nIncreased Risk of Phishing: Exploiting this vulnerability could allow attackers to direct Brave users to malicious sites that can be used to steal sensitive information such as usernames, passwords, banking and other personal information.\nExposure to malware: Malicious sites that users are redirected to may also contain malware that can infect Brave users' devices with malicious programs such as viruses, Trojans or ransomware.\nPrivacy loss: Brave users may also be at risk of privacy loss if sensitive information is stolen as a result of the exploitation of this vulnerability.\nLoss of user trust: If Brave users fall victim to attacks as a result of exploiting this vulnerability, they may lose trust in the application and seek out more secure alternatives, which could impact reputation of the application and the company.\nFinancial costs: If users fall victim to attacks as a result of this vulnerability, they may suffer financial losses, which may lead to legal action and financial costs to the company responsible for the application.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Open Redirect"
    ],
    "screenshots": {
        "image_0": "https://hackerone-us-west-2-production-attachments.s3.us-west-2.amazonaws.com/e2cs636ype8ybqp0uq2jh6hkaw1q?response-content-disposition=attachment%3B%20filename%3D%22QR_CODE_BRAVE.png%22%3B%20filename%2A%3DUTF-8%27%27QR_CODE_BRAVE.png&response-content-type=image%2Fpng&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQGK6FURQ7FC4X3GK%2F20250324%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250324T235139Z&X-Amz-Expires=3313&X-Amz-Security-Token=IQoJb3JpZ2luX2VjEJv%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJGMEQCIHZIl66o32FE6IZh%2B9Esolbj3p0fpTa3b2MvibHyI0y0AiBQhjy4n6wpQ64dQBA2aQxEftSrg3JWZubYAkljDpRniCq7BQj0%2F%2F%2F%2F%2F%2F%2F%2F%2F%2F8BEAMaDDAxMzYxOTI3NDg0OSIMogC0K6LtAguRYS65Ko8FqVdvx%2F9NK6alwAagIgcM5S%2B6lDltgh75I1rFoKkMMHQZmey0FAnWlyoNc%2BveFTfijKx89NS3RtDg3ZZUV%2FkmUs7V3BWGOvl1IoFZGRdj4V5%2Fq9VTUFhMDFG9SviRMzQkjKBj%2FS2%2Bh7GSKdAS1v%2B4ZQxzOPaMKdBHVXfUZ2moBcfEPOUC1iA90B1WL0Ifta6%2B5Yp%2FEhd1VDTADSFdiDHrkw1G2bwqfkW%2FJiprJ9ANjxzg4AZZQXMs1YkNjHIEqJSDj904xlT6T1wv2OXBQqMpHW%2BNz7mN2iZUZ9jXTbxeK8gIOAgK11i%2BWonSN83Y2u%2B3teLBGazTNyqJ3BCfj1Pg%2BxPUPQKxq2wNGc3W%2BsKHrfj8IlPhfA1%2FGYyZodngKoli9ZglZF2pB23f27iWzg8iAw%2FtkSTTbP4LWD6cC0DzJq%2BIxM7K8i%2BhIAGkycg65KYv8naf0XQc%2BVrSe4WFFnTMf8QN8EoYtHfYuv2nAoYVT14K3eYWo3TvR76QIrAeLsy1IC09auIjCS95vhN%2BhlA%2FbtWJRiUAViXdBEegzZey%2BA1WDpzj4Md42IJto2BMVwPcm9JVkxsvXE5GxJRGYk3YBtAcT1jGBaFxYaYbg6Mih1ZK1%2FOoau615Tv9vnRcDQ64e3ylfvEMJijk042PHwMqZy0w7q8wyRgXPGmXuA7OTQaRM7NjUuT87eyPzX%2B8VYy%2BDGCleoxjW6mTj1rtTez6X4huorR0g0iLjPRbODdqqlUFYKtdDLTOTatKhpMwesT7pM3nwn%2FZweKtfNZI3Htc9qkcjv2tDlRvF%2Fn53o92r6j%2FJjMpsh%2BsHNrLrymaXr7NSpZx3njfesmxLeqCjWXRguzqOEfJ5tbvltbpo3bWSzC3zIa%2FBjqyAb9iAVnLpZTkrgsjPj3dfDTpduboFnMKQu30fy1CYjETQZygxC7SGEbzNYNKgSs%2FNWUTPCNCIyNk%2Flo5KGyiAXU6UQDc%2BtonmAEoVhtB8V3aSpUO3mMo3vH4EVFJLAGlDIglmvJ8DVe4sOCE8TGq3utbaJH%2FM42Ad2T3iJZI9hUjooQZwrZJCzJG6ZcfCnop6MyQ3PWU4d1%2BVPVeijA23aQnj22DxVV%2BbeH%2BRK1kMUzCuF8%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=a086eec2844467dd7099ba49314470b495b99d1a4f05388d279bd1461e70e762"
    },
    "disclosed_date": 1686214320,
    "report_url": "https://hackerone.com/reports/1946534",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "MOBILE",
    "steps": [
        [
            1,
            "Generate a QR code containing a malicious link (e.g., www.evil.com) using a QR code generator website."
        ],
        [
            2,
            "Scan the QR code using Brave browser's built-in QR code scanner. The browser will automatically redirect to the malicious link without user confirmation."
        ]
    ],
    "vuln_description": "The vulnerability is an open redirect issue in Brave browser's QR code scanner. When a user scans a QR code containing a malicious link, the browser automatically redirects to the link without any user interaction or warning, potentially exposing the user to phishing or malware attacks.",
    "reason": "The vulnerability is straightforward to discover as it involves a single component (QR code scanner) and does not require complex interactions or state manipulation. The behavior of automatic redirection without user confirmation is a clear and obvious security flaw.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}