{
    "reported_to": "Automattic",
    "reported_by": "sodium_ ",
    "title": "Authentication bypass on JetPack SSO manager - Allows to access the administration panel of wordpress without user interaction",
    "content": "\nHello team,\nSummary:\nThe JetPack SSO manager is plugin that allows any user to log into their wordpress using the same log-in credentials you use for WordPress.com, then they’ll now be able to register for and sign in to self-hosted WordPress.org sites quickly, example :\nUser creates their wordpress instance at host.com, they install and enable JetPack SSO\nThey later can login into their wordpress instance at host.com using wordpress.com, users are also can make other users register/login with the same company email (@host.com) and access the administration panel of the host\nDescription :\nThe user anyways when he tries to authenticate into his wordpress instance via wordpress.com he gotta have his email confirmed, otherwise it won't work, interstingly there is a way that bypasses the email confirmation when a user invites you to his account and you accept his invite your account will be confirmed, chaining those issues the following scenario can result for the authentication bypass of any wordpress instance when these circumestances are met :\nwordpress installed on host.com have jetpack installed and \"Match accounts using email addresses\" enabled (IDK if this is necessary anyways)\nwordpress instance have a user with specific email, that email does not exist on wordpress.com\nYou can access this host.com wordpress panel via\nSteps To Reproduce:\nSetup\nInstall Jetpack latest version, once installed go to plugins>Jetpack>settings>\"Match accounts using email addresses\">enable (I'm not sure if this is intended or not)\nAdd user into your wordpress (host.com) with their email (says something@company.com)\nAs attacker (email confirmation bypass) :\nCreate two accounts at Wordpress.com\nA/. One with your personal email and confirm it\nB/. Second with the victim's existed user at host.com email (something@company.com)\nAt your confirmed wordpress.com account go to settings >users invite your second account (something@company.com)\nAt your second account go to notifications at the top right, see the invitation and accept it\nSee that your Wordpress.com account’s email has been verified (email confirmation bypass )\nCreate two accounts at Wordpress.com\nA/. One with your personal email and confirm it\nB/. Second with the victim's existed user at host.com email (something@company.com)\nAt your confirmed wordpress.com account go to settings >users invite your second account (something@company.com)\nAt your second account go to notifications at the top right, see the invitation and accept it\nSee that your Wordpress.com account’s email has been verified (email confirmation bypass )\naccess the wordpress admin panel\nNow at the same browser where the (something@company.com) Wordpress.com account\ngo to host.com wordpress panel\nClick on sign in with wordpress.com\nForward\nSee yourself logged in as admin on host.com wordpress\nNow at the same browser where the (something@company.com) Wordpress.com account\ngo to host.com wordpress panel\nClick on sign in with wordpress.com\nForward\nSee yourself logged in as admin on host.com wordpress\nPlatform(s) Affected:\nJetPack latest version\nSupporting Material/References:\nAs example I bypass ███████\n██████\nImpact\nBypass authentication of websites that runs wordpress with JetPack plugin without any user inteaction\nRegards,\nAdam\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "None"
    ],
    "screenshots": {},
    "disclosed_date": 1703767440,
    "report_url": "https://hackerone.com/reports/2037902",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "HIGH",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Install Jetpack latest version and enable 'Match accounts using email addresses' in settings."
        ],
        [
            2,
            "Add a user to the WordPress instance with their email (e.g., something@company.com)."
        ],
        [
            3,
            "Create two WordPress.com accounts: one with a personal email (confirmed) and another with the victim's email (something@company.com)."
        ],
        [
            4,
            "From the confirmed WordPress.com account, invite the second account (something@company.com)."
        ],
        [
            5,
            "Accept the invitation in the second account, bypassing email confirmation."
        ],
        [
            6,
            "Log in to the WordPress instance (host.com) using the second account via WordPress.com SSO."
        ],
        [
            7,
            "Gain unauthorized access to the WordPress admin panel."
        ]
    ],
    "vuln_description": "The vulnerability allows an attacker to bypass email confirmation in JetPack SSO by exploiting the invitation system. By creating a WordPress.com account with the victim's email and accepting an invitation from another account, the attacker can bypass email verification and gain unauthorized access to the WordPress admin panel.",
    "reason": "The attack involves multiple components (WordPress.com accounts, email confirmation bypass, SSO login) and requires understanding the interaction between these components. The bypass of email confirmation via invitation acceptance is a subtle and non-obvious interaction.",
    "new_complexity": "HIGH",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}