{
  "reported_to": "Khan Academy",
  "reported_by": "hack40077 ",
  "title": " SSL/TLS Vulnerability at khanacademy.org",
  "content": "\nCVE - 2011 - 3389\nDescription :\nThe SSL protocol, as used in certain configurations in Microsoft Windows and Microsoft Internet Explorer, Mozilla Firefox, Google Chrome, Opera, and other products, encrypts data by using CBC mode with chained initialization vectors, which allows man-in-the-middle attackers to obtain plaintext HTTP headers via a blockwise chosen-boundary attack (BCBA) on an HTTPS session, in conjunction with JavaScript code that uses (1) the HTML5 WebSocket API, (2) the Java URLConnection API, or (3) the Silverlight WebClient API, aka a \"BEAST\" attack.\nProblem Location :\nhttps://www.khanacademy.org/\nMitigation :\nThe Upgrade TLS version on the server to latest stable version\nCVE - 2013 - 0169 :\nDescription :\nThe TLS protocol 1.1 and 1.2 and the DTLS protocol 1.0 and 1.2, as used in OpenSSL, OpenJDK, PolarSSL, and other products, do not properly consider timing side-channel attacks on a MAC check requirement during the processing of malformed CBC padding, which allows remote attackers to conduct distinguishing attacks and plaintext-recovery attacks via statistical analysis of timing data for crafted packets, aka the \"Lucky Thirteen\" issue.\nProblem Location :\nhttps://www.khanacademy.org/\nMitigation :\nThe Upgrade TLS version on the server to latest stable version .\nSweet 32 Attack - CVE-2016-2183,\nDescription :\nA flaw was found in the way the DES/3DES cipher was used as part of the TLS/SSL protocol. A man-in-the-middle attacker could use this flaw to recover some plaintext data by capturing large amounts of encrypted traffic between TLS/SSL server and client if the communication used a DES/3DES based ciphersuite.\nProblem Location :\nhttps://www.khanacademy.org/\nMitigation :\n\nThe removed DES/3DES from the supported lists of crypto algorithms.\nTLS libraries and applications should limit the length of TLS sessions with a 64-bit cipher.\nReferences :\nhttps://sweet32.info/\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": null,
  "weaknesses": [
    "Cryptographic Issues - Generic"
  ],
  "screenshots": {},
  "disclosed_date": 1487796000,
  "report_url": "https://hackerone.com/reports/207457",
  "is_multi_component": false,
  "complexity": "MEDIUM",
  "novelty": "LOW",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Identify the target website (https://www.khanacademy.org/) and check for SSL/TLS vulnerabilities."
    ],
    [
      2,
      "Use tools like OpenSSL or vulnerability scanners to detect the presence of CVE-2011-3389 (BEAST attack), CVE-2013-0169 (Lucky Thirteen), and CVE-2016-2183 (Sweet 32)."
    ]
  ],
  "vuln_description": "The vulnerabilities reported involve outdated SSL/TLS protocols and weak cipher suites (DES/3DES) on khanacademy.org, which are susceptible to known attacks like BEAST, Lucky Thirteen, and Sweet 32. These vulnerabilities allow man-in-the-middle attackers to decrypt parts of the encrypted traffic or recover plaintext data.",
  "reason": "The discovery of these vulnerabilities is straightforward as they involve well-documented CVEs and can be detected using standard tools. The attack does not require complex interactions or novel logic, and the steps to identify them are well-known in the security community.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}