{
    "reported_to": "WakaTime",
    "reported_by": "normalguy46 ",
    "title": "Waketime Payment Gateway Vulnerability",
    "content": "\nSummary: Waketime's payment gateway does not encrypt data in transit, which could allow an attacker to intercept and capture card information. This vulnerability could be exploited by a man-in-the-middle (MITM) attack, in which the attacker would insert themselves between the user and the payment gateway, intercepting the data as it is transmitted.\nSteps to Reproduce:\nVisit the Waketime website.\nProceed to subscribe and enter your credit card information.\nObserve that the data is not encrypted in transit.\nExpected Results: The data should be encrypted in transit, using a secure protocol.\nActual Results: The data is not encrypted in transit, and could be intercepted by an attacker.\nImpact\nA man-in-the-middle attack is a type of cyberattack in which an attacker inserts themselves between two parties, intercepting and modifying the communication between them.\n\n",
    "severity": [
        7.5,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "Missing Encryption of Sensitive Data"
    ],
    "screenshots": {},
    "disclosed_date": 1691269500,
    "report_url": "https://hackerone.com/reports/2097517",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Visit the Waketime website."
        ],
        [
            2,
            "Proceed to subscribe and enter your credit card information."
        ],
        [
            3,
            "Observe that the data is not encrypted in transit."
        ]
    ],
    "vuln_description": "Waketime's payment gateway does not encrypt data in transit, which could allow an attacker to intercept and capture card information. This vulnerability could be exploited by a man-in-the-middle (MITM) attack.",
    "reason": "The vulnerability is straightforward to discover as it only requires observing the lack of encryption during a standard transaction process. There are no complex interactions or multiple components involved.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}