{
    "reported_to": "Internet Bug Bounty",
    "reported_by": "asanso ",
    "title": "Critical vulnerability in JSON Web Encryption (JWE) - RFC 7516 Invalid Curve attack",
    "content": "\nWe found an issue in the JWE specification where it fails to warn the implementers about Invalid Curve attack.\nWe found several libraries to be vulnerable : node-jose, jose2go, Nimbus JOSE+JWT and jose4j and in the process of filing an errata for the RFC.\nWe report the vulnerabilities to the maintainers that promptly fixed the issue.\nWe also wrote a blog post about it in order to reach the highest number of people potentially vulnerable. You can find the write up in [0,1,2].\n[0] http://blog.intothesymmetry.com/2017/03/critical-vulnerability-in-json-web.html\n[1] http://blogs.adobe.com/security/2017/03/critical-vulnerability-uncovered-in-json-encryption.html\n[2] https://auth0.com/blog/critical-vulnerability-in-json-web-encryption/\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": 1000,
    "weaknesses": [
        "Cryptographic Issues - Generic"
    ],
    "screenshots": {},
    "disclosed_date": 1573569900,
    "report_url": "https://hackerone.com/reports/213437",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "CODE",
    "steps": [
        [
            1,
            "Identify a JWE implementation that uses elliptic curve cryptography (ECC) for key agreement (e.g., ECDH-ES)."
        ],
        [
            2,
            "Craft a malicious JWE token with an invalid curve point to trigger the Invalid Curve Attack."
        ],
        [
            3,
            "Send the crafted JWE token to the target system and observe if the system processes it incorrectly, potentially leading to key disclosure or other cryptographic failures."
        ]
    ],
    "vuln_description": "The vulnerability is an Invalid Curve Attack in JSON Web Encryption (JWE) implementations that use elliptic curve cryptography (ECC) for key agreement. The JWE specification (RFC 7516) fails to warn implementers about this attack, which allows an attacker to exploit weak curves or invalid points to compromise the cryptographic security of the system.",
    "reason": "This vulnerability requires deep knowledge of elliptic curve cryptography and the JWE specification. The attacker must understand how to craft invalid curve points and how different libraries handle such points. The attack involves subtle interactions between the JWE implementation and the underlying cryptographic library, making it non-obvious to discover.",
    "new_complexity": "HIGH",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}