{
    "reported_to": "U.S. Dept Of Defense",
    "reported_by": "mrr0b0t2324 ",
    "title": "User automatically logged in as Sys Admin user on https://███/Administration/Administration.aspx",
    "content": "\nDescription:\nAny user can access the Administration section of the following URL: https://███\nWhen the user goes to the following domain they are automatically logged in as \"████████\" which is a sys admin user on the application, this allows any user to upload files, add users, change permissions for users and delete users.\nReferences\nImpact\nA malicious actor can modify other user's privileges on the application, add users, upload files, delete users. They can also add false information to the application which will jeopardize the integrity of the application. With administrator privileges they have no restrictions on the application.\nSystem Host(s)\nhttps://█████████\nAffected Product(s) and Version(s)\nCVE Numbers\nSteps to Reproduce\nStep 1) Go to the following URL: https://███\nThere you will se that you are logged in as a Sys Admin user\nSuggested Mitigation/Remediation Actions\nThe application should prompt a user to authenticate first before being able to do any other actions on the system.\n\n",
    "severity": [
        9.0,
        10.0
    ],
    "bounty": null,
    "weaknesses": [
        "Improper Access Control - Generic"
    ],
    "screenshots": {},
    "disclosed_date": 1699046100,
    "report_url": "https://hackerone.com/reports/2190808",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Navigate to the URL: https://███/Administration/Administration.aspx"
        ]
    ],
    "vuln_description": "The application automatically logs in any user as a sys admin when accessing the administration URL, allowing unauthorized users to perform administrative actions such as uploading files, adding users, changing permissions, and deleting users.",
    "reason": "The vulnerability is straightforward to discover as it requires no complex interactions or manipulations of the application state. The issue is immediately apparent upon accessing the administration URL without any authentication.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null,
    "idor_detectable": false,
    "authnz_byppass_detectable": true,
    "is_simple_payload": false,
    "injection_metadata": {
        "is_simple_payload": false
    },
    "authnz_metadata": {
        "idor_detectable": false,
        "authnz_byppass_detectable": true
    }
}