{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "archyxsec ",
  "title": "Improper Authentication (Login without Registration with any user) at ████",
  "content": "\nHi Team!\nI found a security issue in ███████. An attacker could login as a any user without registration in the page and above all it can change the session of a victim and authenticate him as any user.\nThe problem is at the endpoint ██████████ which, thanks to the signin parameter, allows to authenticate anyone with any user.\nImpact\nAuthentication bypass (Login as any user without authentication)\nForce a victim to change session with other user\nSystem Host(s)\n████\nAffected Product(s) and Version(s)\nCVE Numbers\nSteps to Reproduce\nGo to ██████████\nTo check the authentication bypass go to ████:\n███\nAs the link corresponds to a GET request you can force any user to log out and authenticate to any other account.\nAdditional bonus: clientid and clientsecret are stored in the page source\n███████\nSuggested Mitigation/Remediation Actions\n\n",
  "severity": "[",
  "bounty": null,
  "weaknesses": "[",
  "screenshots": {},
  "disclosed_date": 1711144200,
  "report_url": "https://hackerone.com/reports/2334420",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "WEB_APP",
  "steps": "[",
  "vuln_description": "The vulnerability allows an attacker to bypass authentication and login as any user without registration. Additionally, the attacker can force a victim to change their session to another user's session. The issue stems from an endpoint that improperly handles the signin parameter, enabling unauthorized access.",
  "reason": "The vulnerability is straightforward to exploit once the endpoint and parameter are identified. It does not involve complex interactions or multiple components, making it relatively easy to discover.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": false,
  "authnz_byppass_detectable": true,
  "injection_classification": "}"
}