{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "guido ",
  "title": "rpcbind \"rpcbomb\" CVE-2017-8779, CVE-2017-8804",
  "content": "\nDescription: this allowed an attacker to easily disrupt a remote system through excessive memory consumption.\nWriteup: https://guidovranken.wordpress.com/2017/05/03/rpcbomb-remote-rpcbind-denial-of-service-patches/\nDemonstration video: https://www.youtube.com/watch?v=b38H3oEgrQw (this video shows that the attack doesn't necessarily just crashes the rpcbind process, but that the entire system can slow down severely because it has to resort to swap memory, even if overcommit is enabled. This implies scope=changed in the CVSS. But I filled out unchanged to be consistent with the official assessment)\nCVSS score: https://nvd.nist.gov/vuln/detail/CVE-2017-8779\nrpcbind/libtirpc: CVE-2017-8779 http://git.linux-nfs.org/?p=steved/libtirpc.git;a=commit;h=dd9c7cf4f8f375c6d641b760d124650c418c2ce3 (patches by me)\nGLIBC: CVE-2017-8804 https://sourceware.org/bugzilla/show_bug.cgi?id=21461\n\n",
  "severity": [
    7.5,
    null
  ],
  "bounty": null,
  "weaknesses": [
    "Uncontrolled Resource Consumption"
  ],
  "screenshots": {},
  "disclosed_date": 1571027040,
  "report_url": "https://hackerone.com/reports/235016",
  "is_multi_component": true,
  "complexity": "MEDIUM",
  "novelty": "HIGH",
  "vuln_category": "API",
  "steps": [
    [
      1,
      "Identify a target system running rpcbind service vulnerable to CVE-2017-8779 or CVE-2017-8804"
    ],
    [
      2,
      "Send specially crafted RPC requests to the target system to trigger excessive memory consumption"
    ]
  ],
  "vuln_description": "This vulnerability in rpcbind (CVE-2017-8779) and GLIBC (CVE-2017-8804) allows an attacker to cause a denial of service by consuming excessive memory through specially crafted RPC requests. The attack can severely slow down or crash the system by forcing it to use swap memory, even when overcommit is enabled.",
  "reason": "The vulnerability involves understanding the RPC protocol and crafting specific requests to trigger memory exhaustion. While the attack vector is straightforward (sending malicious RPC requests), the impact on system memory management and the interaction with swap space adds some complexity. The vulnerability doesn't require multiple components or complex state manipulation, but does require knowledge of RPC protocol implementation details.",
  "new_complexity": "MEDIUM",
  "requires_code": true,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}