{
  "reported_to": "Nextcloud",
  "reported_by": "maprambo ",
  "title": "Password of failed (2FA) login attempt is stored in log",
  "content": "\nIf I try to log in on Webdav with my usual Nextcloud password, it doesn't work due to 2FA. I need an application password.\nThe password of a failed login attempt by any user is stored plain text in the log:\n[...]OCA\\\\\\\\DAV\\\\\\\\Connector\\\\\\\\Sabre\\\\\\\\Auth->validateUserPass('matthes', '***THE_PASSWORD***')[...]\nEven though the login attempt failed, the password is the right password. I am using two factor, but still, the password may not be leaked to anyone. It may also be used for other websites or services, like LDAP. And you can disable 2FA and still use the same password. The log is in some cases visible to multiple people, may it be admins (but who shouldn't have access to the user data) or if the file is just sent to someone else for debugging.\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": null,
  "weaknesses": [
    "Plaintext Storage of a Password"
  ],
  "screenshots": {},
  "disclosed_date": 1583089800,
  "report_url": "https://hackerone.com/reports/244092",
  "is_multi_component": false,
  "complexity": "MEDIUM",
  "novelty": "LOW",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Attempt to log in to Nextcloud WebDAV using a valid username and password with 2FA enabled."
    ],
    [
      2,
      "Check the server logs to observe that the password is stored in plain text despite the login failure due to 2FA."
    ]
  ],
  "vuln_description": "The password of a failed login attempt is stored in plain text in the server logs, even when 2FA is enabled. This exposes sensitive user credentials to anyone with access to the logs, including admins or third parties for debugging purposes.",
  "reason": "The vulnerability involves a straightforward interaction between the login attempt and logging mechanism, without requiring complex state manipulation or novel logic. The issue is primarily due to improper handling of sensitive data in logs.",
  "new_complexity": "LOW",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null
}