{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "bart ",
  "title": "Assertion failed in node::http2::Http2Session::~Http2Session() leads to HTTP/2 server crash",
  "content": "\nAn attacker can make the Node.js HTTP/2 server completely unavailable by sending a small amount of HTTP/2 frames packets with a few HTTP/2 frames inside. It is possible to leave some data in nghttp2 memory after reset when headers with HTTP/2 CONTINUATION frame are sent to the server and then a TCP connection is abruptly closed by the client triggering the Http2Session destructor while header frames are still being processed (and stored in memory) causing a race condition.\nAdvisory: https://nodejs.org/en/blog/vulnerability/april-2024-security-releases\nHackerOne report: 2319584\nImpact\nServer crashes instantly after sending a few HTTP/2 frames.\n\n",
  "severity": [
    7.5,
    null
  ],
  "bounty": 3645,
  "weaknesses": [
    "Uncontrolled Resource Consumption"
  ],
  "screenshots": {},
  "disclosed_date": 1714438860,
  "report_url": "https://hackerone.com/reports/2453328",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "MEDIUM",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Send HTTP/2 frames with CONTINUATION headers to the Node.js HTTP/2 server."
    ],
    [
      2,
      "Abruptly close the TCP connection before the server finishes processing the headers."
    ]
  ],
  "vuln_description": "An attacker can crash the Node.js HTTP/2 server by sending a small number of HTTP/2 frames with CONTINUATION headers and then abruptly closing the TCP connection. This triggers a race condition in the Http2Session destructor, leading to an assertion failure and server crash.",
  "reason": "The vulnerability involves understanding HTTP/2 protocol specifics, particularly CONTINUATION frames, and the timing of connection closure to trigger a race condition in the server's memory handling. The interaction between the HTTP/2 frames and the server's session cleanup is subtle and non-obvious.",
  "new_complexity": "HIGH",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null
}