{
    "reported_to": "HackerOne",
    "reported_by": "abdulprkr ",
    "title": "Business Logic error leads to bypass 2FA requirement ",
    "content": "\nHi team,\nSummary\nI have identified a business logic issue in the 2FA requirement. I noticed that the organization enables the 2FA requirement so that only reporters who have set up 2FA can report, due to security reasons. This is because the report contains sensitive information, and if a hacker's credentials are compromised, the 2FA protection should be in place. This ensures that the vulnerability reported by the hacker remains secure. However, if the hacker adds another hacker as a collaborator, the hackerone does not check whether the invited hacker has set up 2FA or not. The invited hacker can join the report without any 2FA requirement, which contains the same sensitive information that the organization has mandated 2FA to protect. Therefore, it is necessary to ensure that the invited hacker also has 2FA set up. Otherwise, they should not be able to accept the invitation until they set up 2FA. This would ensure that only those hackers who have set up 2FA can access the organization's report.\nStep to Reproduce:\nStep 1: Create 2 account one with 2FA enable (A) & another without 2FA (B)\nStep 2: Select Program which required 2FA & allow collabration\nStep 3: Create Report Using account (A) & add account (B) ass collaborator\nStep 4: Submit Report\nStep 5: Observe that invitation sent Successfully\nStep 6: Now accept Invitation & observe that now you can access the report without 2FA requirement\nImpact\nSensitive Information Exposure: The primary objective of implementing 2FA is to secure sensitive information in reports. If a hacker without 2FA is invited as a collaborator, they can access this sensitive information without the additional security layer. This defeats the purpose of having 2FA, leaving sensitive data vulnerable to unauthorized access.\nIncreased Risk of Data Breaches: If a hacker's credentials are compromised, the 2FA protection is supposed to mitigate this risk. Allowing a collaborator without 2FA exposes the organization to potential data breaches, as the compromised credentials can be used to gain access to reports containing critical vulnerabilities.\n\n",
    "severity": [
        8.2,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "Business Logic Errors"
    ],
    "screenshots": {},
    "disclosed_date": 1720722720,
    "report_url": "https://hackerone.com/reports/2571981",
    "is_multi_component": false,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Create two accounts: one with 2FA enabled (A) and another without 2FA (B)."
        ],
        [
            2,
            "Select a program that requires 2FA and allows collaboration."
        ],
        [
            3,
            "Create a report using account (A) and add account (B) as a collaborator."
        ],
        [
            4,
            "Submit the report."
        ],
        [
            5,
            "Observe that the invitation is sent successfully."
        ],
        [
            6,
            "Accept the invitation with account (B) and observe that you can access the report without 2FA."
        ]
    ],
    "vuln_description": "A business logic error allows bypassing the 2FA requirement by inviting a collaborator without 2FA. The invited collaborator can access sensitive report information without the additional security layer, defeating the purpose of 2FA.",
    "reason": "The vulnerability involves understanding the 2FA requirement and collaboration feature, but the steps to exploit it are straightforward once the logic flaw is identified. The interaction between 2FA and collaboration is non-obvious but not highly complex.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}