{
    "reported_to": "U.S. Dept Of Defense",
    "reported_by": "hackerfactor ",
    "title": "Gateway information leakage",
    "content": "\nSummary:\nMany DoD systems use BlueCoat gateways. These gateways insert unique BlueCoat ids that permit tracking DoD users and gaining insight into the DoD network architecture when DoD users access the Internet.\nDescription:\nI run a popular web service (FotoForensics.com -- it's around 150,000 in the Alexa list of top web sites). My public web site is explicitly for research and gets visitors from all over, including from the DoD. One of the research project collects non-standard HTTP headers. The BlueCoat HTTP headers immediately stood out as non-standard.\nSomeone with a BlueCoat gateway will have headers that look like:\nPOST /upload-file.php HTTP/1.1\nHost: www.fotoforensics.com\nContent-Length: 70869\nCache-Control: max-age=0\nOrigin: http://www.fotoforensics.com\nUpgrade-Insecure-Requests: 1\nUser-Agent: Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/52.0.2743.116 Safari/537.36\nContent-Type: multipart/form-data; boundary=----WebKitFormBoundaryPaSgeQQ5m6kh7aaZ\nAccept: text/html,application/xhtml+xml,application/xml;q=0.9,image/webp,/;q=0.8\nReferer: http://www.fotoforensics.com/\nAccept-Language: en-█████████,en;q=0.8\n██████████: ██████ (███) SC\nConnection: Keep-Alive\n█████████: █████████\n(This example came from a user at the United States Patent and Trademark Office.)\nThe id found on the \"██████████\" line is unique to the Bluecoat device; it is not unique to the user. However, if this ID ever shows up at a different network address, then it permits a remote (outside of DoD) system to identify associated network addresses, multiple proxy exits, and potentially non-attributable networks. Similarly, if a single IP address is associated with multiple Bluecoat ids, then it denotes a single exit proxy and identifies the (minimum) number of subnets that use the proxy.\nFor example:\n█████████\n██████\n██████████\n█████████\n████████\n██████\n██████████\nMy server has seen this one IP address associated with 7 different Bluecoat devices.\n███\n████\n█████████\n██████████\nThis single bluecoat ID has been linked to four different network addresses.\n███\n████████\nThis bluecoat id (████) is interesting because it has been seen on two very different subnets.\n█████████\n███\nThis bluecoat ID moved locations: it was seen in████ and in/near ███████. (Imagine what it could tell an observer if it were to suddenly appear in █████████...)\nI have currently collected 243 bluecoat IDs associated with \"████████\". In addition, I've collected 120 bluecoat IDs from the █████████ Group, 71 ids from the \"Headquarters, ██████████AISC\", and ids from many other government organizations.\nFor example:\n██████\n███\n█████\n█████\n█████\nThis one bluecoat id has been observed with both the Department of the Interior and with ██████████GS. The first 3 ip addresses have hostnames that say \"usgs.gov\", but the others either lack hostnames or are from the national parks service (nps.gov). And this one id is from 5 IP addresses that span 4 different subnets.\nImpact\nDoD uses Bluecoat gateways with unique IDs enabled. The unique IDs are supposed to prevent proxy forwarding loops between Bluecoat devices. However, they permit external observers from (1) determining that a Bluecoat device is in use, (2) tracking the device, and (3) gaining insight into the DoD network architecture.\nWhen combined with user-agent strings and other distinct and unique identifiers, this combination of ID and IP address permits determining who likely works with whom.\n(Let me know if you want the full list for DoD bluecoat devices. And if you want them for other ██████ Gov/Mil groups, let me know.)\nSuggested Mitigation/Remediation Actions\nIt varies by Bluecoat device, but buried in each system's configuration menu is an option to disable the unique ID. These should be disabled everywhere.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Privacy Violation"
    ],
    "screenshots": {},
    "disclosed_date": 1564512120,
    "report_url": "https://hackerone.com/reports/258410",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Run a popular web service that collects non-standard HTTP headers from visitors."
        ],
        [
            2,
            "Analyze the collected headers to identify unique BlueCoat IDs inserted by DoD systems."
        ],
        [
            3,
            "Track the BlueCoat IDs over time to observe associations with different IP addresses and subnets."
        ],
        [
            4,
            "Correlate the IDs with user-agent strings and other identifiers to gain insight into DoD network architecture."
        ]
    ],
    "vuln_description": "The vulnerability involves the leakage of unique BlueCoat IDs in HTTP headers, which allows external observers to track DoD users and gain insight into the DoD network architecture. These IDs can be used to identify associated network addresses, multiple proxy exits, and potentially non-attributable networks.",
    "reason": "The discovery of this vulnerability requires the ability to collect and analyze non-standard HTTP headers, which is not a common practice. Additionally, the tester needed to recognize the significance of the BlueCoat IDs and their potential for tracking and network mapping. The steps involve multiple components, including header collection, analysis, and correlation over time, but the interactions between these components are straightforward once the initial observation is made.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}