{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "orange ",
  "title": "important: Apache HTTP Server weakness with encoded question marks in backreferences (CVE-2024-38474)",
  "content": "\nI reported this vulnerability through the official Apache HTTP Server security email on April 1, 2024, and received a fix along with a CVE number on July 1, 2024. You can check detailed information from there:\nhttps://httpd.apache.org/security/vulnerabilities_24.html\nImpact\nSubstitution encoding issue in mod_rewrite in Apache HTTP Server 2.4.59 and earlier allows attacker to execute scripts in\ndirectories permitted by the configuration but not directly reachable by any URL or source disclosure of scripts meant to only to be executed as CGI.\nUsers are recommended to upgrade to version 2.4.60, which fixes this issue.\nSome RewriteRules that capture and substitute unsafely will now fail unless rewrite flag \"UnsafeAllow3F\" is specified.\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": 4920,
  "weaknesses": [
    "Improper Input Validation"
  ],
  "screenshots": {},
  "disclosed_date": 1720895760,
  "report_url": "https://hackerone.com/reports/2585381",
  "is_multi_component": true,
  "complexity": "MEDIUM",
  "novelty": "MEDIUM",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Identify a target Apache HTTP Server (version 2.4.59 or earlier) with mod_rewrite enabled and configured to use backreferences in RewriteRules."
    ],
    [
      2,
      "Craft a malicious URL that includes an encoded question mark (%3F) in a backreference to bypass security restrictions and access or disclose scripts in directories not directly reachable by URL."
    ]
  ],
  "vuln_description": "The vulnerability involves a substitution encoding issue in mod_rewrite where encoded question marks in backreferences can bypass security restrictions, allowing attackers to execute or disclose scripts in directories that should not be directly accessible.",
  "reason": "The attack requires understanding of mod_rewrite's backreference handling and the specific encoding of question marks, but does not involve complex interactions or novel logic beyond standard web server configuration knowledge.",
  "new_complexity": "MEDIUM",
  "requires_code": false,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}