{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "orange ",
  "title": "important: Apache HTTP Server may use exploitable/malicious backend application output to run local handlers via internal redirect (CVE-2024-38476)",
  "content": "\nI reported this vulnerability through the official Apache HTTP Server security email on April 1, 2024, and received a fix along with a CVE number on July 1, 2024. You can check detailed information from there:\nhttps://httpd.apache.org/security/vulnerabilities_24.html\nImpact\nVulnerability in core of Apache HTTP Server 2.4.59 and earlier are vulnerably to information disclosure, SSRF or local script execution via backend applications whose response headers are malicious or exploitable.\nNote: Some legacy uses of the 'AddType' directive to connect a request to a handler must be ported to 'SetHandler' after this fix.\nUsers are recommended to upgrade to version 2.4.60, which fixes this issue.\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": 4920,
  "weaknesses": [
    "Inclusion of Functionality from Untrusted Control Sphere"
  ],
  "screenshots": {},
  "disclosed_date": 1720895760,
  "report_url": "https://hackerone.com/reports/2585376",
  "is_multi_component": false,
  "complexity": "HIGH",
  "novelty": "MEDIUM",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Configure a malicious backend application that manipulates response headers to include exploitable content."
    ],
    [
      2,
      "Send a request to the Apache HTTP Server (version 2.4.59 or earlier) that triggers the backend application to return the manipulated headers."
    ]
  ],
  "vuln_description": "The vulnerability in Apache HTTP Server (CVE-2024-38476) allows for information disclosure, SSRF, or local script execution when the server processes malicious or exploitable response headers from backend applications. This occurs due to improper handling of internal redirects, which can be manipulated to run local handlers.",
  "reason": "The vulnerability involves understanding how Apache HTTP Server processes backend application responses and how internal redirects can be exploited. While the attack requires knowledge of server internals and header manipulation, the steps to exploit are relatively straightforward once the underlying mechanism is understood.",
  "new_complexity": "MEDIUM",
  "requires_code": false,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}