{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "joernchen ",
  "title": "RCE via ssh:// URIs in multiple VCS ",
  "content": "\nI'd like to submit an RCE issue within Git SVN and Mercurial, the CVEs are:\nCVE-2017-9800 (Subversion)\nCVE-2017-1000116 (Mercurial (hg))\nCVE-2017-1000117 (Git)\nFurther Info can be found at:\nhttp://blog.recurity-labs.com/2017-08-10/scm-vulns\nAnd product specific:\nhttps://public-inbox.org/git/xmqqh8xf482j.fsf@gitster.mtv.corp.google.com/T/#u\nhttp://subversion.apache.org/security/CVE-2017-9800-advisory.txt\nhttps://about.gitlab.com/2017/08/10/gitlab-9-dot-4-dot-4-released/\nI think these issues which all are based on the same flaw could be worth\nan IBB Bounty. However I'd like to point out that we at Recurity Labs\nwould like the bounty being donated to a charity. The to be determined\ncharity will be something in the field of brain aneurysm, this is due to\nthe fact that Felix, the founder of Recurity Labs, currently is\nrecovering from a brain aneurysm.\nSo, just let us know what you think about this.\nCheers,\njoern\nP.S. I took the CVSS Score from the Subversion Advisory\nthe Redhat advisory states a score of 6.3 (CVSS:3.0/AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:L) I guess the truth is somewhere in between.\n\n",
  "severity": [
    8.8,
    null
  ],
  "bounty": null,
  "weaknesses": [
    "OS Command Injection"
  ],
  "screenshots": {},
  "disclosed_date": 1506025260,
  "report_url": "https://hackerone.com/reports/260005",
  "is_multi_component": true,
  "complexity": "MEDIUM",
  "novelty": "MEDIUM",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Identify the vulnerability in Git, SVN, and Mercurial related to ssh:// URIs."
    ],
    [
      2,
      "Exploit the vulnerability by crafting a malicious ssh:// URI that triggers remote code execution when processed by the VCS."
    ]
  ],
  "vuln_description": "The vulnerability involves multiple version control systems (Git, SVN, Mercurial) where a crafted ssh:// URI can lead to remote code execution (RCE). The flaw lies in how these systems handle ssh:// URIs, allowing an attacker to execute arbitrary commands on the victim's system.",
  "reason": "The vulnerability requires understanding the handling of ssh:// URIs across different VCS systems and crafting a malicious URI that exploits this common flaw. The interaction between the URI parsing and command execution is non-obvious and involves multiple components.",
  "new_complexity": "HIGH",
  "requires_code": true,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null,
  "injection_metadata": {
    "is_simple_payload": true
  },
  "authnz_metadata": {
    "reason": "The RCE via ssh:// URIs in multiple VCS involves a flaw in how these version control systems handle ssh:// URIs, which is a protocol-level issue rather than an authentication or authorization boundary within a single application. The proposed methodologies focus on testing AuthN/AuthZ boundaries within a single application by swapping user sessions and resource IDs, which does not apply to this protocol-level vulnerability.",
    "is_detectable": false
  }
}