{
    "reported_to": "Legal Robot",
    "reported_by": "husnainiqbal01 ",
    "title": "Email Length Verification ",
    "content": "\nHi Team,\nHope you are good. I found your website app.legalrobot.com vulnerable to this vulnerability.\nBug: Improper authentication - generic\nDescription:\nDont know much about the websites that how they stored email address.Email addresses are stored as VARCHAR(128) But here your website legalrobot dont verify the length of an email address upon registration which allowed the attackers to bypass the allowed email-domains defined in auth.email-domains.\nHow to Exploit:\nExploiting this is much Easy\nGet an email address of 128 characters long. StackOverflow answer indicates that the maximum length of an email address is 254 characters.Then register with your 128 character email address with @allowed-domain.com appended to it. The @allowed-domain.com part will be truncated because MySQL can’t store it, and you will receive a verification email on your 128 character email address.\nIt will be much easy if you are using gmail if we keep\nihusnain49@gmail.com, you will receive all mails sent to\nihusnain49+aaaaaaaaaaa…aaa@gmail.com.\nReferences:\nFor reference watch this video : https://www.youtube.com/watch?v=o8-0hwaUB4I&feature=youtu.be and you will came to know about the vulnerability of your website. you can also see this report as a reference because this is the same vulnerability as this report is : https://hackerone.com/reports/2224\nI reccomended you two open both of the links.\nReference 1: https://www.youtube.com/watch?v=o8-0hwaUB4I&feature=youtu.be\nReference 2 : https://hackerone.com/reports/2224\nProof of concept:\nI register an account on legalrobot with this email ihusnain49+aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa..aaa@gmail.com\nand I received the mail on ihusnain49@gmail.com because the other part gets truncated.\nScreenshots for Proof of concept:\nAttaching some screen shots for proof of concept in which you can clearly see.\nThanks\nRegards:\nHusnain Iqbal\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "None"
    ],
    "screenshots": {},
    "disclosed_date": 1503793020,
    "report_url": "https://hackerone.com/reports/263589",
    "is_multi_component": false,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Create an email address that is exactly 128 characters long, including an '@allowed-domain.com' suffix."
        ],
        [
            2,
            "Register an account on the target website using this email address. The '@allowed-domain.com' part will be truncated due to the VARCHAR(128) limit, allowing registration with an unauthorized domain."
        ]
    ],
    "vuln_description": "The vulnerability involves improper email length verification during registration, allowing attackers to bypass domain restrictions by exploiting the database's VARCHAR(128) limit to truncate the domain part of the email address.",
    "reason": "The attack is straightforward, involving only the creation of a long email address and registration. It does not require complex interactions or understanding of multiple components.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": "2224"
}