{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "ruffdraft ",
  "title": "2 vulnerabilities of arbitrary code in ████████  - CVE-2017-5929",
  "content": "\nSummary:\nGitHub repo: https://github.com/████████\nQOS.ch Logback before 1.2.0 has a serialization vulnerability affecting the SocketServer and ServerSocketReceiver components.\nHigh Severity\nArbitrary Code Execution\nVulnerable module: ch.qos.logback:logback-core\nIntroduced through: com.github.dblock.waffle:waffle-distro@1.8.1\nDetailed paths\nIntroduced through: ███@█████████#a746bb4ecce1cb252a301c08be0daffa480c9747 › com.github.dblock.waffle:waffle-distro@1.8.1 › ch.qos.logback:logback-core@1.1.3\nIntroduced through: ██████@███#a746bb4ecce1cb252a301c08be0daffa480c9747 › com.github.dblock.waffle:waffle-distro@1.8.1 › ch.qos.logback:logback-classic@1.1.3 › ch.qos.logback:logback-core@1.1.3\nand\nHigh Severity\nArbitrary Code Execution\nVulnerable module: ch.qos.logback:logback-classic\nIntroduced through: com.github.dblock.waffle:waffle-distro@1.8.1\nDetailed paths\nIntroduced through: ████@█████#a746bb4ecce1cb252a301c08be0daffa480c9747 › com.github.dblock.waffle:waffle-distro@1.8.1 › ch.qos.logback:logback-classic@1.1.3\nDescription:\nch.qos.logback:logback-core and ch.qos.logback:logback-classic Affected versions of this package are vulnerable Arbitrary Code Execution. A configuration can be turned on to allow remote logging through interfaces that accept untrusted serialized data. Authenticated attackers on the adjacent network can exploit this vulnerability to run arbitrary code through the deserialization of custom gadget chains.\nImpact\nSerialization is a process of converting an object into a sequence of bytes which can be persisted to a disk or database or can be sent through streams. The reverse process of creating object from sequence of bytes is called deserialization. Serialization is commonly used for communication (sharing objects between multiple hosts) and persistence (store the object state in a file or a database). It is an integral part of popular protocols like Remote Method Invocation (RMI), Java Management Extension (JMX), Java Messaging System (JMS), Action Message Format (AMF), Java Server Faces (JSF) ViewState, etc.\nDeserialization of untrusted data (CWE-502), is when the application deserializes untrusted data without sufficiently verifying that the resulting data will be valid, letting the attacker to control the state or the flow of the execution.\nJava deserialization issues have been known for years. However, interest in the issue intensified greatly in 2015, when classes that could be abused to achieve remote code execution were found in a popular library (Apache Commons Collection). These classes were used in zero-days affecting IBM WebSphere, Oracle WebLogic and many other products.\nAn attacker just needs to identify a piece of software that has both a vulnerable class on its path, and performs deserialization on untrusted data. Then all they need to do is send the payload into the deserializer, getting the command executed.\nStep-by-step Reproduction Instructions\nRun known POC CVE online\nProduct, Version, and Configuration (If applicable)\nch.qos.logback:logback-core@1.1.3\nch.qos.logback:logback-classic@1.1.3\nSuggested Mitigation/Remediation Actions\nupdate to latest version\n\n",
  "severity": [
    9.0,
    10.0
  ],
  "bounty": null,
  "weaknesses": [
    "Deserialization of Untrusted Data"
  ],
  "screenshots": {},
  "disclosed_date": 1570574400,
  "report_url": "https://hackerone.com/reports/272979",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Identify a system using Logback versions before 1.2.0, specifically ch.qos.logback:logback-core@1.1.3 or ch.qos.logback:logback-classic@1.1.3."
    ],
    [
      2,
      "Exploit the deserialization vulnerability by sending a malicious payload to the SocketServer or ServerSocketReceiver components to achieve arbitrary code execution."
    ]
  ],
  "vuln_description": "The vulnerability involves a deserialization issue in Logback versions before 1.2.0, where the SocketServer and ServerSocketReceiver components accept untrusted serialized data. This allows authenticated attackers on the adjacent network to execute arbitrary code through crafted gadget chains during deserialization.",
  "reason": "The attack requires understanding of Java deserialization vulnerabilities and the specific components in Logback that are vulnerable. However, the steps to exploit are straightforward once the vulnerable components are identified, and the use of known gadget chains reduces the complexity.",
  "new_complexity": "MEDIUM",
  "requires_code": false,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}