{
    "reported_to": "AWS VDP",
    "reported_by": "hesham_elsheme ",
    "title": "External service interaction (HTTP)",
    "content": "\nThere is External service interaction ( DNS and HTTP ) vulnerability in\nurl : ████ in this video\nscreen-recorder-fri-sep-20-2024-10-31-39.webm (F3616801)\nImpact\nThe External Service Interaction arise when it is possible for a attacker to induce application to interact with the arbitrary external service such as DNS HTTP etc.\nThe External Service Interaction can is not limited to HTTP,HTTPS or DNS, you can lead to FTP, SMTP etc. Such weakness can lead to DDoS attack.\nThe External Service Interaction can lead to OS Command Injection, DOS Attack, DDOS Attack or Code Manipulation\n\n",
    "severity": [
        8.2,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "Server-Side Request Forgery (SSRF)"
    ],
    "screenshots": {},
    "disclosed_date": 1728071580,
    "report_url": "https://hackerone.com/reports/2731133",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Identify the target URL (████) that exhibits external service interaction vulnerability."
        ],
        [
            2,
            "Craft and send a malicious payload designed to trigger interactions with arbitrary external services (e.g., HTTP, DNS, FTP, SMTP)."
        ],
        [
            3,
            "Observe the application's response or behavior to confirm unintended external service interactions (e.g., outbound requests to attacker-controlled servers)."
        ]
    ],
    "vuln_description": "The vulnerability allows an attacker to induce the application to interact with arbitrary external services (HTTP, DNS, FTP, SMTP, etc.), potentially leading to DDoS attacks, OS command injection, or code manipulation.",
    "reason": "The attack primarily involves sending crafted payloads to trigger external interactions, which is a straightforward process without complex application state manipulation or novel logic. The difficulty lies in identifying the vulnerable endpoint but not in the exploitation mechanics.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}