{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "jalio ",
  "title": "CVE-2017-13090 wget heap smash",
  "content": "\nThe retr.c:fd_read_body() function is called when processing OK responses. When the response is sent chunked in wget before 1.19.2, the chunk parser uses strtol() to read each chunk's length, but doesn't check that the chunk length is a non-negative number. The code then tries to read the chunk in pieces of 8192 bytes by using the MIN() macro, but ends up passing the negative chunk length to retr.c:fd_read(). As fd_read() takes an int argument, the high 32 bits of the chunk length are discarded, leaving fd_read() with a completely attacker controlled length argument. The attacker can corrupt malloc metadata after the allocated buffer.\nReproduction\nTo reproduce, use two terminals. In the first terminal:\n$ nc -l -p 8080 <wget-heap-smash.reply\nIn the second terminal:\n$ wget http://127.0.0.1:8080/foo\nDepending on how wget is compiled, this will either simply segfault or\ncomplain about the heap being corrupted.\nExternal Links\nhttps://nvd.nist.gov/vuln/detail/CVE-2017-13090\nhttp://git.savannah.gnu.org/cgit/wget.git/commit?id=ba6b44f6745b14dce414761a8e4b35d31b176bba\nhttp://www.debian.org/security/2017/dsa-4008\nhttp://www.securityfocus.com/bid/101590\nhttp://www.securitytracker.com/id/1039661\nhttps://www.viestintavirasto.fi/en/cybersecurity/vulnerabilities/2017/haavoittuvuus-2017-037.html\n\n",
  "severity": [
    8.8,
    null
  ],
  "bounty": null,
  "weaknesses": [
    "Classic Buffer Overflow"
  ],
  "screenshots": {},
  "disclosed_date": 1573620300,
  "report_url": "https://hackerone.com/reports/287667",
  "is_multi_component": true,
  "complexity": "MEDIUM",
  "novelty": "MEDIUM",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Run a netcat listener on port 8080 with a malicious chunked response file: nc -l -p 8080 <wget-heap-smash.reply"
    ],
    [
      2,
      "In another terminal, execute wget to fetch the malicious response: wget http://127.0.0.1:8080/foo"
    ]
  ],
  "vuln_description": "The vulnerability is in wget's handling of chunked HTTP responses. When processing a chunked response, wget uses strtol() to read the chunk length but fails to validate that the length is non-negative. This allows an attacker to specify a negative chunk length, which is then passed to fd_read() after truncation, leading to heap corruption.",
  "reason": "The vulnerability involves a straightforward misuse of strtol() without proper validation, leading to a heap corruption. The attack does not require multiple components, complex state manipulation, or novel logic. The issue is relatively simple to identify once the chunk handling code is examined.",
  "new_complexity": "LOW",
  "requires_code": true,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}