{
  "reported_to": "Node.js third-party modules",
  "reported_by": "nwoltman ",
  "title": "Fastify denial-of-service vulnerability with large JSON payloads",
  "content": "\nModule:\nFastify - https://www.npmjs.com/package/fastify\nAffected versions: <=0.37.0 (all version before 0.38.0)\nSummary:\nA denial-of-service attack can be performed against servers running Fastify by sending a request with \"Content-Type: application/json\" and a very large payload.\nDescription:\nFastify internally builds up the request payload as a string and then JSON parses the string once the full payload is received. It does not (before v0.38.0) limit the size of the payload before JSON parsing it, meaning that the string can grow large enough to surpass either V8's string length limits and throw an uncaughtException, or it can surpass the process's memory limits and crash the process.\nTo perform this attack, one must send a request with Content-Type: application/json containing a very large payload. The request may be streamed. The payload only needs to be large enough to surpass V8's string length limit (2^30 - 25 bytes with V8 62 / Node 9, or 2^28 - 16 bytes for earlier versions), at which point the Node.js process will crash with an uncaughtException. If the process running Node has less memory than V8's maximum string size, the process will run out of memory and crash earlier. If multiple requests with a large payload are made in parallel, the process will run out of memory very quickly (this can be done with only a few parallel requests).\nThis attack can be performed repeatedly and indefinitely.\nSteps To Reproduce:\nCreate a Fastify server using the default example.\nAdd a POST route. Example: fastify.post('/*', async () => 'response text').\nStart the server (e.g. node app.js).\nUse a tool such as curl or Node to send a POST request with Content-Type: application/json to the sever (i.e. running on localhost:3000) with a payload of size 1 GB or larger.\nThe server will crash before the request completes.\nPiece of code responsible for this issue (from the last commit before the vulnerability was fixed): https://github.com/fastify/fastify/blob/8bc80ab61ad8de3fd498bf885ac645a0a634874c/lib/handleRequest.js#L60-L81\nImpact:\nAll servers running Fastify <= 0.37.0 without a reverse proxy in front that limits the size of request payloads are vulnerable to this denial-of-service attack.\nSupporting Material/References:\nExample attack using Node:\nCode 408 Bytes\n1const http = require('http');\n2\n3const req = http.request({\n4  host: 'localhost',\n5  port: 3000,\n6  path: '/',\n7  method: 'POST',\n8  headers: {\n9    'Content-Type': 'application/json',\n10  },\n11}, (res) => {\n12  console.log(res.statusCode);\n13  console.log(res.headers);\n14}).on('error', (err) => {\n15  console.log(err);\n16});\n17\n18const buff = Buffer.alloc(100000);\n19\n20for (var i = 0; i < 20000; i++) {\n21  req.write(buff);\n22}\n23\n24req.end();\nImpact\nAn attacker can consistently crash a Node process running Fastify, thus creating a denial-of-service scenario.\n\n",
  "severity": [
    9.3,
    null
  ],
  "bounty": 500,
  "weaknesses": [
    "Uncontrolled Resource Consumption"
  ],
  "screenshots": {},
  "disclosed_date": 1516918860,
  "report_url": "https://hackerone.com/reports/303632",
  "is_multi_component": false,
  "complexity": "LOW",
  "novelty": "LOW",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Create a Fastify server using the default example and add a POST route (e.g., fastify.post('/*', async () => 'response text'))"
    ],
    [
      2,
      "Send a POST request with Content-Type: application/json and a payload of size 1 GB or larger to the server"
    ]
  ],
  "vuln_description": "A denial-of-service attack can be performed against Fastify servers (<=0.37.0) by sending a very large JSON payload, causing the Node.js process to crash due to memory limits or V8 string length constraints.",
  "reason": "The vulnerability is straightforward to discover as it involves a single, well-documented behavior (large JSON payload handling) without requiring complex interactions or state manipulation. The attack vector is simple and does not involve novel logic.",
  "new_complexity": "LOW",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null
}