{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "mehqq ",
  "title": "Exim off-by-one RCE vulnerability",
  "content": "\nHi,\nI found an off-by-one in Exim MTA utility function. It was reported to exim and official patch has been released, assigned CVE-2018-6789. This bug affects all versions of exim.\nThis bug is simple, but can be leverage to gain remote code execution, using skillful heap exploitation. Details are here: https://devco.re/blog/2018/03/06/exim-off-by-one-RCE-exploiting-CVE-2018-6789-en/\nI believe exim is widespread enough and it seems to fit all criteria. I wonder if this finding worths a bounty, or the reason why it is not included. Thanks!\nImpact\nPre-auth remote code execution on all versions of exim mail server\n\n",
  "severity": [
    9.0,
    10.0
  ],
  "bounty": null,
  "weaknesses": [
    "Off-by-one Error"
  ],
  "screenshots": {},
  "disclosed_date": 1569543780,
  "report_url": "https://hackerone.com/reports/322935",
  "is_multi_component": false,
  "complexity": "MEDIUM",
  "novelty": "MEDIUM",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Identify the off-by-one vulnerability in Exim's MTA utility function, specifically in the base64 decoding routine."
    ],
    [
      2,
      "Craft a malicious email or payload that triggers the off-by-one error, leading to heap corruption."
    ],
    [
      3,
      "Exploit the heap corruption to achieve remote code execution, leveraging heap manipulation techniques."
    ]
  ],
  "vuln_description": "The vulnerability is an off-by-one error in Exim's base64 decoding function, which can be exploited to cause heap corruption. This corruption can then be leveraged to achieve remote code execution. The bug affects all versions of Exim and was assigned CVE-2018-6789.",
  "reason": "The vulnerability involves a subtle off-by-one error in a utility function, which is not immediately obvious. Exploiting it requires deep understanding of heap manipulation techniques and the Exim codebase. However, the core issue (off-by-one) is a well-known class of vulnerability, and the exploitation steps, while complex, follow a somewhat predictable pattern for heap-based RCE.",
  "new_complexity": "HIGH",
  "requires_code": true,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}