{
  "reported_to": "Node.js",
  "reported_by": "jzebor ",
  "title": "Out of order TLS handshake / application data messages lead to segmentation fault",
  "content": "\nSummary:\nIMPORTANT NOTE: I have already been working with the NodeJS core security team on this issue and have provided core files, POC and many other pieces of information. I was told by James Snell to report via Hackerone to make it official however all the relevant details on this issue have already been provided to NodeJS team. This report will be minimal since all details are already with the team which needs them.\nDescription: Sending interleaved handshake messages in the TLS handshake OR sending TLS handshake messages AFTER the handshake has completed (after finished msg) causes a segmentation fault of the NodeJS process. This is present in v9 and v10, using TLS module. The issue can be exposed with servers which use TLS in normal \"server authentication\" mode AND servers which require mutual authentication (client certificates).\nSteps To Reproduce:\nSetup TLS server with node.\nPerform a normal handshake but insert a Client Key Exchange message AFTER the TLS handshake finished message.\nObserve segmentation fault of node process.\nStacktrace, core file and reproduction script(s) have all been provided to Anna Henningsen on the NodeJS core team.\nImpact: Denial of service, seg fault leads to the node instance inability to service additional clients.\nSupporting Material/References: All of this has already been provided to Core NodeJS security team.\nList any additional material (e.g. screenshots, logs, references, commits, code examples, etc.).\nImpact\nSegmentation fault of the process leads to denial of service.\n\n",
  "severity": [
    7.5,
    null
  ],
  "bounty": null,
  "weaknesses": [
    "Heap Overflow"
  ],
  "screenshots": {},
  "disclosed_date": 1581655620,
  "report_url": "https://hackerone.com/reports/335495",
  "is_multi_component": true,
  "complexity": "MEDIUM",
  "novelty": "MEDIUM",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Setup TLS server with Node.js."
    ],
    [
      2,
      "Perform a normal handshake but insert a Client Key Exchange message AFTER the TLS handshake finished message."
    ],
    [
      3,
      "Observe segmentation fault of node process."
    ]
  ],
  "vuln_description": "Sending interleaved handshake messages in the TLS handshake OR sending TLS handshake messages AFTER the handshake has completed (after finished msg) causes a segmentation fault of the NodeJS process.",
  "reason": "The vulnerability involves understanding the TLS handshake protocol deeply and manipulating the sequence of handshake messages in a non-standard way. The attacker needs to know the exact timing and sequence to inject the Client Key Exchange message after the handshake is supposed to be completed.",
  "new_complexity": "HIGH",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null
}