{
  "reported_to": "Node.js third-party modules",
  "reported_by": "lirantal ",
  "title": "http-live-simulator npm module is prone to path traversal attacks",
  "content": "\nNOTE! Thanks for submitting a report! Please replace all the [square] sections below with the pertinent details. Remember, the more detail you provide, the easier it is for us to triage and respond quickly, so be sure to take your time filling out the report!\nI would like to report Path Traversal vulnerability in http-live-simulator\nIt allows to read arbitrary files from any location on disk\nModule\nmodule name: http-live-simulator\nversion: 1.0.5\nnpm page: https://www.npmjs.com/package/http-live-simulator\nModule Description\nCopy description from npm page\nModule Stats\nReplace stats below with numbers from npm’s module page:\n[9] weekly downloads\nVulnerability\nVulnerability Description\nDescription about how the vulnerability was found and how it can be exploited, how it harms package users (data modification/lost, system access, other.\nThe http-live-simulator module doesn't set a root directory and allows any arbitrary paths to be accessed on the file system and returned to requesting clients\nSteps To Reproduce:\nDetailed steps to reproduce with all required references/steps/commands. If there is any exploit code or reference to the package source code this is the place where it should be put.\nInstall the module locally in an npm project: npm install http-live-simulator\nRun the live server on a specified port: node_modules/.bin/http-live --port 8181\nAttempt to access a file from outside that project's directory, such as curl --path-as-is http://localhost:8181/../../file.txt\nFiles output should be returned\nSupporting Material/References:\nState all technical information about the stack where the vulnerability was found\nMacOS\nNode.js 8.11.3\nnpm 5.6.0\nWrap up\nSelect Y or N for the following statements:\nI contacted the maintainer to let them know: [N]\nI opened an issue in the related repository: [N]\nImpact\npath traversal vulnerability leading to read access in arbitrary files on disk\n\n",
  "severity": [
    8.6,
    null
  ],
  "bounty": null,
  "weaknesses": [
    "Path Traversal"
  ],
  "screenshots": {},
  "disclosed_date": 1537290420,
  "report_url": "https://hackerone.com/reports/384939",
  "is_multi_component": false,
  "complexity": "MEDIUM",
  "novelty": "LOW",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Install the module locally in an npm project: npm install http-live-simulator"
    ],
    [
      2,
      "Run the live server on a specified port: node_modules/.bin/http-live --port 8181"
    ],
    [
      3,
      "Attempt to access a file from outside that project's directory, such as curl --path-as-is http://localhost:8181/../../file.txt"
    ]
  ],
  "vuln_description": "The http-live-simulator module doesn't set a root directory and allows any arbitrary paths to be accessed on the file system and returned to requesting clients, leading to a path traversal vulnerability that provides read access to arbitrary files on disk.",
  "reason": "The vulnerability is straightforward to exploit with basic knowledge of path traversal attacks and requires no complex interactions or state manipulations. The attack involves a single, well-known technique without any novel or subtle components.",
  "new_complexity": "LOW",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null
}