{
    "reported_to": "U.S. Dept Of Defense",
    "reported_by": "cablej_dds ",
    "title": "████ █████ exposes highly sensitive information to public",
    "content": "\nSummary:\nwww.██████ is a system used by ██████ for vendors to upload details of their technology for review by ███. Due to an insecure direct object reference vulnerability, all vendor uploads are accessible to the public, without authentication. This includes Unclass//FOUO documents, documents labeled ITAR RESTRICTED / EXPORT CONTROLLED DATA, and confidential / proprietary data of the respective vendors. These documents include detailed specifications on military technology, including weapons systems, surveillance systems, missiles and ballistics, and other confidential technology.\nFor instance, several documents contained had labeled criminal penalties for foreign export:\nCode 377 Bytes\n1WARNING – This document contains technical data whose export is restricted by the Arms Export Control Act (Title 22, U.S.C., Sec 2751 et seq.) or the Export Administration Act of 1979, (Title 50, U.S.C., App. 2401 et seq.), as amended. Violations of these export laws are subject to severe criminal penalties. Disseminate in accordance with provisions of DoD Directive 5230.25.\nAlthough I did not identify any classified documents, there is a possibility that classified information is also uploaded here.\nStep-by-step Reproduction Instructions\nVisit https://www.███/api/document/x, replacing x with any numerical ID. These go into the low tens of thousands.\nObserve that the document will be downloaded, provided it exists.\nObserve that this can be repeated for tens of thousands of documents.\nSome screenshots of evidence of sensitive information attached.\nImpact\nThis exposes highly sensitive information of both the DoD (ITAR restricted) and proprietary/confidential company information.\n\n",
    "severity": [
        9.0,
        10.0
    ],
    "bounty": null,
    "weaknesses": [
        "Insecure Direct Object Reference (IDOR)"
    ],
    "screenshots": {},
    "disclosed_date": 1589229780,
    "report_url": "https://hackerone.com/reports/388554",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "API",
    "steps": [
        [
            1,
            "Visit https://www.███/api/document/x, replacing x with any numerical ID (e.g., 1, 2, 3, etc.)."
        ],
        [
            2,
            "Download and inspect the document, which will be accessible without authentication."
        ]
    ],
    "vuln_description": "The vulnerability involves an insecure direct object reference (IDOR) in a system used by ██████, allowing public access to sensitive vendor-uploaded documents without authentication. These documents include Unclass//FOUO, ITAR RESTRICTED, and proprietary data, exposing detailed military technology specifications and other confidential information.",
    "reason": "The attack is straightforward, involving only a simple IDOR vulnerability with no complex interactions, state manipulations, or novel logic. The tester merely needed to increment numerical IDs in the URL to access documents.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null,
    "idor_detectable": true,
    "authnz_byppass_detectable": false,
    "is_simple_payload": false,
    "injection_metadata": {
        "is_simple_payload": false
    },
    "authnz_metadata": {
        "idor_detectable": true,
        "authnz_byppass_detectable": true
    }
}