{
    "reported_to": "X (Formerly Twitter)",
    "reported_by": "csanuragjain ",
    "title": "Opportunity to post hidden comments",
    "content": "\nTwitter allows to comment on anyone's tweet. While testing this feature, observed that one can post comment on tweet which will be invisible to the victim whom the reply was posted and would be visible to any other twitter user.\nThis can allow an Attacker to abuse victim on a tweet. The catch here is victim cannot even know that attacker posted on his tweet but any other twitter user can see that tweet.\nSteps to reproduce\nAttacker login to Twitter\nAttacker blocks victim using Block@victim button at https://twitter.com/<victim>\nAttacker opens any popular tweet of victim\nAttacker abuses victim in the tweet reply\nVictim cannot see the tweet reply posted by Attacker but any other user can see that reply.\nRecommendation\nIf a person blocks a twitter user then he/she should not be allowed to post on any of the blocked user tweets.\nImpact\nThis can allow an Attacker to abuse victim on a tweet. The catch here is victim cannot even know that attacker posted on his tweet but any other twitter user can see that tweet.\n\n",
    "severity": [
        9.0,
        10.0
    ],
    "bounty": null,
    "weaknesses": [
        "Business Logic Errors"
    ],
    "screenshots": {},
    "disclosed_date": 1544589180,
    "report_url": "https://hackerone.com/reports/434202",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Attacker logs in to Twitter"
        ],
        [
            2,
            "Attacker blocks the victim using the Block button at https://twitter.com/<victim>"
        ],
        [
            3,
            "Attacker opens any popular tweet of the victim"
        ],
        [
            4,
            "Attacker posts an abusive reply to the victim's tweet"
        ],
        [
            5,
            "Victim cannot see the reply, but other users can"
        ]
    ],
    "vuln_description": "Twitter allows an attacker to post hidden comments on a victim's tweet by first blocking the victim. The comment is visible to other users but invisible to the victim, enabling abuse without the victim's knowledge.",
    "reason": "The vulnerability involves a straightforward sequence of actions (blocking a user and then replying to their tweet) without any complex interactions or novel logic. The behavior is somewhat non-obvious but does not require deep understanding of Twitter's internal mechanisms.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}