{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "hanno ",
  "title": "Use after free and out of bounds read in xmlrpc_decode()",
  "content": "\nMalformed input can lead to use after free and out of bounds memory errors.\nThis has been fixed with the latest updates of PHP (7.1.26/7.2.14/7.3.1).\n(Note: I reported those as separate bugs to PHP, but they had the same underlying bug and were fixed by the same commit. The release notes only mention \"out of bounds read\", but this is misleading, as a use after free error is potentially more severe.)\nBugs reported to PHP:\nhttps://bugs.php.net/bug.php?id=77242\nhttps://bugs.php.net/bug.php?id=77249\nImpact\nIf the xmlrpc functionality of PHP is used to parse untrusted input from a public API point it can potentially be used to gain code execution.\n\n",
  "severity": [
    9.8,
    null
  ],
  "bounty": 1500,
  "weaknesses": [
    "Use After Free"
  ],
  "screenshots": {},
  "disclosed_date": 1604904480,
  "report_url": "https://hackerone.com/reports/477896",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Identify a PHP application that uses the xmlrpc_decode() function to parse untrusted input."
    ],
    [
      2,
      "Craft a malformed XML-RPC input that triggers the use-after-free or out-of-bounds read vulnerability."
    ]
  ],
  "vuln_description": "The vulnerability involves malformed input causing use-after-free and out-of-bounds memory errors in the xmlrpc_decode() function in PHP. This can potentially lead to code execution if the function is used to parse untrusted input from a public API.",
  "reason": "The vulnerability requires understanding of the xmlrpc_decode() function's internal handling of memory and crafting specific malformed input to trigger the flaws. However, the steps to exploit are relatively straightforward once the underlying issue is known.",
  "new_complexity": "MEDIUM",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null
}