{
  "reported_to": "Valve",
  "reported_by": "nyancat0131 ",
  "title": "Malformed playlist.txt in GoldSrc games leads to Access Violation & arbitrary code execution",
  "content": "\nA crafted playlist.txt can be used to exploit a stack overflow vulnerability in GameUI.dll that can lead to arbitrary code execution.\nReproduction\nPlace attached playlist.txt in game directory (valve, cstrike, etc.). The game will crash when it tries to play Splash track.\nExploitability\nThe file can be sent from server with precache_generic function (custom mp.dll, amxx plugins, etc.). I don't know ant way to force reload the playlist, so for the exploit to trigger, the client must be restarted. In my opinion, it's still dangerous. And this method won't work if the client already had playlist.txt in the game directory.\nImpact\nThe attacker can use this to do many things, from crashing the client to stealing important data.\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": 1000,
  "weaknesses": [
    "Stack Overflow"
  ],
  "screenshots": {},
  "disclosed_date": 1568756040,
  "report_url": "https://hackerone.com/reports/504951",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Place a crafted playlist.txt file in the game directory (e.g., valve, cstrike)."
    ],
    [
      2,
      "Restart the client to trigger the vulnerability when the game attempts to play the Splash track."
    ]
  ],
  "vuln_description": "A crafted playlist.txt file can exploit a stack overflow vulnerability in GameUI.dll, leading to arbitrary code execution. The vulnerability is triggered when the game processes the malformed playlist file, potentially allowing an attacker to crash the client or execute arbitrary code.",
  "reason": "The vulnerability involves a straightforward manipulation of a configuration file (playlist.txt) and relies on a known type of vulnerability (stack overflow). The attack does not require complex interactions or deep understanding of the application's internal state, making it relatively easy to discover.",
  "new_complexity": "LOW",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null
}