{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "jorandirkgreef ",
  "title": "ChaCha20-Poly1305 with long nonces",
  "content": "\nThis report relates to CVE-2019-1543, https://www.openssl.org/news/secadv/20190306.txt, which I reported to the OpenSSL maintainers a few days ago.\nOpenSSL accepts nonces for the AEAD cipher ChaCha20-Poly1305 of up to 16-bytes. This support is advertised in the OpenSSL documentation and via the CHACHA_CTR_SIZE (16) constant.\nHowever, the specification for ChaCha20-Poly1305 supports only up to 12-bytes.\nIf a user passes a 16-byte nonce to OpenSSL, OpenSSL will discard the first 4-bytes of the nonce.\nImpact\nThe maintainers classified the severity of this as LOW since it only affects user applications of OpenSSL, while at the same time recognizing the severity of this for these user applications as MEDIUM (or \"serious\" and \"catastrophic\" in the words of two maintainers).\nThis breaks the guarantees provided by OpenSSL to user applications in two ways:\nThese first 4-bytes are not authenticated, breaking the integrity guarantees of the AEAD cipher, and allowing an attacker to tamper with 4-bytes of the AEAD message. This in itself is serious for applications which rely on AEAD ciphers to detect message tampering and/or message corruption.\nThis introduces the likelihood of nonce-reuse, since the most significant 4-bytes of nonce entropy are discarded by OpenSSL, for example, where a user provides a 32-bit nonce counter in a statically allocated 16-byte buffer to OpenSSL. Nonce-reuse is catastrophic for an AEAD cipher such as ChaCha20-Poly1305, as it would allow an attacker to completely decrypt all sensitive information.\n\n",
  "severity": [
    7.4,
    null
  ],
  "bounty": null,
  "weaknesses": [
    "Missing Encryption of Sensitive Data"
  ],
  "screenshots": {},
  "disclosed_date": 1569861960,
  "report_url": "https://hackerone.com/reports/506040",
  "is_multi_component": false,
  "complexity": "MEDIUM",
  "novelty": "LOW",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Use OpenSSL to encrypt data with ChaCha20-Poly1305, providing a 16-byte nonce."
    ],
    [
      2,
      "Observe that OpenSSL discards the first 4 bytes of the nonce, leading to potential nonce reuse and integrity issues."
    ]
  ],
  "vuln_description": "OpenSSL incorrectly handles 16-byte nonces for ChaCha20-Poly1305 by discarding the first 4 bytes, violating the cipher's specification. This breaks integrity guarantees and increases the risk of nonce reuse, which can lead to catastrophic security failures such as message tampering and full decryption of sensitive data.",
  "reason": "The vulnerability involves understanding the subtle discrepancy between OpenSSL's implementation and the ChaCha20-Poly1305 specification, as well as recognizing the implications of nonce truncation on security guarantees. While the steps to reproduce are straightforward, the impact and the underlying cryptographic principles require deep expertise.",
  "new_complexity": "MEDIUM",
  "requires_code": true,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}