{
  "reported_to": "Node.js",
  "reported_by": "htuch ",
  "title": "Vulnerability in http-parser & embedded NULL header handling",
  "content": "\nDue to a snafu in how security@node.js.org is setup to forward (see https://github.com/envoyproxy/envoy/issues/5155), the following bug report was not made available prior to disclosure. For completeness, I'm providing the original e-mail below.\nPlease note that this has been fixed in http-parser since disclosures. I understand that Node has moved away from http-parser, but this might affect Node.JS LTS for earlier versions. See https://github.com/nodejs/http-parser/issues/468 for the fix.\nRather than file a full report, I would like to share with Node.JS security WG the following resources:\nEnvoy CVE: https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2019-9900\nEnvoy GH issue with CVE details: https://github.com/envoyproxy/envoy/issues/6434\nhttp-parser GH issue: https://github.com/nodejs/http-parser/issues/468\nOther discussion of the handling of this issue: https://github.com/envoyproxy/envoy/issues/5155#issuecomment-481854258\nOriginal e-mail\nMIME-Version: 1.0\nDate: Thu, 14 Mar 2019 16:35:20 -0400\nMessage-ID: CAA4W8ZmaBzTMFU8VdpJzVDM7LXo0o5-WPTdYisGJUF9qsXiPnQ@mail.gmail.com\nSubject: Vulnerability in http-parser & embedded NULL header handling\nFrom: Harvey Tuch htuch@google.com\nTo: security@nodejs.org, ry@tinyclouds.org\nCc: envoy-security@googlegroups.com\nContent-Type: multipart/alternative; boundary=\"0000000000006b3f64058413dc0b\"\n--0000000000006b3f64058413dc0b\nContent-Type: text/plain; charset=\"UTF-8\"\nHi Node.js Security WG, Ryan,\nWe (Envoy security team) have discovered a potential security vulnerability\nrelated to our use of http-parser that we are working to fix, patch and\nissue a security update for Envoy-side following\nhttps://github.com/envoyproxy/envoy/blob/master/SECURITY_RELEASE_PROCESS.md.\nWe would like to give you advanced notice of this under embargo, check in\nwith you to see if this might affect Node.js or other http-parser users,\nand potentially coordinate on an http-parser side fix.\nEnvoy makes use of http-parser as its HTTP/1 codec on its data plane. Envoy\nhas baked into it today the assumption that its HTTP codecs (http-parser,\nnghttp2) enforce RFC constraints on valid header values (\nhttps://tools.ietf.org/html/rfc7230#section-3.2.6). In particular, we\nexpect that there are no embedded NULLs in header values or keys that are\nplaced in Envoy's HeaderStrings and HeaderMapImpls objects. This is\nparticularly important because we allow two views of a HeaderString, via\nc_str()\nhttps://github.com/envoyproxy/envoy/blob/b41ba5925a4e93d22a86c6501d63314ccf0d79f3/include/envoy/http/header_map.h#L115\nand getStringView()\nhttps://github.com/envoyproxy/envoy/blob/b41ba5925a4e93d22a86c6501d63314ccf0d79f3/include/envoy/http/header_map.h#L120;\nembedded NULLS cause inconsistent views and lengths through these\naccessors. We use a mixture of these in header matching and routing.\nOur fuzzers and some recently introduced ASSERTs indicated that embedded\nNULLs were making their way into header values received from http-parser.\nDigging deeper, the errant behavior is due to a bug in how validation of\nheader values is performed by http-parser. You can see this in the\nvalidation logic at\nhttps://github.com/nodejs/http-parser/blob/0d0a24e19eb5ba232d2ea8859aba2a7cc6c42bc4/http_parser.c#L1469\n.\nIn particular, only the first character of the header value is validate at\nline 1490. Then the entire header value is accepted via a memchr scan at\nhttps://github.com/nodejs/http-parser/blob/0d0a24e19eb5ba232d2ea8859aba2a7cc6c42bc4/http_parser.c#L1506\n.\nThis means that we can have arbitrary embedded NULLs in any HTTP/1.1 header\nvalue today. There are places in Envoy where we use one view of these\nstrings for matching (e.g. route table lookup, authorization) and another\nview for routing and sending to our upstreams.\nWe have scored this as 6.5 using CVSS and will work on an Envoy patch to\nreject any header values that contain NULL and issue a point release and\npublic disclosure following\nhttps://github.com/envoyproxy/envoy/blob/master/SECURITY_RELEASE_PROCESS.md\nASAP.\nThis issue can/should also be resolved in http-parser by ensuring the\nentire header value is validated as per RFC. We do not plan on doing the\nfix for this prior to our release, but will coordinate with you folks if\nyou are interested in doing so.\nPlease advise on how you would like to proceed with this. We are planning\nto get our disclosure/release happening either end-of-week or early next\nweek, but we would like to provide you an opportunity to provide some input\nhere, since this has not been publicly disclosed yet we can provide some\nadditional time if needed.\nThanks,\nHarvey (on behalf of Envoy security team)\n--0000000000006b3f64058413dc0b\nContent-Type: text/html; charset=\"UTF-8\"\nContent-Transfer-Encoding: quoted-printable\nCode 4.22 KiB\n1<div dir=3D\"ltr\"><div dir=3D\"ltr\"><div dir=3D\"ltr\">Hi Node.js Security WG, =\n2Ryan,<div><br></div><div>We (Envoy security team) have discovered a potenti=\n3al security vulnerability related to our use of http-parser that we are wor=\n4king to fix, patch and issue a security update for Envoy-side following=C2=\n5=A0<a href=3D\"https://github.com/envoyproxy/envoy/blob/master/SECURITY_RELE=\n6ASE_PROCESS.md\">https://github.com/envoyproxy/envoy/blob/master/SECURITY_RE=\n7LEASE_PROCESS.md</a>.</div><div><br></div><div>We would like to give you ad=\n8vanced notice of this under embargo, check in with you to see if this might=\n9 affect Node.js or other http-parser users, and potentially coordinate on a=\n10n http-parser side fix.</div><div><br></div><div>Envoy makes use of http-pa=\n11rser as its HTTP/1 codec on its data plane. Envoy has baked into it today t=\n12he assumption that its HTTP codecs (http-parser, nghttp2) enforce RFC const=\n13raints on valid header values (<a href=3D\"https://tools.ietf.org/html/rfc72=\n1430#section-3.2.6\" target=3D\"_blank\">https://tools.ietf.org/html/rfc7230#sec=\n15tion-3.2.6</a>). In particular, we expect that there are no embedded NULLs =\n16in header values or keys that are placed in Envoy&#39;s HeaderStrings and H=\n17eaderMapImpls objects. This is particularly important because we allow two =\n18views of a HeaderString, via=C2=A0<a href=3D\"https://github.com/envoyproxy/=\n19envoy/blob/b41ba5925a4e93d22a86c6501d63314ccf0d79f3/include/envoy/http/head=\n20er_map.h#L115\" target=3D\"_blank\">c_str()</a>=C2=A0and=C2=A0<a href=3D\"https=\n21://github.com/envoyproxy/envoy/blob/b41ba5925a4e93d22a86c6501d63314ccf0d79f=\n223/include/envoy/http/header_map.h#L120\" target=3D\"_blank\">getStringView()</=\n23a>; embedded NULLS cause inconsistent views and lengths through these acces=\n24sors. We use a mixture of these in header matching and routing.</div></div>=\n25<div><br></div><div>Our fuzzers and some recently introduced ASSERTs indica=\n26ted that embedded NULLs were making their way into header values received f=\n27rom http-parser. Digging deeper, the errant behavior is due to a bug in how=\n28 validation of header values is performed by http-parser. You can see this =\n29in the validation logic at=C2=A0<a href=3D\"https://github.com/nodejs/http-p=\n30arser/blob/0d0a24e19eb5ba232d2ea8859aba2a7cc6c42bc4/http_parser.c#L1469\" ta=\n31rget=3D\"_blank\">https://github.com/nodejs/http-parser/blob/0d0a24e19eb5ba23=\n322d2ea8859aba2a7cc6c42bc4/http_parser.c#L1469</a>.=C2=A0</div><div><br></div=\n33><div>In particular, only the first character of the header value is valida=\n34te at line 1490. Then the entire header value is accepted via a memchr scan=\n35 at=C2=A0<a href=3D\"https://github.com/nodejs/http-parser/blob/0d0a24e19eb5=\n36ba232d2ea8859aba2a7cc6c42bc4/http_parser.c#L1506\" target=3D\"_blank\">https:/=\n37/github.com/nodejs/http-parser/blob/0d0a24e19eb5ba232d2ea8859aba2a7cc6c42bc=\n384/http_parser.c#L1506</a>.</div><div><br></div><div>This means that we can =\n39have arbitrary embedded NULLs in any HTTP/1.1 header value today. There are=\n40 places in Envoy where we use one view of these strings for matching (e.g. =\n41route table lookup, authorization) and another view for routing and sending=\n42 to our upstreams.<br></div><div><br></div><div>We have scored this as 6.5 =\n43using CVSS and will work on an Envoy patch to reject any header values that=\n44 contain NULL and issue a point release and public disclosure following=C2=\n45=A0<a href=3D\"https://github.com/envoyproxy/envoy/blob/master/SECURITY_RELE=\n46ASE_PROCESS.md\">https://github.com/envoyproxy/envoy/blob/master/SECURITY_RE=\n47LEASE_PROCESS.md</a> ASAP.</div><div><br></div><div>This issue can/should a=\n48lso be resolved in http-parser by ensuring the entire header value is valid=\n49ated as per RFC. We do not plan on doing the fix for this prior to our rele=\n50ase, but will coordinate with you folks if you are interested in doing so.<=\n51/div><div><br></div><div>Please advise on how you would like to proceed wit=\n52h this. We are planning to get our disclosure/release happening either end-=\n53of-week or early next week, but we would like to provide you an opportunity=\n54 to provide some input here, since this has not been publicly disclosed yet=\n55 we can provide some additional time if needed.</div><div><br></div><div>Th=\n56anks,</div><div>Harvey (on behalf of Envoy security team)</div><div><br></d=\n57iv></div></div>\n--0000000000006b3f64058413dc0b--\nImpact\nThis has a CVSS score of 8.3 for Envoy as a project consuming http-parser. The impact on Node.JS is unclear to me.\n\n",
  "severity": [
    8.3,
    null
  ],
  "bounty": null,
  "weaknesses": [
    "Improper Null Termination"
  ],
  "screenshots": {},
  "disclosed_date": 1581655260,
  "report_url": "https://hackerone.com/reports/536954",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "MEDIUM",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Send an HTTP request with a header containing an embedded NULL character in the value."
    ],
    [
      2,
      "Observe that the http-parser accepts the header value with the embedded NULL, despite RFC constraints."
    ]
  ],
  "vuln_description": "The vulnerability involves http-parser incorrectly validating HTTP header values by only checking the first character for NULL and then accepting the entire value via a memchr scan, allowing embedded NULLs in header values. This can lead to inconsistent views of header strings in applications that use different access methods (like c_str() and getStringView()) and potentially cause security issues in routing and authorization logic.",
  "reason": "The vulnerability requires understanding of HTTP header parsing and the specific validation logic in http-parser. While the issue itself is straightforward once identified, discovering it requires knowledge of both the RFC constraints and the internal parsing behavior of http-parser, which is not immediately obvious.",
  "new_complexity": "MEDIUM",
  "requires_code": true,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}