{
    "reported_to": "Khan Academy",
    "reported_by": "tomoh ",
    "title": "Account takeover by changing email",
    "content": "\nThe endpoint /signup/email allows users to change their email before they confirm their account email. This endpoint is not protected from CSRF. Thus, any account that is not yet \"confirmed\" is vulnerable to account takeover using the following steps:\nAttacker obtains new email address not associated with a KA account.\nAttacker then lures a new KA user to visit a URL linking to a page that sends a POST request to /signup/email with the POST body : casing=camel&email=ATTACKER_EMAIL.\nThe email change will go through and the attacker would then be able to take over the unconfirmed account using password reset.\nThe original user would not be able to reclaim account since the original email is now not associated with any KA account.\nImpact\nAttackers would be able to takeover any unconfirmed account on Khan Academy. And since unconfirmed users can participate in most activities on the website, this could lead to leakage of personal info. Since this ATO does not require any knowledge of the user's email address or KAID, it would become possible to launch large scale attacks by posting malicious links on forums or other places on the internet that KA users would visit.\n\n",
    "severity": [
        9.0,
        10.0
    ],
    "bounty": null,
    "weaknesses": [
        "Cross-Site Request Forgery (CSRF)"
    ],
    "screenshots": {},
    "disclosed_date": 1558078500,
    "report_url": "https://hackerone.com/reports/538800",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Attacker obtains a new email address not associated with a Khan Academy (KA) account."
        ],
        [
            2,
            "Attacker lures a new KA user to visit a malicious URL that sends a POST request to /signup/email with the POST body: casing=camel&email=ATTACKER_EMAIL."
        ],
        [
            3,
            "The email change is processed, and the attacker can then take over the unconfirmed account using password reset."
        ],
        [
            4,
            "The original user cannot reclaim the account as the original email is no longer associated with any KA account."
        ]
    ],
    "vuln_description": "The vulnerability allows an attacker to take over any unconfirmed account on Khan Academy by exploiting an unprotected CSRF endpoint (/signup/email) to change the account's email address before confirmation. This leads to account takeover via password reset, with potential leakage of personal information.",
    "reason": "The attack involves understanding the unconfirmed account workflow and exploiting a CSRF vulnerability in the email change endpoint. While the steps are straightforward, the interaction between unconfirmed accounts and CSRF is non-obvious, requiring knowledge of both components.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}