{
    "reported_to": "U.S. Dept Of Defense",
    "reported_by": "deputy ",
    "title": "██████ Authenticated User Data Disclosure",
    "content": "\nBackground##\nThe Air Force’s ███ application is exposing members’ personal information to other users with access to the applocaton. We’ve identified two specific issues, but there may be other similar problems in the same vein as the ones described here. The underlying problem appears to be that users are not prevented from visiting the web addresses (URLs) that return others’ data.\n███████ Home Page: https://███/█████\nVersion Number: 1.85.10\nCaveats###\nUsers must first be able to login to ██████ in order to exercise these issues. Members’ data is not being exposed to just any user on the web, as far as we know\nAll screenshots containing member data were taken with the consent of the member. Personal information has been redacted and replaced with placeholders (Person #1 and Person #2). Person #1 is the logged in user. Person #2 is another user whose data is being accessed by Person #1, with Person #2’s consent.\nIssue #1: Exposure of Members’ Vulnerable Mover List (VML) Status Information##\nBLUF: Talent Marketplace exposes members’ bid/preference information along with the CC’s ranking and comments sent to the Air Force Personnel Center to any logged on user in the VML cycle.\nWhen you visit the “My VML Status” page you are presented by the position preferences you’ve chosen, the bids you’ve received, your Losing Commander’s comments/ranking, and some other information about your VML cycle. See ███████\nIn order to present you with this information, your browser makes a request in the background for the information it uses to populate the webpage. This request is easily viewable using developer tools present in most modern browsers.\n████████ shows the raw data sent to your browser in response to the request it sends. You can see all the preferences you put in, information on the bids you’ve received, and your Losing Commander’s ranking and comments for the member. Notice the redacted “personId” labeled “ID #1” at the very top of the screenshot. This is a unique ID tied to Person #1 (you). If you replace this ID with that of Person #2, and make the request again, the server will send you all the same information for Person #2, even though you (not Person #2) are making the request.\nTaken to the nth degree, any user could iterate through all “personId” values to gather all bid/preference/CC comments for everyone in a VML cycle, but there’s also a way to determine the “personId” of any arbitrary user.\nFinding a Member’s PersonID###\nOn the “My Profile” page, there’s a button you can click to change your military supervisor. When you begin typing someone’s name in the dialog box, your browser makes another background request to search the server’s database for users with that name. Contained in the response is the user’s “personId.” This is not necessarily a problem in and of itself, but it can be used to determine the Person ID of the member whose VML Status you wish to see. See ██████████.\nKey URLs###\nNote: You must first log in to the ████ application before visiting these URLs\nAccess Arbitrary Member’s VML Cycle Info By Person ID (Replace XXXXXX with Person ID)\nhttps://█████/███/IndividualReport/GetVmlEligibleBidInfoData?personId=XXXXXX&vmlCycleId=4\nDetermine Arbitrary Member’s Person ID By Name (Replace XXXXXX with Name)\nhttps://███/██████/SearchPersonUser/FindPerson?SearchTerm=XXXXXX\nIssue #2: Exposure of Other Members’ Career Brief##\nBLUF: ███ exposes other members’ career brief to any logged on user.\nWhen you view the “My Boards” section of ████, there’s a link that you can visit to see a PDF of your career brief as seen by the Board. The URL for this PDF uses another unique ID (not the same as PersonID from Issue #1) to determine whose career brief you see. If you replace your unique ID with someone else’s in the URL, you can see their Career Brief, which contains Privacy Act data. See ███.\nFinding a Member’s “Encrypted ID”###\nThe Career Brief page uses an “Encrypted ID,” to identify a member. It is much longer than a “Person ID,” making it difficult to just iterate over all possible IDs, but there is a way for you to find the Encrypted ID of a particular user if they have a mentor profile. When you view the members’ mentor profile in the “Mentoring Connections” section of ██████████, the URL contains their Encrypted ID. If you copy and paste that ID and replace your ID with theirs in the URL for your career brief, you will see their career brief, which is clearly marked as Privacy Act Data, and should not be visible to any member. See ████\nKey URLs###\nNote: You must first log in to the ████ application before visiting this URL\nAccess Arbitrary Members’ Career Brief By Encrypted ID (Replace XXXXXX with Encrypted ID)\nhttps://███████/███/Dashboard/CareerBrief/PrintOfficerCareerBrief?person=XXXXXX\nSuggested Mitigations##\nWe suggest that █████████ enforce access to user data based on the current logged in user, rather than just the PersonID or Encrypted ID the user presents in the request URL.\nIt’s likely that there are other API endpoints accessible to the user that have similar issues to the two presented above. We also recommend surveying all API endpoints to ensure they are properly validating that the logged in user is only requesting their own information rather than that of any other user.\nImpact\nAny user logged into USAF ███████ can see data, including Privacy Act data, of other users through the application. The issue does not expose user data to the open Internet, but it does expose it to other legitimate users who should not be able to see it.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Information Disclosure"
    ],
    "screenshots": {},
    "disclosed_date": 1570216560,
    "report_url": "https://hackerone.com/reports/587214",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Log in to the ███ application."
        ],
        [
            2,
            "Navigate to the 'My VML Status' page and use browser developer tools to inspect the network request for the 'personId' parameter."
        ],
        [
            3,
            "Replace the 'personId' in the URL with another user's ID obtained from the 'My Profile' page search function."
        ],
        [
            4,
            "Access the modified URL to view another user's VML status information."
        ],
        [
            5,
            "For the career brief issue, navigate to the 'My Boards' section and inspect the URL for the 'Encrypted ID'."
        ],
        [
            6,
            "Replace the 'Encrypted ID' in the career brief URL with another user's ID obtained from their mentor profile URL."
        ],
        [
            7,
            "Access the modified URL to view another user's career brief."
        ]
    ],
    "vuln_description": "The vulnerability involves unauthorized access to sensitive user data (VML status and career briefs) by manipulating URL parameters (personId and Encrypted ID) without proper server-side validation of the authenticated user's permissions.",
    "reason": "The attack involves understanding and manipulating multiple ID parameters (personId and Encrypted ID) across different sections of the application, but the steps are relatively straightforward once the parameter manipulation pattern is identified. The vulnerability does not require complex application state manipulation or novel logic.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}