{
    "reported_to": "Priceline",
    "reported_by": "badca7 ",
    "title": "Account takeover via Google OneTap",
    "content": "\nSummary:\nIt's possible to take over any priceline.com user's account knowing their email. The only requirement is that the victim's email domain is not registered with Google's Gsuite. The root cause of this issue is that the backend does not verify whether the email provided is a confirmed one.\nSteps To Reproduce:\nCreate Account A (in my case badca7@wearehackerone.com) with priceline.com, without any SSO, via the \"Create an account\" link (aka \"register with email\").\nOnce the account has been created, add a dummy phone number to the profile. It will serve as a canary to demonstrate we accessed the same data in the next steps.\nIn another browser/session (eg, incognito/private mode) sign up for a trial GSuite account at https://gsuite.google.com/signup/basic/welcome . This will be Account B.\nUse any email to register as you won't need to confirm that email.\nWhen the wizard comes to the \"Does your business have a domain?\" confirm and enter wearehackerone.com (or any other domain that hosts the victim's email box) as in gsuite.png (F552718). You may not use the same domain name at this stage, as I claimed it for the purposes of this PoC however you can do so when my GSuite trial expires. From this comes the requirement that the victim's email domain name must not be registered with Google prior to this attack.\nOnce you saved the domain record with Google, stop there as there's no need to verify the domain.\nAt this stage the OneTap/GoogleYOLO popup will be showing on priceline.com when visited in the same browser session. It took me some time to get it to show however signing in and out of Google Account several times with the newly created GSuite credentials and then refreshing the priceline.com page helped. On another occasion a Gmail account, which I signed in in the same browser window helped too. You may need to play around with these until you see the newly created account to show in the list. popup_onetap.png (F552723)\nOnce you have that, just sign in (badca7@wearehackerone.com in my case). You can confirm you accessed Account A by seeing the phone number you added in step (2). In the other browser window/session with Account A you can see that now there are two accounts showing in the top right corner and the profile data is blank.\nAccount takeover complete. AccountA_after_takeover.png (F552724)\nNotes\nIP used for this PoC: ███\nImpact\nAttackers can take over any priceline.com account given they were able to register a specific domain with GSuite.\n\n",
    "severity": [
        8.1,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "Improper Authentication - Generic"
    ],
    "screenshots": {},
    "disclosed_date": 1652276220,
    "report_url": "https://hackerone.com/reports/671406",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Create an account on priceline.com with an email from a domain not registered with GSuite."
        ],
        [
            2,
            "Register the victim's email domain with a trial GSuite account without verifying the domain."
        ],
        [
            3,
            "Trigger the Google OneTap popup on priceline.com by signing in and out of the GSuite account."
        ],
        [
            4,
            "Use the OneTap popup to sign in to the victim's account on priceline.com."
        ]
    ],
    "vuln_description": "The vulnerability allows an attacker to take over any priceline.com user's account by exploiting Google OneTap when the victim's email domain is not registered with GSuite. The backend does not verify if the email provided is confirmed, enabling account takeover.",
    "reason": "The attack involves multiple components (priceline.com account creation, GSuite registration, Google OneTap interaction) and requires manipulating complex application states (triggering the OneTap popup). The interaction between these components is subtle and non-obvious, especially the requirement for the victim's domain to be unregistered with GSuite.",
    "new_complexity": "HIGH",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null,
    "idor_detectable": false,
    "authnz_byppass_detectable": true,
    "is_simple_payload": false,
    "injection_metadata": {
        "is_simple_payload": true
    },
    "authnz_metadata": {
        "idor_detectable": false,
        "authnz_byppass_detectable": true
    }
}