{
    "reported_to": "U.S. Dept Of Defense",
    "reported_by": "scraps ",
    "title": "Online training material disclosing username and password",
    "content": "\nSummary:\nA training document is revealing username and password details for what appears to be a DoD training system\nDescription:\nUsing the google dork site:*.mil ext:ppt intext:password, I was able to find a number of powerpoint documents on .mil websites that include username and passwords.\nThis document appears to be some old training materials\nSlide 39 of www.███████/█████████\nSee: █████████\nIn this instance, the document relates to an online training platform at https://████████/, so if the credentials are still valid, anyone who reads that presentation could potentially access that system and any data it holds. Training databases often have elements of sensitive data left over from old production databases, so this may expose sensitive information.\nPlease note that I did not attempt to login using the credentials, as I didn't want to violate any terms of your policy.\nIf you would like me to attempt to login to test this vulnerbility, please let me know.\nStep-by-step Reproduction Instructions\nUsing the google dork site:*.mil ext:ppt intext:password, examine any results which appear to include usernames or passwords\nSee: ███\nImpact\nAttackers may be able to access the contents of either system, which could include sensitive data.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Insecure Storage of Sensitive Information"
    ],
    "screenshots": {},
    "disclosed_date": 1570574460,
    "report_url": "https://hackerone.com/reports/672629",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Use the Google dork: site:*.mil ext:ppt intext:password to search for PowerPoint documents on .mil websites that include usernames and passwords."
        ],
        [
            2,
            "Examine the search results to identify documents containing credentials, such as the one found on slide 39 of the specified .mil website."
        ]
    ],
    "vuln_description": "A training document on a .mil website discloses username and password details for a DoD training system. If the credentials are still valid, unauthorized access to the system and its potentially sensitive data could occur.",
    "reason": "The vulnerability was discovered using a straightforward Google dork search, which is a well-known technique for finding exposed credentials. The attack does not involve multiple components, subtle interactions, complex states, or novel logic.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}