{
  "reported_to": "X (Formerly Twitter)",
  "reported_by": "deeptiman ",
  "title": "Periscope-all Firebase database takeover",
  "content": "\nHello,\nI found one public Firebase database of periscope.tv and I can able to insert data to this database and i only used it once for the testing purposes, so other database queries also possible.\nPlease follow the below link to check the inserted test data.\nPeriscope-all Firebase URL :-\nhttps://█████████/.json\nImpact\nThis is quite serious because by using this database attacker can use this for malicious purposes and also an attacker can track this database if periscope uses it for future perspective and at that time it will be much easier for the attacker to steal the data from this repository and later it will harm the reputation of the Periscope.\nSo please immediately change the rule of the database to private so that nobody can able to access it outside.\nThanks\nDeeptiman Pattnaik\n\n",
  "severity": "[",
  "bounty": 0,
  "weaknesses": "[",
  "screenshots": {},
  "disclosed_date": 1569463260,
  "report_url": "https://hackerone.com/reports/684099",
  "is_multi_component": false,
  "complexity": "LOW",
  "novelty": "LOW",
  "vuln_category": "API",
  "steps": "[",
  "Navigate to the public Firebase database URL": "https://\\u2588\\u2588\\u2588\\u2588\\u2588\\u2588\\u2588\\u2588\\u2588/.json",
  "vuln_description": "The vulnerability involves a publicly accessible Firebase database belonging to Periscope.tv, allowing unauthorized users to insert, modify, or potentially extract data. This misconfiguration could lead to data breaches or misuse if exploited maliciously.",
  "reason": "The discovery of this vulnerability is straightforward as it only requires accessing a publicly exposed database URL and verifying the ability to perform unauthorized operations. There are no complex interactions, multi-step processes, or novel logic involved.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": false,
  "authnz_byppass_detectable": false,
  "injection_classification": "}"
}