{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "xairy ",
  "title": "Linux kernel: CVE-2017-7308: a signedness issue in AF_PACKET sockets",
  "content": "\nHi!\nCVE-2017-7308 is a vulnerability I found in the Linux kernel caused by a signedness issue in AF_PACKET sockets. It can be exploited to gain kernel code execution from an unprivileged process. The kernel has to be built with CONFIG_PACKET for the vulnerability to be present. A lot of modern distributions enable this option by default.\nI initially reported this vulnerability to security@kernel.org following the coordinated disclosure process. As advised by them I've developed a fix for this vulnerability and sent it upstream. The fix was committed on Mar 30, 2017.\nI wrote a proof-of-concept exploit for the 4.8.0-41-generic Ubuntu kernel which gains root from an unprivileged user, which can be found here. More details about the vulnerability and exploitation can be found here.\nThe reason I'm reporting this now is that a similar bug that I've reported a while ago has recently been triaged and addressed, so it seems that LPE Linux kernel bugs are within the scope of this IBB program.\nThanks!\nImpact\nThis vulnerability allows a local attacker to elevate privileges to root on a machine with vulnerable Linux kernel version.\n\n",
  "severity": [
    7.8,
    null
  ],
  "bounty": null,
  "weaknesses": [
    "Memory Corruption - Generic"
  ],
  "screenshots": {},
  "disclosed_date": 1568175540,
  "report_url": "https://hackerone.com/reports/684567",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Identify a Linux kernel with CONFIG_PACKET enabled (common in modern distributions)."
    ],
    [
      2,
      "Exploit the signedness issue in AF_PACKET sockets to execute arbitrary kernel code from an unprivileged process."
    ]
  ],
  "vuln_description": "CVE-2017-7308 is a vulnerability in the Linux kernel caused by a signedness issue in AF_PACKET sockets, allowing local privilege escalation to root. The kernel must be built with CONFIG_PACKET, which is commonly enabled by default.",
  "reason": "The vulnerability involves understanding kernel internals related to AF_PACKET sockets and signedness issues, which requires deep knowledge of kernel memory management and socket handling. The exploit also requires crafting specific payloads to manipulate kernel memory.",
  "new_complexity": "HIGH",
  "requires_code": true,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}