{
  "reported_to": "GitLab",
  "reported_by": "rpadovani ",
  "title": "Group search leaks private MRs, code, commits",
  "content": "\nSummary\nUsing the group search you can access MRs and code set as \"not public\" in a project\nSteps to reproduce\nCreate a public group, create a public project inside the group, but with private code.\nPush some code, search in the group search the code while logged out, you will find it also if it should be private.\nI provide some working links in the example section.\nImpact\nAn attacker can extract all the private code, private MRs, private commits from a project\nExamples\nI am going to use customers.gitlab.com examples because it is how I actually found the problem - the search I have done are about a Hackerone report I first published. I haven't saved any data, nor screenshot of what I have found, apart from the one attached\nGo to https://gitlab.com/gitlab-org in a private window\nIn the top right bar, insert Resolve \"Account takeover due to IDOR on customers.gitlab.com [applicable for gitlab users only]\"\nSelect \"Merge requests\"\nYou see in the search result a MR that should be private, since the customer-gitlab-com project has no public code/MR\nLink: https://gitlab.com/search?group_id=9970&project_id=&repository_ref=&scope=merge_requests&search=Resolve+%22Account+takeover+due+to+IDOR+on+customers.gitlab.com+%5Bapplicable+for+gitlab+users+only%5D%22\nYou can do the same thing for the code:\nGo to https://gitlab.com/gitlab-org in a private window\nIn the top right bar, insert In order to create an account for the [admin panel]\nSelect \"Code\"\nYou see a piece of the README of customers.gitlab.com, which has a private code\nLink: https://gitlab.com/search?group_id=9970&repository_ref=&scope=blobs&search=In+order+to+create+an+account+for+the+%5Badmin+panel%5D&snippets=#\nIn the case of MRs, you can use also the wildcard symbol and filter by project, to extract all the private MRs:\nhttps://gitlab.com/search?utf8=%E2%9C%93&snippets=&scope=merge_requests&repository_ref=&search=*&group_id=9970&project_id=2670515\nWhen you filter by project, the code search stops to work, so if you want to extract all the code you have to apply custom search, but it is still feasible.\nYou got the point, we have also commits:\nhttps://gitlab.com/search?utf8=%E2%9C%93&snippets=&scope=commits&repository_ref=&search=Merge+branch+%27433-idor-fix%27+into+%27staging%27&group_id=9970\nIssues are not affected by this bug\nWhat is the current bug behavior?\nLeak of MRs overview, code, commits, and I suspect also wiki, but for some reason group search of wiki didn't work on my personal group, and I didn't want to look over other gitlab-org data\nWhat is the expected correct behavior?\nNo search result\nRelevant logs and/or screenshots\nA MR of customers.gitlab.com I shouldn't have access to. Notice how I am not logged in in this screenshot\nOutput of checks\nThis bug happens on GitLab.com\nImpact\nAn attacker can extract all the private code, private MRs, private commits from a project\n\n",
  "severity": "[",
  "bounty": null,
  "weaknesses": "[",
  "screenshots": {},
  "disclosed_date": 1576340700,
  "report_url": "https://hackerone.com/reports/692252",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "WEB_APP",
  "steps": "[",
  "vuln_description": "Using the group search feature, an attacker can access private merge requests, code, and commits from projects that are set to 'not public', leading to unauthorized information disclosure.",
  "reason": "The vulnerability involves a straightforward exploitation of the group search feature to access private content. The steps are simple and do not require complex interactions or state manipulations.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": false,
  "authnz_byppass_detectable": true,
  "injection_classification": "}"
}