{
  "reported_to": "GitLab",
  "reported_by": "rpadovani ",
  "title": "Group search with Elastic search enable leaks unrelated data",
  "content": "\nSummary\nPerforming a group search when Elastic Search is enabled provides access to unrelated merge requests, issues activity, leaking the existence of private groups, plus their activity and MRs.\nThis happens both on the GUI and with the APIs\nSteps to reproduce\nLet's take this search on the Gitlab group: https://gitlab.com/search?utf8=%E2%9C%93&snippets=&scope=merge_requests&repository_ref=&search=%21435&group_id=9970\nIf you go at the end of the page, you see 5 MRs from other groups that should be private - I have no idea what are those projects - I have no relation to them, and I have no access to the group they belong to! (See attached screenshot).\nA lot more data can be retrieved through the APIs, now revealing existence of groups/projects I shouldn't know they exist!\nI haven't fully understand the logic of the issue, but basically every combination of ! followed by numbers (I had hits with !709, !999) leaks MRs from other groups.\nWhile on the UI doesn't show much info, the APIs retrieve a lot of data.\nIt also leaks private activity on public issues.\nIf you search for nextbit, link, you see that my main account has linked a private issue to a public issue. The activity should be private, and indeed it is not reported inside the issue itself, but it is reported in the search.\nImpact\nLeaking existence of private groups, private issues activity, private MRs, with lot of metadata\nImpact\nLeak of private MRs with metadata, activity of private issues, leak existence of private groups\n\n",
  "severity": "[",
  "bounty": null,
  "weaknesses": "[",
  "screenshots": {},
  "disclosed_date": 1576340700,
  "report_url": "https://hackerone.com/reports/708820",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "WEB_APP",
  "steps": "[",
  "Navigate to GitLab group search with Elastic Search enabled": "https://gitlab.com/search?utf8=%E2%9C%93&snippets=&scope=merge_requests&repository_ref=&search=%21435&group_id=9970",
  "vuln_description": "When Elastic Search is enabled, performing a group search in GitLab leaks unrelated merge requests and issues from private groups, exposing their existence, activity, and metadata. This occurs both in the GUI and via APIs, particularly when searching with patterns like '!<number>' (e.g., !435, !709, !999). The issue also reveals private activity linked to public issues.",
  "reason": "The vulnerability involves a subtle interaction between Elastic Search and GitLab's group search functionality, where specific search patterns inadvertently bypass access controls. While the attack itself is straightforward once the pattern is identified, discovering the exact search syntax (!<number>) that triggers the leak requires some trial and error or prior knowledge of the flaw.",
  "new_complexity": "MEDIUM",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": true,
  "authnz_byppass_detectable": true,
  "injection_classification": "}"
}