{
    "reported_to": "Khan Academy",
    "reported_by": "jamesconnor ",
    "title": "Information can be changed without a password",
    "content": "\nIf a user has access to a logged in session on Khan Academy, they are able to conduct a full account takeover. This is due to the fact that a new email address can be added to an account without a method of re-authentication. Once this email address has been added, the attacker can simply logout and follow the \"Forgot Password\" dialogue on the login page to send a password reset email to the email address they added. This allows them to change the password and completely take over the account. While this could arguably be the user's fault for not logging out, Khan Academy specifically targets an audience of students and educators, many of whom may use their accounts on shared computers in school. As a result, it's necessary to require re-authentication before allowing modifications to certain user settings, such as the account's email addresses.\nSteps to reproduce\nOpen a browser in which a user has previously logged into an account, but hasn't logged out.\nGo to https://www.khanacademy.com/settings (the user settings)\nScroll down to \"Connect an email\", click the button, and type in any email address that you control. This simulates the attacker's email address. Finally, click \"Send a Confirmation Email\".\nOpen the attacker's inbox and follow the instructions to reset the password. Change the password to whatever you want.\nClick \"Reset and Log In\". The account has now been successfully taken over.\nImpact\nAn attacker can take over an account and lock a user out by resetting the password.\n\n",
    "severity": [
        7.0,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "Unverified Password Change"
    ],
    "screenshots": {},
    "disclosed_date": 1584164460,
    "report_url": "https://hackerone.com/reports/721341",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Open a browser where a user is logged into Khan Academy but hasn't logged out."
        ],
        [
            2,
            "Navigate to https://www.khanacademy.com/settings."
        ],
        [
            3,
            "Scroll to 'Connect an email', enter an attacker-controlled email, and click 'Send a Confirmation Email'."
        ],
        [
            4,
            "Open the attacker's inbox, follow the password reset link, and set a new password."
        ],
        [
            5,
            "Click 'Reset and Log In' to complete the account takeover."
        ]
    ],
    "vuln_description": "An attacker can take over a user's Khan Academy account by adding a new email address without re-authentication, then using the 'Forgot Password' feature to reset the password via the newly added email.",
    "reason": "The attack involves straightforward steps (accessing settings, adding an email, and resetting the password) without complex interactions or novel logic. The vulnerability stems from a common oversight (missing re-authentication for sensitive actions).",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}