{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "al-madjus ",
  "title": "Git repo on https://██████.mil/ discloses API password",
  "content": "\nSummary:\nI found a .git repository on https://███████.mil/.git which discloses an API password for Yubikey on 2 different domains, together with full source code.\nDescription:\nFetching the git repository and decompressing the objects results in the ability to read the source code of the server, which includes an API password for the Yubikey hardware authentication software. The API however does not appear to be functional on the main domain, but since the repository is very recent, I cannot be certain that it'll stay non-functional.\nAdditionally, the server discloses info.php at https://███████.mil/info.php. I'm uncertain if this should be reported separately, any comments on this would be very welcome!\nImpact\nI'm rating the impact of this primarily as an information disclosure. The repository appears to have been active within the past months, so any future additions will be disclosed too.\nI was unable to use the found password as the API appears to be currently non-functional, but since the repo is active I would expect the server to be worked upon, and the API to be functional in the future. For this reason I've decided to make you aware of the issue.\nAlso, even if the password were to be changed, it would of course still be disclosed on the repository.\nFurthermore, the repository discloses the full source code of the served pages.\nStep-by-step Reproduction Instructions\nFetch the repo with wget:\nwget --no-parent -r https://█████.mil/.git/ --no-check-certificate\n2. Write the following python script (remember to update the 'pwd' variable):\nimport zlib import os pwd = INSERT FULL PATH WHERE THE REPO WAS DOWNLOADED + '█████████.mil/.git/objects/' for subdir, dirs, files in os.walk(pwd): for file in files: if not file.startswith(\"index\"): filename = subdir + '/' + file compressed_contents = open(filename, 'rb').read() decompressed_contents = zlib.decompress(compressed_contents) print(str(decompressed_contents) + '\\n')\nThe script is also attached as a file.\n3. Run the script with\npython gitreader.py | grep -i -E -o \".{0,138}restPW.{0,22}\"\nWhich greps the output for the string where the password is, together with the paths/domains.\nOf course, the full contents of the repository are available to look through.\nExample output:\n'https://███\nProduct, Version, and Configuration (If applicable)\nSuggested Mitigation/Remediation Actions\nRemove the .git repository from the server, since it contains sensitive information.\nImpact\nI'm rating the impact of this primarily as an information disclosure. The repository appears to have been active within the past months, so any future additions will be disclosed too.\nI was unable to use the found password as the API appears to be currently non-functional, but since the repo is active I would expect the server to be worked upon, and the API to be functional in the future. For this reason I've decided to make you aware of the issue.\nAlso, even if the password were to be changed, it would of course still be disclosed on the repository.\nFurthermore, the repository discloses the full source code of the served pages.\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": null,
  "weaknesses": [
    "Password in Configuration File"
  ],
  "screenshots": {},
  "disclosed_date": 1616633340,
  "report_url": "https://hackerone.com/reports/765825",
  "is_multi_component": false,
  "complexity": "MEDIUM",
  "novelty": "LOW",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Fetch the .git repository using wget: wget --no-parent -r https://█████.mil/.git/ --no-check-certificate"
    ],
    [
      2,
      "Run a Python script to decompress and analyze the Git objects, searching for sensitive information like API passwords"
    ]
  ],
  "vuln_description": "The vulnerability involves the accidental exposure of a .git repository on a military domain, which discloses sensitive information such as API passwords and full source code. The repository can be fetched and decompressed to reveal these details, posing a significant information disclosure risk.",
  "reason": "The discovery process is straightforward, involving common tools (wget, Python) and techniques (Git object analysis). The vulnerability does not require complex interactions or novel logic, making it relatively easy to discover once the .git repository is exposed.",
  "new_complexity": "LOW",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null
}