{
    "reported_to": "Gener8",
    "reported_by": "paramdham ",
    "title": "Clickjacking to change email address",
    "content": "\nSummary\nClickjacking (User Interface redress attack, UI redress attack, UI redressing) is a malicious technique of tricking a Web user into clicking on something different from what the user perceives they are clicking on, thus potentially revealing confidential information or taking control of their computer while clicking on seemingly innocuous web pages.\nIt allows remote attackers to do some clickjacking which can be used for adding arbitrary tasks . Why? Almost all of your page has missing X-FRAME-OPTIONS header.\nWebsites are at risk of a clickjacking attack when they allow content to be embedded within a frame.\nProof of concept code :-\nCopy the above code and paste it in notepad and save it with .html extention\nand open it in browser\nCode 114 Bytes\n1<html> \n2<head> \n3<title>Clickjack test page</title> \n4</head> \n5<body> \n6<p>Website is vulnerable to clickjacking!</p>\nCode 16 Bytes\n1</body> \n2</html>\nCopy and paste above given code and save it with hack.html and open it in browser\n------------------------------------------------------------------->\nRecommendation :-\nAdd X-FRAME-OPTIONS header to mitigate the issue\nImpact\nAn attacker may use this risk to invisibly load the target website into their own site and trick users into clicking on links which they never intended to. An \"X-Frame-Options\" header should be sent by the server to either deny framing of content, only allow it from the same origin or allow it from a trusted URIs.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "UI Redressing (Clickjacking)"
    ],
    "screenshots": {},
    "disclosed_date": 1641994380,
    "report_url": "https://hackerone.com/reports/783191",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "HIGH",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Create an HTML file with the provided code snippet"
        ],
        [
            2,
            "Open the HTML file in a browser to test if the target website can be framed"
        ]
    ],
    "vuln_description": "The vulnerability is a clickjacking issue where the target website lacks the X-Frame-Options header, allowing it to be embedded in a malicious site. This can trick users into performing unintended actions by clicking on hidden elements.",
    "reason": "The attack is straightforward and involves only a simple HTML file to test for the presence of the X-Frame-Options header. There are no complex interactions or state manipulations required.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}