{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "aaron_costello ",
  "title": "Buffer Overflow in ext_lm_group_acl helper",
  "content": "\nSummary\nDue to incorrect buffer management ext_lm_group_acl is vulnerable to a denial of service attack when processing NTLM Authentication credentials. This problem is limited to installations using the\next_lm_group_acl binary.\nAffected Versions\nSquid 2.x -> 2.7.STABLE9\nSquid 3.x -> 3.5.28\nSquid 4.x -> 4.9\nSeverity\nDue to incorrect input validation the NTLM authentication credentials parser in ext_lm_group_acl may write to memory outside the credentials buffer. On systems with memory access protections this can result in the helper process being terminated unexpectedly. Resulting in the Squid process also terminating and a denial of service for all clients using the proxy.\nSupporting Material/References:\nAdvisory : http://www.squid-cache.org/Advisories/SQUID-2020_3.txt\nRemediation\nAn official patch is available from the Squid archives for both Squid 3.5 and Squid 4.\nTimeline\n2019-11-11 : I reported the issue\n2019-11-18 : I made a PR on GitHub with a fix\n2019-11-22 : Fix was merged\nImpact\nSee 'Severity' section of report.\n\n",
  "severity": [
    7.5,
    null
  ],
  "bounty": null,
  "weaknesses": [
    "Classic Buffer Overflow"
  ],
  "screenshots": {},
  "disclosed_date": 1627512240,
  "report_url": "https://hackerone.com/reports/789034",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "MEDIUM",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Identify a system running Squid proxy with versions 2.x up to 2.7.STABLE9, 3.x up to 3.5.28, or 4.x up to 4.9 that uses the ext_lm_group_acl binary for NTLM authentication."
    ],
    [
      2,
      "Send malformed NTLM authentication credentials to the proxy, triggering incorrect buffer management in ext_lm_group_acl."
    ]
  ],
  "vuln_description": "The ext_lm_group_acl helper in Squid is vulnerable to a buffer overflow when processing NTLM Authentication credentials due to incorrect buffer management. This can lead to a denial of service attack by causing the helper process to terminate unexpectedly, which in turn causes the Squid process to terminate, affecting all clients using the proxy.",
  "reason": "The vulnerability involves a straightforward buffer overflow due to incorrect input validation. The attack does not require multiple components or complex interactions, and the logic flaw is a common issue in buffer management rather than a novel or subtle interaction.",
  "new_complexity": "LOW",
  "requires_code": true,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null
}