{
    "reported_to": "Kubernetes",
    "reported_by": "rhynorater ",
    "title": "Route53 Subdomain Takeover on test-cncf-aws.canary.k8s.io",
    "content": "\nSummary:\nI discovered that it was possible to takeover test-cncf-aws.canary.k8s.io by assigning a zone to that name with one of the following nameservers in Route53:\nCode 283 Bytes\n1test-cncf-aws.canary.k8s.io. 3600 IN    NS      ns-265.awsdns-33.com.\n2test-cncf-aws.canary.k8s.io. 3600 IN    NS      ns-687.awsdns-21.net.\n3test-cncf-aws.canary.k8s.io. 3600 IN    NS      ns-1458.awsdns-54.org.\n4test-cncf-aws.canary.k8s.io. 3600 IN    NS      ns-1825.awsdns-36.co.uk.\nOnce the zone was claimed, I was able to create DNS records under this host. Consider the following record:\nCode 31 Bytes\n1poc.test-cncf-aws.canary.k8s.io\nSteps To Reproduce:\nSee above domain\nRemediation Instructions\nRemove the NS record delegation NS privs on a subdomain before you delete the zone\nImpact\nWith this vulnerability, an attacker can host arbitrary content under your domain. This can allow an attacker to host brand-damaging materials, steal sensitive * scoped session cookies, and even escalate other vulnerabilities.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Misconfiguration"
    ],
    "screenshots": {},
    "disclosed_date": 1610795220,
    "report_url": "https://hackerone.com/reports/794382",
    "is_multi_component": false,
    "complexity": "MEDIUM",
    "novelty": "LOW",
    "vuln_category": "API",
    "steps": [
        [
            1,
            "Identify the subdomain test-cncf-aws.canary.k8s.io and check for NS record delegation in Route53"
        ],
        [
            2,
            "Create a new hosted zone in Route53 with the same subdomain and assign the provided nameservers"
        ]
    ],
    "vuln_description": "This vulnerability allows an attacker to take over a subdomain by creating a hosted zone in Route53 with the same subdomain name and assigning specific nameservers. Once the zone is claimed, the attacker can create arbitrary DNS records under the subdomain, potentially leading to brand damage, session cookie theft, or escalation of other vulnerabilities.",
    "reason": "The attack is straightforward and involves only basic DNS manipulation. It does not require understanding complex interactions or novel logic, and the steps to reproduce are simple and well-documented in the report.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}