{
    "reported_to": "Node.js third-party modules",
    "reported_by": "mcollina ",
    "title": "Prototype pollution in multipart parsing",
    "content": "\nI would like to report a prototype pollution attack in fastify-multipart it allows to crash a remote server parsing multipart requests by sending a specially crafted request.\nModule\nmodule name: fastify-multipart\nversion: all versions before < v1.0.5. v1.0.5 contains the fix.\nnpm page: https://www.npmjs.com/package/fastify-multipart\nModule Description\nFastify plugin to parse the multipart content-type.\nUnder the hood it uses busboy.\nModule Stats\nweekly downloads: 4900\nVulnerability\nVulnerability Description\nEran Hammer found this vulnerability for Hapi, he tested Fastify as well and found it vulnerable.\nHere is the Hapi vulnerability report: https://www.npmjs.com/advisories/1479.\nSteps To Reproduce:\nDetailed steps to reproduce with all required references/steps/commands. If there is any exploit code or reference to the package source code this is the place where it should be put.\nPatch\nThis was already released in https://github.com/fastify/fastify-multipart/pull/116 and version 1.0.5 issued.\nWrap up\nSelect Y or N for the following statements:\nI contacted the maintainer to let them know: Y\nI opened an issue in the related repository: N\nI just need a CVE issued.\nImpact\nIt's a Denial of Service attack\n\n",
    "severity": [
        9.3,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "Uncontrolled Resource Consumption"
    ],
    "screenshots": {},
    "disclosed_date": 1582905300,
    "report_url": "https://hackerone.com/reports/804772",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "CODE",
    "steps": [
        [
            1,
            "Identify the vulnerable module: fastify-multipart (all versions before v1.0.5)"
        ],
        [
            2,
            "Craft a malicious multipart request that triggers prototype pollution"
        ],
        [
            3,
            "Send the crafted request to a server using fastify-multipart"
        ],
        [
            4,
            "Observe server crash due to prototype pollution"
        ]
    ],
    "vuln_description": "The vulnerability is a prototype pollution attack in fastify-multipart that allows an attacker to crash a remote server by sending a specially crafted multipart request. This leads to a Denial of Service (DoS) condition.",
    "reason": "The vulnerability requires understanding of prototype pollution attacks and how they can be triggered through multipart requests. While the concept of prototype pollution is known, applying it to multipart parsing requires specific knowledge of how the library processes such requests.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}