{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "r00tpgp ",
  "title": "PulseSSL VPN Site with Compromised Creds @ ████",
  "content": "\nDear US DoD,\nBack in 2019, I had reported that a pulseSSL VPN server owned by US DoD can be compromised by a publicly available exploit. The report is████████. As a result, the userid and passwd db was also compromised. I found that at least 1 userid and password combination from that compromised db can still be used.\nPoC\nHere is a screenshot of me accessing a US DoD owned website using a compromised credentials found back in 2019. I am still able to login to https://████/dana-na/auth/url_3/welcome.cgi with:\nl: █████████\np: █████\n█████\nHere is the screenshot of the credentials that was dump back in 2019:\n████\nImpact\nIt is widely reported in the media that blackhat hackers around the world are still hacking fully patched PulseSSL VPN hosts because owners did not change the passwords that was compromised back in 2019. The articles that I am referring to is at :\nhttps://www.us-cert.gov/ncas/alerts/aa20-107a\nhttps://thehackernews.com/2020/04/pulse-secure-vpn-vulnerability.html\nFix\nOther than patching, it is strongly advisable that the impacted organization █████████ reset all passwords immediately.\n\n",
  "severity": [
    9.0,
    10.0
  ],
  "bounty": null,
  "weaknesses": [
    "Insecure Storage of Sensitive Information"
  ],
  "screenshots": {},
  "disclosed_date": 1596145680,
  "report_url": "https://hackerone.com/reports/854049",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "MEDIUM",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Identify a PulseSSL VPN server owned by the US DoD that was previously compromised in 2019."
    ],
    [
      2,
      "Use the compromised credentials (username and password) from the 2019 breach to log in to the VPN server at https://████/dana-na/auth/url_3/welcome.cgi."
    ]
  ],
  "vuln_description": "This vulnerability involves the continued use of compromised credentials from a 2019 breach of a PulseSSL VPN server. Despite the breach being known and patches being available, the credentials were not reset, allowing unauthorized access to the VPN server.",
  "reason": "The attack is straightforward, involving only the use of previously compromised credentials without any need for complex interactions or novel logic. The main challenge was the initial discovery of the compromised credentials in 2019, but their continued use is a simple oversight.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}