{
    "reported_to": "Helium",
    "reported_by": "error___404 ",
    "title": "unpermitted user can change the device name of admin account",
    "content": "\nInvited user with only the read-only permission can change the device name in admin account\n1.create two account 'A 'and 'B ' in console.helium\n2.Invited the account 'B' with 'A' by giving the read-only permission\n3.In account 'B' trying to delete the organization created by admin account 'A' and intercept the request then you got the organization id in request\n4.Then in account 'B' add the device name and click on it and update the name which you want to display in the admin account(victim account)\n5.And intercept the request while clicking the update button\n6.In the request add the organization id which you got in step 3\n7.then forward the request then the device name in admin account will be changed\nImpact\nattacker with only the read-only permission can change the device name in the admin account\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "None"
    ],
    "screenshots": {},
    "disclosed_date": 1592332860,
    "report_url": "https://hackerone.com/reports/865115",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Create two accounts 'A' (admin) and 'B' (read-only) in console.helium."
        ],
        [
            2,
            "Invite account 'B' from account 'A' with read-only permissions."
        ],
        [
            3,
            "In account 'B', attempt to delete the organization created by 'A' and intercept the request to obtain the organization ID."
        ],
        [
            4,
            "In account 'B', add a device name, click to update it, and intercept the request."
        ],
        [
            5,
            "Modify the intercepted request by inserting the organization ID obtained in step 3."
        ],
        [
            6,
            "Forward the modified request to change the device name in admin account 'A'."
        ]
    ],
    "vuln_description": "An invited user with read-only permissions can manipulate requests to change the device name in an admin account by intercepting and modifying requests with the organization ID obtained from another intercepted request.",
    "reason": "The vulnerability involves multiple steps including intercepting requests, extracting an organization ID, and modifying another request. The interaction between these steps is not immediately obvious, requiring the attacker to understand the application's request handling and permission validation mechanisms.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}