{
  "reported_to": "IRCCloud",
  "reported_by": "do_some_hack ",
  "title": "IDOR with Geolocation data not stripped from images",
  "content": "\nVulnerable URL :- ████\nVulnerability Discription:\nWhen an image is taken using a smartphone or camera certain metadata fields are often attached to it. These fields could include the model of the camera, the time it was taken, whether the flash was used, the shutter speed, focal length, light value and even the location. In Inturn, while uploading the image as a profile picture, the exif data is not stripped from images. The exif data in images contains sensitive data like Geoloacation, latitude, longitude, etc. Also it contains the camera information and other details.\nAnd your website vulnerable to image IDOR which allows attacker to see other users images and retrive data using tool.\nTools Used: exiftool.\nSteps TO reproduce:\nUse 2 accounts in two browser\nDownload images from here\nhttps://github.com/ianare/exif-samples/tree/master/jpg/gps\n1)In 1st account in network user can upload files just upload the image their and open image link in new tab.\nnew tab that image url like\n██████████\n2)In second account do same things and that url like down\n█████\n3) Change 1st account Url parameter value to 2nd acoount Url parameter(see poc for it).\n4) now image will shows up copy that url again and paste it to image data retrival website\nhttp://exif.regex.info/exif.cgi\n5) and see sensitive data exposed.\nImpact\n1) By this the attacker tracks your location and use it for personal things.\n2) Sensitive data exposed.\n\n",
  "severity": "[",
  "bounty": 200,
  "weaknesses": "[",
  "screenshots": {},
  "disclosed_date": 1595792160,
  "report_url": "https://hackerone.com/reports/906907",
  "is_multi_component": false,
  "complexity": "LOW",
  "novelty": "LOW",
  "vuln_category": "WEB_APP",
  "steps": "[",
  "Download the accessed image and upload it to an EXIF data retrieval tool (e.g., http": "//exif.regex.info/exif.cgi) to extract sensitive metadata like geolocation.",
  "vuln_description": "The vulnerability involves two issues: 1) Insecure Direct Object Reference (IDOR) allowing unauthorized access to other users' uploaded images, and 2) failure to strip EXIF metadata (e.g., geolocation) from images, exposing sensitive data. Attackers can exploit this to track users' locations or access other private metadata.",
  "reason": "The attack requires understanding of EXIF metadata and basic IDOR exploitation, but the steps are straightforward and do not involve complex interactions or novel logic.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": true,
  "authnz_byppass_detectable": false,
  "injection_classification": "}"
}