{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "xy_ ",
  "title": "Remote Code Execution on █████████",
  "content": "\nSummary:\nAn unauth solr lead to RCE on ██████████\nDescription:\nHello, I found a solr unauth at https://██████/solr/\nThis version is 5.5.1, vulnerable with CVE-2019-0192 and CVE-2019-0193, i have try CVE-2019-0193 and successful RCE.\nImpact\nAttacker can get shell on server.\nStep-by-step Reproduction Instructions\nFirst go to Core Admin and copy path. ██████\nUpdate the config. ███████\nExecute code. ██████████\nProduct, Version, and Configuration (If applicable)\nApache Sole 5.5.1\n## Suggested Mitigation/Remediation Actions\nUpdate to the latest version and set auth.\nImpact\nAttacker can get shell on server.\n\n",
  "severity": [
    9.0,
    10.0
  ],
  "bounty": null,
  "weaknesses": [
    "Code Injection"
  ],
  "screenshots": {},
  "disclosed_date": 1599168300,
  "report_url": "https://hackerone.com/reports/962013",
  "is_multi_component": false,
  "complexity": "LOW",
  "novelty": "LOW",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Access the Solr admin interface at the vulnerable URL (e.g., https://██████/solr/)"
    ],
    [
      2,
      "Navigate to the Core Admin section and copy the path"
    ],
    [
      3,
      "Update the Solr configuration to include a malicious data import handler"
    ],
    [
      4,
      "Execute arbitrary code via the data import handler to achieve Remote Code Execution (RCE)"
    ]
  ],
  "vuln_description": "The vulnerability involves an unauthenticated Apache Solr instance (version 5.5.1) that is susceptible to CVE-2019-0193, allowing an attacker to achieve Remote Code Execution (RCE) by manipulating the Solr configuration and exploiting the data import handler feature.",
  "reason": "The attack involves multiple straightforward steps, including accessing an unauthenticated interface, modifying configuration files, and executing code. The steps are well-documented and do not require complex interactions or novel logic.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null,
  "injection_metadata": {
    "is_simple_payload": false
  },
  "authnz_metadata": {
    "reason": "The vulnerability involves an unauthenticated Solr instance leading to RCE, which falls under AuthN/AuthZ bypass. The methodology described involves testing for AuthN/AuthZ bypass by swapping user sessions or testing with unauthenticated sessions. Since the Solr instance is unauthenticated, it would be detected by the methodology when testing with an unauthenticated user session (step d).",
    "is_detectable": true
  }
}