{
  "reported_to": "Internet Bug Bounty",
  "reported_by": "karas ",
  "title": "CVE-2017-13040 The MPTCP parser in tcpdump before 4.9.2 has a buffer over-read in print-mptcp.c, several functions.",
  "content": "\nDescription:\nVersions of tcpdump before 4.9.2 are vulnerable to a buffer over-read in print-mptcp.c. This vulnerability was disclosed to the tcpdump maintainers and was recently patched in version 4.9.2 and disclosed as (CVE-2017-13040).\nPatch: https://github.com/the-tcpdump-group/tcpdump/commit/4c3aee4bb0294c232d56b6d34e9eeb74f630fe8c\nThis vulnerability can be exploited in two ways. The first is to produce a .pcap file with crafted packet(s) for the protocol(s) concerned and make the target system try to decode the file using tcpdump. The second is to send specially crafted packet(s) to the network segment where the target system is running a tcpdump process that is decoding a live packet capture. In the latter case it depends on the specific network protocol if the crafted packet(s) may be sent from the local segment only or from a remote Internet host.\nImpact\nIf the affected program is running with special privileges, or accepts data from untrusted network hosts (e.g. a webserver) then the bug is a potential security vulnerability. If the heap buffer is filled with data supplied from an untrusted user then that user can corrupt the memory in such a way as to inject executable code into the running program and take control of the process. This is one of the oldest and more reliable methods for attackers to gain unauthorized access to a computer.\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": 500,
  "weaknesses": [
    "Buffer Over-read"
  ],
  "screenshots": {},
  "disclosed_date": 1625876100,
  "report_url": "https://hackerone.com/reports/964582",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "MEDIUM",
  "vuln_category": "CODE",
  "steps": [
    [
      1,
      "Create a .pcap file with crafted MPTCP packets or prepare to send such packets to a network segment where tcpdump is running."
    ],
    [
      2,
      "Execute tcpdump (version before 4.9.2) to decode the crafted .pcap file or capture live traffic containing the malicious packets."
    ]
  ],
  "vuln_description": "The MPTCP parser in tcpdump before 4.9.2 has a buffer over-read in print-mptcp.c, which can be exploited via a crafted .pcap file or live packet capture. This can lead to memory corruption and potential code execution if the program is running with special privileges.",
  "reason": "The vulnerability involves a straightforward buffer over-read in a specific protocol parser. The attack requires crafting packets or a capture file but does not involve complex interactions or state manipulation.",
  "new_complexity": "LOW",
  "requires_code": true,
  "requires_CVE": true,
  "is_ctf": false,
  "other_report": null
}