{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "x3ph_ ",
  "title": "param allows  any external resource to be downloadable | https://████████",
  "content": "\nDescription:\nThe following param allows an attacker to trick people into downloading malicious files, scripts and other payloads.\nhttps://██████████?url=https://<MaliciousURL>\nPoC\nI will show you how the page looks normally without any changes. If you directly access https://███ you will be shown the following page. You can click on 'Click to download' but nothing happens.\n█████\nI replace the download param with the url param and entered my attacking vps server ip address as the URL and execute.\n█████\nOn my attacking vps server (The black console) you can see that i have received the request from my personal computers ip address showing that it is 100% possible to perform this attack.\nhttps://██████████?url=https://████/poc\n████████\nImpact\nIf an attacker abuses this vulnerability he/she will be able to compromise accounts, computers and identities of people. Potentially Military staff if the attacker had bad intentions.\nStep-by-step Reproduction Instructions\nNavigate to https://███████\nClick on 'Click to download'\nReplace download with url\nType in a url and click download\nProduct, Version, and Configuration (If applicable)\nSuggested Mitigation/Remediation Actions\nDev needs to add validation to the url param so that it doesn't allow external resources to be downloadable.\nResources:\nThe only article i can find pertaining to this type of vulnerability\nhttps://cheatsheetseries.owasp.org/cheatsheets/Unvalidated_Redirects_and_Forwards_Cheat_Sheet.html\nImpact\nIf an attacker abuses this vulnerability he/she will be able to compromise accounts, computers and identities of people. Potentially Military staff if the attacker had bad intentions.\n\n",
  "severity": "[",
  "bounty": null,
  "weaknesses": "[",
  "screenshots": {},
  "disclosed_date": 1615514340,
  "report_url": "https://hackerone.com/reports/995347",
  "is_multi_component": false,
  "complexity": "LOW",
  "novelty": "LOW",
  "vuln_category": "WEB_APP",
  "steps": "[",
  "Navigate to the vulnerable URL": "https://\\u2588\\u2588\\u2588\\u2588\\u2588\\u2588\\u2588",
  "Replace the 'download' parameter with 'url' and input a malicious URL (e.g., https": "//<MaliciousURL>)",
  "vuln_description": "The vulnerability allows an attacker to manipulate the 'url' parameter to force the application to download arbitrary external resources, potentially leading to the execution of malicious files or scripts on the victim's system.",
  "reason": "The attack involves a straightforward parameter manipulation without requiring complex interactions or deep understanding of the application's internal logic. The vulnerability is easily discoverable through basic testing of URL parameters.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": false,
  "authnz_byppass_detectable": true,
  "injection_classification": "}"
}