{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "nagli ",
  "title": "Able to authenticate as administrator by navigating to https://█████/admin/",
  "content": "\nSummary:\nThe endpoint at https://███████/admin/ authenticates the user to the administrator user.\nStep-by-step Reproduction Instructions\nNavigate to https://███/ and youll notice you will need to log in.\nNavigating to https://██████████/admin/ will show you admin malformed page, with the ability to \"log out\"\nAs for now as we can see by the picture no data is present at the administrator panel, sure this might change at the future exposing sensitive ifnormation\n████████\nSuggested Mitigation/Remediation Actions\nIssuing 403 response when trying to access the /admin endpoint.\nBest regards\nnagli\nImpact\nAdmin authentication bypass\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": null,
  "weaknesses": [
    "Improper Authentication - Generic"
  ],
  "screenshots": {},
  "disclosed_date": 1610505300,
  "report_url": "https://hackerone.com/reports/1035742",
  "vuln_category": "WEB_APP",
  "is_multi_component": false,
  "complexity": "LOW",
  "novelty": "LOW",
  "steps": [
    [
      1,
      "Navigate to https://█████/ and observe that login is required."
    ],
    [
      2,
      "Navigate directly to https://█████/admin/ and observe the admin panel with a 'log out' option, indicating authentication bypass."
    ]
  ],
  "vuln_description": "The vulnerability allows an unauthenticated user to access the admin panel by directly navigating to the /admin endpoint, bypassing normal authentication mechanisms. This could potentially expose sensitive administrative functions or data in the future.",
  "reason": "The attack involves only a single, straightforward step (directly accessing the admin URL) with no complex interactions or state manipulations required. This is a common type of misconfiguration that doesn't require any novel logic or deep understanding of the application.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": false,
  "authnz_byppass_detectable": true,
  "is_simple_payload": false,
  "injection_metadata": {
    "is_simple_payload": false
  },
  "authnz_metadata": {
    "reason": "The vulnerability involves accessing an admin panel without proper authentication, which falls under the AuthN/AuthZ Bypass methodology. The detection method involves testing navigation/action boundaries with different user sessions (including unauthenticated sessions), which would catch this issue.",
    "is_detectable": true
  }
}