{
    "reported_to": "U.S. Dept Of Defense",
    "reported_by": "nagli ",
    "title": "Blind Stored XSS Payload fired at the backend on https://█████████/",
    "content": "\nSummary:\nI have just gotten an email notification from my XSSHunter payload that my blind stored XSS has been triggered by an administrator on the █████████ site, in the following URL:\nCode 18 Bytes\n1https://█████/████\nAdmin IP address:\n████████\nUser-Agent:\n█████████\nCookies:\nCode 6 Bytes\n1██████\nInjection Image:\n███████\nDB Creds exposed:\n██████████.█████\\█████a\nSuggested Mitigation/Remediation Actions\nSanitizing the input on the back-end as well\nBest Regards\nnagli\nImpact\nAbility to capture administrator action when preforming activities on the back-end.\nExtractions of DB credentials.\nAccess to private information.\nStealing the cookies of the administrator.\n\n",
    "severity": [
        9.0,
        10.0
    ],
    "bounty": null,
    "weaknesses": [
        "Cross-site Scripting (XSS) - Stored"
    ],
    "screenshots": {},
    "disclosed_date": 1616632260,
    "report_url": "https://hackerone.com/reports/1051369",
    "vuln_category": "WEB_APP",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "steps": [
        [
            1,
            "Identify an input field on the target website (https://█████████/) that does not properly sanitize user input."
        ],
        [
            2,
            "Inject a blind stored XSS payload into the identified input field. The payload should be designed to execute when an administrator views the affected page."
        ],
        [
            3,
            "Monitor the XSSHunter service for notifications indicating that the payload has been triggered by an administrator."
        ],
        [
            4,
            "Once triggered, extract sensitive information such as the administrator's IP address, user-agent, cookies, and potentially exposed database credentials."
        ]
    ],
    "vuln_description": "This is a blind stored Cross-Site Scripting (XSS) vulnerability that allows an attacker to inject malicious scripts into the backend of the target website. When an administrator views the affected page, the script executes, enabling the attacker to capture sensitive information such as the administrator's actions, cookies, and database credentials.",
    "reason": "The vulnerability involves injecting a payload that remains dormant until triggered by an administrator, which requires understanding of both XSS and the application's backend behavior. However, the steps to exploit are straightforward once the vulnerable input field is identified.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null,
    "authnz_metadata": {
        "reason": "The blind stored XSS vulnerability involves injecting a malicious payload that gets executed in the context of an administrator's session, which is not directly related to the (user_session, action, resource_id) tuples methodology described. The methodology focuses on AuthN/AuthZ bypasses and IDORs by swapping sessions or resource IDs within the same application, whereas the XSS vulnerability is about injecting and executing arbitrary JavaScript in a different user's context.",
        "is_detectable": false
    }
}