{
    "reported_to": "Brave Software",
    "reported_by": "newfunction ",
    "title": "Brave Browser Tor Window leaks user's real IP to the external DNS server",
    "content": "\nSummary:\nWhen a user navigates to a URL in Tor Window, the DNS requests are sent directly without using the Tor proxy, which leaks the user's real IP address and the requested domain name to the user's ISP and the DNS server.\nProducts affected:\nOS: Ubuntu 18.04.5 LTS x86_64\nBrave: Version 1.18.78 Chromium: 87.0.4280.141 (Official Build) (64-bit)\nSteps To Reproduce:\nOpen WireShark, and start capturing traffic on the Internet interface. Set WireShark's display filter to dns.\nOpen Brave Browser. Then open new private window with Tor.\nOn the Tor window, navigate to https://tools.ietf.org/ (or any other URLs)\nIn WireShark, you can see a DNS request for tools.ietf.org sent to your DNS server.\nSupporting Material/References:\na screenshot attached\nImpact\nBrave's Tor window passively leaks users' IP addresses and requests to DNS servers. This undermines the user's anonymity.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Information Disclosure"
    ],
    "screenshots": {},
    "disclosed_date": 1623921900,
    "report_url": "https://hackerone.com/reports/1077022",
    "vuln_category": "WEB_APP",
    "is_multi_component": false,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "steps": [
        [
            1,
            "Open WireShark and start capturing traffic on the Internet interface. Set the display filter to 'dns'."
        ],
        [
            2,
            "Open Brave Browser and open a new private window with Tor."
        ],
        [
            3,
            "Navigate to a URL (e.g., https://tools.ietf.org/) in the Tor window."
        ],
        [
            4,
            "Observe the DNS request for the URL in WireShark, noting that it is sent directly to the DNS server, bypassing the Tor proxy."
        ]
    ],
    "vuln_description": "When a user navigates to a URL in Brave Browser's Tor Window, the DNS requests are sent directly to the DNS server without using the Tor proxy. This leaks the user's real IP address and the requested domain name to the ISP and the DNS server, compromising anonymity.",
    "reason": "The vulnerability involves a straightforward observation of DNS traffic using a common tool like WireShark. The issue is not subtle or complex; it is a direct failure to route DNS requests through the Tor proxy. No novel logic or complex application states are involved.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}