{
    "reported_to": "U.S. General Services Administration",
    "reported_by": "rptl ",
    "title": "Weak password policy leading to exposure of administrator account access",
    "content": "\nHi,\nThe login endpoint https://mysmartplans.gsa.gov/Marathon/Default.aspx is having weak password policy.\nDuring the recon, I came across a mysmartplans overview document http://www.accentimaging.com/accent/pdfs/Accent%20MySmartPlans.pdf\n. In this document few users are mentioned like - rick, ban, tim etc.I tried to login user password combination of these user-names & rick wass found a valid administrator username & password.\nusername- rick\npassword -rick\nThis user appears to be administrator user.\nHope GSA takes necessary measures to improve user account policies.\nPoC\n1) Open url https://mysmartplans.gsa.gov/Marathon/Default.aspx\n2) Enter username rick password rick\n3) You will be logged into user account with administrative access. You can edit, create, update users.\nImpact\nAdmin account compromise.\n\n",
    "severity": [
        9.1,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "Misconfiguration"
    ],
    "screenshots": {},
    "disclosed_date": 1621536300,
    "report_url": "https://hackerone.com/reports/1168104",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Open URL https://mysmartplans.gsa.gov/Marathon/Default.aspx"
        ],
        [
            2,
            "Enter username 'rick' and password 'rick'"
        ],
        [
            3,
            "You will be logged into the user account with administrative access, allowing you to edit, create, and update users"
        ]
    ],
    "vuln_description": "The login endpoint has a weak password policy, allowing easy guesswork of administrator credentials. The username 'rick' with password 'rick' was found to be valid, granting administrative access.",
    "reason": "The vulnerability involves minimal components and straightforward guesswork of credentials. The attack does not require any complex interactions or manipulation of application states, nor does it involve novel logic. The discovery was made through basic reconnaissance and simple credential testing.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}