{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "rook1337 ",
  "title": "IDOR while uploading ████ attachments at [█████████]",
  "content": "\nDescription:\nThere is an IDOR vulnerability in uploading attachments to the ████ section where an attacker can upload attachments in other user's █████████ if there is no attachment uploaded by a user. If this vulnerability will be used with a Race condition, it can allow an attacker to upload attachments in all-new █████████ created by users.\nImpact\nA user can upload attachments to other users ███.\nSystem Host(s)\n██████\nAffected Product(s) and Version(s)\nCVE Numbers\nSteps to Reproduce\nGo to ██████\nLogin\nGo to https://███/█████\nAdd a new █████████ and upload an attachment with that and submit it.\nSend the request to the repeater.\n████\n6. Change the ███Id parameter value to the victim user's ██████████ id.\n█████████\n7. Click on the send button and you will see success in response.\n8. It will be uploaded in the victim user █████ section.\nSuggested Mitigation/Remediation Actions\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": null,
  "weaknesses": [
    "Insecure Direct Object Reference (IDOR)"
  ],
  "screenshots": {},
  "disclosed_date": 1625100420,
  "report_url": "https://hackerone.com/reports/1196976",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Go to the target website and log in."
    ],
    [
      2,
      "Navigate to the section where attachments can be uploaded."
    ],
    [
      3,
      "Create a new entry and upload an attachment, then submit it."
    ],
    [
      4,
      "Capture the request in a tool like Burp Repeater."
    ],
    [
      5,
      "Modify the request to change the user ID parameter to a victim's ID."
    ],
    [
      6,
      "Send the modified request and observe the successful upload to the victim's section."
    ]
  ],
  "vuln_description": "An Insecure Direct Object Reference (IDOR) vulnerability allows an attacker to upload attachments to other users' sections if those users have not yet uploaded any attachments. When combined with a race condition, this could enable mass exploitation across new user entries.",
  "reason": "The vulnerability involves understanding the IDOR flaw and the potential for race condition exploitation, but the steps to reproduce are straightforward once the parameter manipulation is identified.",
  "new_complexity": "MEDIUM",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": true,
  "authnz_byppass_detectable": false,
  "is_simple_payload": false,
  "injection_metadata": {
    "is_simple_payload": false
  },
  "authnz_metadata": {
    "reason": "The IDOR vulnerability involves swapping resource_ids (user IDs) in the attachment upload functionality, which is covered by the methodology's test e) (substituting resource_ids with existing ones). The race condition aspect would require additional timing analysis but the core IDOR is detectable.",
    "is_detectable": true
  }
}