{
    "reported_to": "Ruby",
    "reported_by": "sohaib619 ",
    "title": "Bug Report : [ No Valid SPF Records ]",
    "content": "\nHi Team,\nHope you are doing well. I found vulnerability in your web app\nURL : https://www.ruby-lang.org/en/s\nDescription :\nThere is an email spoofing vulnerability. Email spoofing is the forgery of an email header so that the message appears to have originated from someone or somewhere other than the actual source. Email spoofing is a tactic used in phishing and spam campaigns because people are more likely to open an email when they think it has been sent by a legitimate source. The goal of email spoofing is to get recipients to open, and possibly even respond to a solicitation.\nAttack Scenario & PoC:\nOnce there is No SPF Records.An attacker can spoof email via any fake mailer Like Emkei.cz.An attacker can send email from name \"Support\" and Email: \"support@target.com\" with social engineering attack he can takeover user account let victim knows the phishing attack but when he see the email from the Authorized Domain. He got tricked easily.\nChecking Missing SPF\nThere are various ways of checking missing SPF Records on a website But the Most Common and Popular way is kitterman.com\nSteps to Check SPF Records on a website:-\nGo to http://www.kitterman.com/spf/validate.html\nEnter Target Website Ex: target.com (Do Not Add https/http or www)\nHit Check SPF (IF ANY)\nI found :\nSPF record lookup and validation for: ruby-lang.org\nSPF records are published in DNS as TXT records.\nThe TXT records found for your domain are:\n_globalsign-domain-verification=6GywlC8PVV6mLfL6ToMeVqCDeqFk9IDu2uEqmYPqx3\nv=spf1 +ip4:210.251.121.208/28 +ip4:221.186.184.64/28 include:_spf.google.com ~all\nChecking to see if there is a valid SPF record.\nFound v=spf1 record for ruby-lang.org:\nv=spf1 +ip4:210.251.121.208/28 +ip4:221.186.184.64/28 include:_spf.google.com ~all\nevaluating...\nSPF record passed validation test with pySPF (Python SPF library)!\nScreenshot and video:\nimage.pngimage.png\nRemediation :\nReplace ~all with -all to prevent fake email.\nReferences :\nhttps://www.digitalocean.com/community/tutorials/how-to-use-an-spf-record-to-prevent-spoofing-improve-e-mail-reliability\nReference Report\nhttps://hackerone.com/reports/629087\n\nHope you will fix that soon. Looking forward to your positive response.\nThanks.\nKind Regards,\nSohaib\nImpact\nImpact:\nAn attacker would send a Fake email. The results can be more dangerous.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "None"
    ],
    "screenshots": {},
    "disclosed_date": 1642131540,
    "report_url": "https://hackerone.com/reports/1301696",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Go to http://www.kitterman.com/spf/validate.html"
        ],
        [
            2,
            "Enter the target domain (e.g., ruby-lang.org) and click 'Check SPF'"
        ]
    ],
    "vuln_description": "The target domain lacks strict SPF (Sender Policy Framework) records, allowing email spoofing. The current SPF record uses '~all' (soft fail) instead of '-all' (hard fail), which makes it easier for attackers to send forged emails appearing to originate from the domain.",
    "reason": "The vulnerability is straightforward to discover using publicly available SPF validation tools. The attack involves no complex interactions or novel logic, and the steps to verify the issue are simple and well-documented.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": "629087"
}