{
    "reported_to": "MTN Group",
    "reported_by": "dh0pe ",
    "title": "Sensitive Information Disclosure Through Config File",
    "content": "\nSummary:\nAn attacker could gain access to sensitive information about usernames, encrypted passwords, internal IP addresses and configuration data of internal services.\nSteps To Reproduce:\nGo to https://zik.mtncameroon.net/common/queryconfig.action\nRemediation\nConfigure the application to not reveal sensitive information to client.\nReferences\nhttps://cwe.mitre.org/data/definitions/200.html\nImpact\nA malicious user is able to gain sensitive information usernames, encrypted passwords, internal IP addresses and configuration data of internal services.\n\n",
    "severity": [
        7.5,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "Cleartext Storage of Sensitive Information"
    ],
    "screenshots": {},
    "disclosed_date": 1662079800,
    "report_url": "https://hackerone.com/reports/1397788",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Navigate to the URL: https://zik.mtncameroon.net/common/queryconfig.action"
        ],
        [
            2,
            "Observe the exposed sensitive information in the response (usernames, encrypted passwords, internal IPs, etc.)"
        ]
    ],
    "vuln_description": "The vulnerability involves an information disclosure issue where a config file at a specific endpoint exposes sensitive information such as usernames, encrypted passwords, internal IP addresses, and configuration data of internal services without proper access controls.",
    "reason": "The vulnerability is straightforward to discover as it only requires accessing a specific URL without any complex interactions or state manipulations. The exposed information is directly visible in the response, making the discovery process simple and direct.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}