{
    "reported_to": "Reddit",
    "reported_by": "ahacker1 ",
    "title": "XSS via Mod Log Removed Posts",
    "content": "\nSummary:\nI have discovered an XSS vulnerability regarding the mod notes feature. Specifically, the XSS payload executes when the victim removes a post in a subreddit and opens up the mod notes of the attacker.\nSteps To Reproduce:\nThe attacker creates a new post with the title containing the XSS payload.\nThe victim (mods of the subreddit) then must remove your post.\nThe payload executes when a victim (subreddit mod) opens up your mod notes. Sometimes, the mod notes are displayed when the victim hovers on your profile (this is true when a recent mod action has been taken on the user).\nSupporting Material/References:\n█████\n█████\nImpact\nImpact Below:\n\n",
    "severity": [
        7.5,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "Cross-site Scripting (XSS) - Stored"
    ],
    "screenshots": {},
    "disclosed_date": 1646972280,
    "report_url": "https://hackerone.com/reports/1504410",
    "is_multi_component": false,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "The attacker creates a new post with a title containing an XSS payload."
        ],
        [
            2,
            "The victim (subreddit moderator) removes the attacker's post, triggering the XSS payload when viewing the attacker's mod notes."
        ]
    ],
    "vuln_description": "An XSS vulnerability exists in the mod notes feature where a malicious payload embedded in a post's title executes when a moderator removes the post and views the attacker's mod notes. The payload may also execute when hovering over the attacker's profile if recent mod actions have been taken.",
    "reason": "The vulnerability involves understanding the interaction between post removal and mod notes display, but the attack chain is relatively straightforward once the XSS vector is identified. The components (post creation, removal, mod notes) are standard features with predictable interactions.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null,
    "authnz_metadata": {
        "reason": "The XSS vulnerability involves execution of a payload in the context of mod notes, which is a client-side issue rather than an authentication or authorization boundary being crossed. The methodology described focuses on testing AuthN/AuthZ boundaries by swapping user sessions and resource IDs, which does not apply to this XSS vulnerability.",
        "is_detectable": false
    }
}