{
    "reported_to": "Khan Academy",
    "reported_by": "bughunterpol ",
    "title": "Enumerate class codes via yahoo dork - Can access any course under teacher - Sensitive information leaked",
    "content": "\nHello Team,\nI am quality researcher and I found some links using yahoo dorking techniques\nI used yahoo dork site:pl.khanacademy.org/join\nI used Firefox browser.\nSteps to reproduce:\n1.Go to yahoo search page and use above query to enumerate.\n2.Create student account by filling all the required details\n3.Now you are in the class without actually invited by teacher.\n4.You can pick any course from item and start you course.\nI can also able to see teacher Full name- This is sensitive information\nAttached POC:\nImpact\nAny black hacker can enumerate all the classes and join in them and can make chaos.\nSome chances of IDOR too.\nIf you can encrypt this class details which some hashing technique and this will not showed up with dorking queries.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Information Disclosure"
    ],
    "screenshots": {},
    "disclosed_date": 1651442700,
    "report_url": "https://hackerone.com/reports/1514356",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Go to Yahoo search page and use the query 'site:pl.khanacademy.org/join' to enumerate class codes."
        ],
        [
            2,
            "Create a student account with required details and join a class without an invitation, gaining access to course materials and teacher's full name."
        ]
    ],
    "vuln_description": "This vulnerability allows unauthorized access to Khan Academy classes by enumerating class codes via Yahoo dorking. Attackers can join any class without an invitation, view sensitive information like the teacher's full name, and potentially disrupt the class environment.",
    "reason": "The attack involves using a search engine dork to enumerate class codes, which is a straightforward technique. The interaction between the search query and the class joining mechanism is not complex, and the vulnerability does not require manipulating application states or novel logic.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}