{
    "reported_to": "lemlist",
    "reported_by": "scriptsavvy ",
    "title": "Clickjacking at  app.lemlist.com",
    "content": "\nHi team,\nWhile performing security testing of your website i have found the vulnerability called Clickjacking.\nMany URLS are in scope and vulnerable to Clickjacking.\nWhat is Clickjacking ?\nClickjacking (User Interface redress attack, UI redress attack, UI redressing) is a malicious technique of tricking a Web user into clicking on something different from what the user perceives they are clicking on, thus potentially revealing confidential information or taking control of their computer while clicking on seemingly innocuous web pages.\nThe server didn't return an X-Frame-Options header which means that this website could be at risk of a clickjacking attack. The X-Frame-Options HTTP response header can be used to indicate whether or not a browser should be allowed to render a page in a <frame> or <iframe>. Sites can use this to avoid clickjacking attacks, by ensuring that their content is not embedded into other sites.\nThis vulnerability affects Web Server.\nVulnerable Urls:\nhttps://app.lemlist.com\nPut every above url one by one in the code of iframe, which is given below\nCode 305 Bytes\n1<html lang=\"tr-TR\">\n2<kafa>\n3<meta karakter kümesi=\"UTF-8\">\n4<title>Çerçeve Yapıyorum</title>\n5</head>\n6<body>\n7<h3>clickjacking güvenlik açığı</h3>\n8<iframe src=\"https://app.lemlist.com/teams/tea_sgYr5dZr478x4FQ9K/settings/user/usr_Z3GZ4DDHLLyLyZHj5/users\" height=\"550px\" width=\"700px\"></iframe>\n9</body>\n10</html>\nImpact\nUsing a similar technique, keystrokes can also be hijacked. With a carefully crafted combination of stylesheets, iframes, and text boxes, a user can be led to believe they are typing in the password to their email or bank account, but are instead typing into an invisible frame controlled by the attacker.\n\n",
    "severity": [
        7.3,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "UI Redressing (Clickjacking)"
    ],
    "screenshots": {},
    "disclosed_date": 1653073440,
    "report_url": "https://hackerone.com/reports/1574017",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Create an HTML file with an iframe element pointing to the vulnerable URL: https://app.lemlist.com"
        ],
        [
            2,
            "Open the HTML file in a browser and observe that the target page loads within the iframe without any X-Frame-Options header preventing it"
        ]
    ],
    "vuln_description": "Clickjacking vulnerability at app.lemlist.com where the server does not return an X-Frame-Options header, allowing the site to be embedded in an iframe and potentially tricking users into clicking on hidden elements.",
    "reason": "The vulnerability is straightforward to discover as it only requires checking for the absence of the X-Frame-Options header and creating a simple HTML page with an iframe. There are no complex interactions or multiple components involved.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}