{
    "reported_to": "U.S. Dept Of Defense",
    "reported_by": "berserkbd47 ",
    "title": "Wordpress Takeover using setup configuration at http://████.edu [HtUS]",
    "content": "\nDescription:\nThe WordPress 'setup-config.php' installation page allows users to install\nWordPress in local or remote MySQL databases. This typically requires a user\nto have valid MySQL credentials to complete. However, a malicious user can\nhost their own MySQL database server and can successfully complete the\nWordPress installation without having valid credentials on the target system.\nReproduce step by step:\nI found this vulnerable url:\nhttp://███.edu/old/wp-admin/setup-config.php\nThen i configured db\nI used this site https://www.freemysqlhosting.net/\nAfter configure I got wordpress admin access\nproof:\nhttp://██████████.edu/old/rce.txt\nAdmin credentials that I set after installing the config\nusername: ████████\npassword: ███\nLogin Panel: http://████████.edu/old/wp-login.php\nVideo POC has been attached as well.\nImpact\nImpact\nRemote Code Execution/Total system compromise.\nAttacker can upload webshell into the server. I did not upload any shell for security violation.\nMalware distribution\nPhishing / Spear phishing\nXSS\nAuthentication bypass\n\n",
    "severity": [
        9.0,
        10.0
    ],
    "bounty": null,
    "weaknesses": [
        "Misconfiguration"
    ],
    "screenshots": {},
    "disclosed_date": 1673651040,
    "report_url": "https://hackerone.com/reports/1626205",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Locate the vulnerable WordPress setup-config.php page at http://████.edu/old/wp-admin/setup-config.php"
        ],
        [
            2,
            "Configure the database using a third-party MySQL hosting service (e.g., https://www.freemysqlhosting.net/)"
        ],
        [
            3,
            "Complete the WordPress installation process using the external MySQL credentials"
        ],
        [
            4,
            "Gain admin access to the WordPress instance with the credentials set during installation"
        ]
    ],
    "vuln_description": "The vulnerability allows an attacker to take over a WordPress installation by exploiting the setup-config.php page. By hosting their own MySQL database server and providing its credentials during the WordPress installation, an attacker can complete the installation process without needing valid credentials for the target system's database. This results in full administrative access to the WordPress instance.",
    "reason": "The attack involves multiple components (locating the setup page, setting up an external MySQL server, and completing the installation), but each step is straightforward and well-documented. The interaction between these components is not subtle or complex, and the logic is commonly understood in WordPress installations.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}