{
  "reported_to": "Nextcloud",
  "reported_by": "hackerwahab ",
  "title": "BruteForce in to Admin Account",
  "content": "\nHello,\nMy self Abdulwahab,\nI want to Alert You that Your website is Facing a serious Problem Called : Username Enumeration\nThis Problem is on\nnextcloud.com/wp-admin\nWe Use wpscan to get username\nand the username is\n\"frank\"\nAfter getting username a user can Bruteforce it Using Wpscan and get access to admin panel and upload shell and also get all sub_domain Means Full Server is Hacked!\nFIX\nTo Fix this use Wordpress Login Attemptizer\nThanks,\nABDULWAHAB,\nIndependent Cyber Security Researcher,\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": null,
  "weaknesses": [
    "Improper Authentication - Generic"
  ],
  "screenshots": {},
  "disclosed_date": 1480895340,
  "report_url": "https://hackerone.com/reports/188205",
  "is_multi_component": false,
  "complexity": "LOW",
  "novelty": "LOW",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Use wpscan to enumerate usernames on the WordPress admin page (nextcloud.com/wp-admin)."
    ],
    [
      2,
      "Once the username 'frank' is identified, use wpscan to brute-force the password for the admin account."
    ]
  ],
  "vuln_description": "The vulnerability involves username enumeration and subsequent brute-force attacks on the WordPress admin panel, which can lead to unauthorized access, shell upload, and potential server compromise.",
  "reason": "The attack involves straightforward steps using common tools (wpscan) and does not require complex interactions or novel logic. The vulnerability is well-known and the tools used are standard in the security community.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": false,
  "authnz_byppass_detectable": true,
  "is_simple_payload": false,
  "injection_metadata": {
    "is_simple_payload": false
  },
  "authnz_metadata": {
    "reason": "The vulnerability involves username enumeration and brute-force attacks on a WordPress admin panel, which are not directly related to the IDOR or AuthN/AuthZ bypass methodologies described. The described methodologies focus on swapping user sessions or resource IDs within the same application context, whereas the reported issue involves external tools (wpscan) and brute-forcing credentials, which are outside the scope of the given methodologies.",
    "is_detectable": false
  }
}