{
    "reported_to": "Nextcloud",
    "reported_by": "demo--hacker ",
    "title": "Version 4.7.2 of wordpress is vulnerable",
    "content": "\nHello team,\nI observed that your website https://nextcloud.com still use wordpress 4.7.2\nVersion 4.7.2 of wordpress is vulnerable to :\nCross-site scripting (XSS)\nControl characters can trick redirect URL validation\nCross-site scripting (XSS) via video URL in YouTube embeds\nCross-site scripting (XSS) via taxonomy term names\nCross-site request forgery (CSRF) in Press This leading to excessive use of server resources\nFix :\nUpgrade to wordpress 4.7.3\nMore information : https://wordpress.org/news/2017/03/wordpress-4-7-3-security-and-maintenance-release/\nBest regards\nRey Mark\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "None"
    ],
    "screenshots": {},
    "disclosed_date": 1488926280,
    "report_url": "https://hackerone.com/reports/211206",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Access the WordPress admin dashboard of the target website (https://nextcloud.com)."
        ],
        [
            2,
            "Check the WordPress version in the dashboard footer or via the 'At a Glance' widget to confirm it is version 4.7.2."
        ]
    ],
    "vuln_description": "WordPress version 4.7.2 is vulnerable to multiple security issues including Cross-site scripting (XSS) via video URL in YouTube embeds, taxonomy term names, and other vectors, as well as CSRF in Press This leading to excessive server resource usage. These vulnerabilities can be exploited to execute malicious scripts, bypass security checks, or perform unauthorized actions.",
    "reason": "The vulnerability involves checking the WordPress version, which is straightforward and publicly visible in the admin dashboard. The exploitation of these vulnerabilities does not require complex interactions or state manipulations, making the discovery process simple.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}