{
    "reported_to": "Phabricator",
    "reported_by": "kevin_c ",
    "title": "An unsafe design practice in the Passphrase may result in Secret being accidentally changed.",
    "content": "\nSummary:\nAn unsafe design practice in the Passphrase may result in Secret being accidentally changed.\nPreface:\nIf a user wants to share his/hers secrets, he/she may use the Passphrase. But when he/she created the credential and setted who can view it and who can edit it, they will soon discover that if they not set the edit permission to the one they want to share secret with, it is impossible success. Naturally, they would give the edit permission to everyone they want to share the secret with. So, here is the problem. It means they can change the secret. If someone ignores the edit records, he/she may under attack inadvertently. Because the secret has been modified.\nReproduction steps:\nOpen three different browsers (to simulate three different users)\nBROWSER A: Log in as user A\nBROWSER B: Log in as user B\nBROWSER C: Log in as user C\nBROWSER A: Go to the Passphrase and create new credential. Make it visible to both user A user B and user C. Make it editable to only user A.\nBROWSER B: Open the https://yourdomain.com/K1(your id) and discover it is impossible to show the secret.\nBROWSER A: Make it editable to both user A user B and user C.\nBROWSER B: User B can see the secret and can change it.\nBROWSER C: Open the https://yourdomain.com/K1(your id) but only can see the the secret has been modified.\nPlease fix it right away.\nBest regards,\nKevin C.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Violation of Secure Design Principles"
    ],
    "screenshots": {},
    "disclosed_date": 1491297000,
    "report_url": "https://hackerone.com/reports/218324",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Open three different browsers (to simulate three different users)"
        ],
        [
            2,
            "Log in as user A in Browser A, user B in Browser B, and user C in Browser C"
        ],
        [
            3,
            "In Browser A, create a new credential in Passphrase, visible to users A, B, and C, but editable only to user A"
        ],
        [
            4,
            "In Browser B, attempt to view the credential and observe it is impossible"
        ],
        [
            5,
            "In Browser A, change the credential's edit permission to include users B and C"
        ],
        [
            6,
            "In Browser B, confirm the ability to view and edit the secret"
        ],
        [
            7,
            "In Browser C, observe that the secret has been modified"
        ]
    ],
    "vuln_description": "An unsafe design practice in the Passphrase feature allows shared secrets to be accidentally modified by users with edit permissions, leading to potential inadvertent attacks if edit records are ignored.",
    "reason": "The vulnerability involves straightforward steps to reproduce and does not require complex interactions or novel logic. The issue is primarily a design flaw in permission management.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}