{
  "reported_to": "Uber",
  "reported_by": "arneswinnen ",
  "title": "Authentication bypass on auth.uber.com via subdomain takeover of saostatic.uber.com",
  "content": "\nSummary\nThis is not a standard vulnerability, but a chain of two more exotic vulnerabilities leading to a full authentication bypass of your SSO login system at auth.uber.com (via saostatic.uber.com). The root cause of this authentication bypass is two-fold:\nSubdomain saostatic.uber.com was pointing to Amazon Cloudfront CDN, but the hostname was not registered there anymore. This allowed me to fully takeover this domain. It is now serving content of my own webserver, both over http and https (highly similar to 175070 - however, I must disagree with \"there are some mitigating factors (cookie scope) that make this not as bad as it might appear at first blush.\").\nYour SSO system at auth.uber.com issues session cookies which are temporarily shared between all https://*.uber.com subdomains through its \"domain=.uber.com\" attribute. Although there were some countermeasures to prevent theft, the current setup still allows leakage of these high-value session cookies to the overtaken subdomain https://saostatic.uber.com in all modern browsers, leading to a full Authentication Bypass (highly similar to 172137).\nSecurity Impact\nThe security impact of the subdomain takeover is that Uber can be impersonated via this webpage. A valid SSL certificate could easily be generated for this domain via Let's Encrypt, which would make it ideal for e.g. phishing attacks.\nThe security impact of the SSO system using shared session cookies for https://.uber.com is, in combination with the subdomain takeover vulnerability, an Authentication Bypass via session hijacking. A victim must be authenticated to auth.uber.com and then visit a webpage under the attacker's control to be exploited successfully - no further interaction is required from the victim, the attack can be performed stealthily without the user noticing or being notified by Uber. The end result is that the attacker can now impersonate the victim on any of the .uber.com which rely on auth.uber.com for authentication, such as riders.uber.com, partners.uber.com, developer.uber.com, bonjour.uber.com, etc.\n# 1. Subdomain Takeover\nThe subdomain \"saostatic.uber.com\" was (and still is) a CNAME pointing to a AWS Cloudfront CDN server (depending on your location, the latter will resolve differently):\nCode 168 Bytes\n1# nslookup saostatic.uber.com 8.8.8.8\n2Server:\t\t8.8.8.8\n3Address:\t8.8.8.8#53\n4\n5Non-authoritative answer:\n6saostatic.uber.com\tcanonical name = d3i4yxtzktqr9n.cloudfront.net.\nHowever, the hostname \"saostatic.uber.com\" was not claimed anymore on Cloudfront, resulting in a Cloudfront error page when visiting the subdomain before the takeover:\n<image_0>\nSubsequently, a new Amazon Cloudfront CDN endpoint was created and linked to an attacker-controlled origin server. For the new Cloudfront CDN endpoint, \"saostatic.uber.com\" was designated as hostname successfully:\n<image_1>\nThis concluded the subdomain takeover. Visual proof can be found at http://saostatic.uber.com/subdomaintakeoverbyarneswinnen.html (unguessable filename chosen to not negatively affect Uber's reputation during takeover period) :\n<image_2>\n#2. Authentication Bypass\nIn Uber's SSO system, auth.uber.com acts as Identity Provider and issues temporarily shared session cookies for https://*.uber.com to communicate identities to Service Providers (e.g. riders.uber.com, partners.uber.com, etc). Service Providers on their end immediately destroy the incoming temporary shared session cookies in case of erroneous (e.g. issued for other Service Provider) or successful authentication, ensuring the window for theft is small:\n{F202679}\nThe precious shared session cookie \"_csid\" can thus only be stolen between step 9 and 10, which is a very short period (automatic browser redirect). Although not impossible to exploit, a more convenient flaw was identified that allows the shared session cookie to remain alive after step 9 in the browser's cookie store in the diagram above. The issue is that, if the victim is already logged in at https://riders.uber.com (situation after last step 12 in diagram) when receiving a request containing a valid newly generated shared session cookie \"_csid\", it is simply ignored. Hence it stays alive in the browser until its cookie store is cleared. An attacker simply needs to directly issue another login scenario starting from step 3 in the above diagram, and end with an additional hidden request to https://saostatic.uber.com to steal the precious session cookie:\n{F202676}\nSo now an attacker has his/her hands on the victim's \"_csid\" shared session cookie for https://riders.uber.com, he/she can execute the normal login flow in their own browser and replace the issued \"_csid\" cookie value in step 9 of the first Uber SSO Login diagram to be logged in as the victim, right? Wrong. There's another countermeasure in place, namely a variant of login cross-site request forgery protection. This is the actual updated Uber SSO Login 2 diagram:\n{F202678}\nThe problem here are the GET param state=CSRFTOKEN and locally scoped state cookie that are added in step 3 by the Service Provider riders.uber.com and verified in step 11. Since we can't steal these values from the victim's browser, but only the \"_csid\" shared session cookie, this means game over, right?\nNo! An attacker can obtain a proper CSRFTOKEN value and accompanying state cookie value from https://riders.uber.com by starting a normal login scenario on their end (e.g. in their own browser or via a simple script). He/she can then relay the auth.uber.com URL to the victim's browser to get the \"_csid\" shared session cookie for these values, and inject these in his/her own browser login scenario again in step 9. In this manner, the victim effectively generates the \"_csid\" temporary session token for the attacker's login scenario in a separate browser, but this works flawlessly. This still allows exploitation and thus victim impersonation in the following manner (we still assume that the victim is already logged in to auth.uber.com and visits a webpage under control by the attacker, so we basically continue the flow from the above third and last diagram):\n{F202677}\nPoC\nIn the PoC below, the assumption is made that https://saostatic.uber.com is actually serving a valid certificate in the victim's browser, which currently is not the case (so there is currently no actual exposed risk). I figured you might not appreciate that.\nOpen the victim's browser & browse to https://riders.uber.com . After being redirected to https://auth.uber.com , login with the victim's credentials so you end up on https://riders.uber.com trips dashboard again.\nOpen a second browser tab in the victim's browser and browse to https://saostatic.uber.com/prepareuberattack.php . Accept any certificate warnings that you may receive here - again, we're only simulating that the domain has a valid SSL certificate. Once the page has finished loading you should see a URL, \"Cookie: \" string and a \"Set-Cookie: \" strings underneath each other. This is all info gathered under the hood by the attacker's webserver that is required to login as the victim now.\nOpen the separate attacker's browser and setup an intercepting proxy tool to intercept requests and responses. Browse to the URL displayed on the prepareuberattack.php page output and intercept this request. Now copy the \"Cookie: ...\" string displayed on prepareuberattack.php and paste it into the request headers.\nThe response should be a redirect to https://riders.uber.com/trips, indicating successful authentication bypass. Last but not least, copy all the \"Set-Cookie: \" lines from the prepareuberattack.php page output and paste them in the response before forwarding it to the browser. This ensures that the stolen cookies are properly injected in the attacker's browser.\nYou are now logged in as the victim in the attacker's browser\nIn a real attack scenario, an attacker would stealthily load https://saostatic.uber.com/prepareuberattack.php in the victim's browser, e.g. through an iframe. Likewise, he/she would probably not display the URL and all the cookies on the PHP page, but store this on the server-side, ready to be abused in a stealthy fashion.\nYou can see all these PoC steps executed in attachment \"8. Authentication Bypass PoC video.mp4\", where browser 1 and browser 2 had separate upstream servers and thus even other IP addresses to prove this is a plausible threat. The code of the https://saostatic.uber.com/prepareuberattack.php and https://saostatic.uber.com/uberattack.php pages is also attached (\"9. prepareuberattack.php\" and \"10. uberattack.php\"). This was written quick & dirty for PoC purposes - I know the code is pretty hacky.\nRecommendations\nThe recommendation for the subdomain takeover is straightforward: remove the dangling DNS CNAME pointer to Amazon CloudFront and the issue is resolved.\nThe recommendation for the generic Authentication Bypass issue is a bit more problematic. The fact that identities supplied to Service Providers by the Identity Provider are communicated via shared .uber.com cookies make them susceptible for all vulnerabilities that allows insight in cookies on any .uber.com subdomain. This includes remote code execution, subdomain takeover, debug logs, etc and has a very serious impact on Uber's overall security, even when the subdomain is hosted in a completely isolated environment. For example, all the mentioned out of scope .uber.com subdomains in the program's listing (bizblog.uber.com, newsroom.uber.com etc) have the inherent ability to bypass authentication of any Uber user, even though they might be remotely managed by an external party with lower security standards than Uber. Ironically enough, any service that wants to benefit from the current Uber SSO system will have to receive a .uber.com subdomain, as this is required by design. This in its turn increases the attack surface for abuse of the generic Authentication Bypass. On the short term I would recommend fixing the fact that the \"_csid\" cookie can remain alive in a browser once a user is already logged in (although Jack Whitton already showed that CSP could be abused to prevent a victim to make the request back to the Service Provider and invalidate the token, so I wouldn't put too much trust in that). On the mid-to-long term I would advise Uber to migrate to a real OAuth SSO system that communicates identity secrets and proofs by other means than shared cookies, e.g. GET parameters (OAuth \"code\" flow) or window.location.hash values (e.g. OAuth \"access tokens\" flow).\nLet me know if anything is unclear.\nCheers,\nArne Swinnen\nhttps://www.arneswinnen.net\n\n",
  "severity": [
    9.3,
    null
  ],
  "bounty": 5000,
  "weaknesses": [
    "Improper Authentication - Generic"
  ],
  "screenshots": {
    "image_0": "https://hackerone-us-west-2-production-attachments.s3.us-west-2.amazonaws.com/000/173/887/252c1a056dcd6551f8e0807c54394f7f8a2b10db/1._CloudFront_Error_Page_Indicating_Takeover_Susceptibility.png?response-content-disposition=attachment%3B%20filename%3D%221._CloudFront_Error_Page_Indicating_Takeover_Susceptibility.png%22%3B%20filename%2A%3DUTF-8%27%271._CloudFront_Error_Page_Indicating_Takeover_Susceptibility.png&response-content-type=image%2Fpng&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQGK6FURQ3DFQAWGF%2F20250326%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250326T204757Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjEMr%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQCsvafuVAVKSRt%2FiIpjpQ3xraYk7R%2FJd8pCn%2B8d5IOy4wIhAKeaC3APx1DOlKJy%2FzsK8wBV0XWYQ3h%2B3ehdvrkK5ioBKrIFCDIQAxoMMDEzNjE5Mjc0ODQ5Igzi4vmfUdCVFmq3rZEqjwV%2F2d9ktaDY7owDPS2uNxcA2siha97doy3ejVb91IeB1ESF6HdoTRh0%2BejXthv69ZiCs71EgtDQNRuf9EZH29mkqZYqhWatFAlyvHrJv5dq2RArBKRDXXnJo8fpzf9KodtZ08PmAjTe381hzGbll6SPyhXV80oF9f8EvJ1dMcK7yv%2BCObUY9PxcRWUF9hnEdV%2BiLq7hlUjnROpKjHjGQ66%2FtkR7poOb7shpRBSCbjOVBH5KyFrx804g%2Byu9PHPkDvGVbT5EnhA5hZgf%2B4%2Fyman1u%2BoSv76sADvgei615JrxAmRLKJpl9hKHqdW5ROcmGxYl056ircnla74fLG%2BiOSBYTERsRI%2FeXgdPVRmWe9heKD21gTf%2BieBOuilohfZx0kxp0jEbnXsSvHHl0KzXTWXMGrL4pxWvt5pCJsTbCC%2Bhj5EMsilZnOnYwfx%2BY3no1hJusZoIAYe9BsakPzGy8Uhhf5foUl%2F9wF98lvBS57LNcLjqFVe%2B5zVTqEaj4qbv%2BwV3ReGh4GEDpb0pxM%2FsC5oSUSCRLepiEetopB%2FrxvGieqUnk%2BgzGn7RW7JdllOR9ph2qtG6sm1oQBexr5TDYsqaaLP3BvYS42GNpGbdZehoLFRSigT2kIAtJT3XQNExUi5zvcqLbqYIp1FAqMU1TbD2%2FouvjDawrUHnn%2Ba7FmqtAqJQvlg8NcpjdO3fq9GKEMEpL1v%2BAOZ%2BdsEKEEE7yVdwiVWcHtb3dYgx%2BOvGy1Vp8U2gwB1qk3EZ7w14fccllCMkPWrvXUFhcVVC3Z31nfZCrPVO1Opq7UeZljMOCcsHHIr3OOYVkYu5WIB5QsLDEICyGZ7Ii9OC%2F0J%2F1P6MdAQchLv6GR20yhBMxYOWbPLdMJDukL8GOrABcCej%2Fo%2BPY11MZ%2Bt75kgzTqBcJHfz7Tysnd8V8mKKMXcp76LRgze%2B9z7OS5nrFrJXFKyf8pFHJ%2BQxB5I1ruRNrmBZ9KZgYNm3zggMrjIyJE%2FQkk9pzOA1Br%2F2Z2dmBNB%2FSDXdXvR50lg0U0TZoYMPe%2FRV9bXWQpaMwnzubBodLXLSpc%2Ft36JWp4MpNNO9SNqLVWSGNQuK609AKXE4KkWn7MH19IY6C9fbuKjfoqpKy1A%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=3e878b13611125a22e795da53c63dbc144f6518e0f4b31ebdae2e806602a421d",
    "image_1": "https://hackerone-us-west-2-production-attachments.s3.us-west-2.amazonaws.com/000/173/885/525ee26f7f8fd8a1078481fdc43538d0712d4e6e/2._AWS_CloudFront_Claiming_of_Subdomain.png?response-content-disposition=attachment%3B%20filename%3D%222._AWS_CloudFront_Claiming_of_Subdomain.png%22%3B%20filename%2A%3DUTF-8%27%272._AWS_CloudFront_Claiming_of_Subdomain.png&response-content-type=image%2Fpng&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQGK6FURQ3DFQAWGF%2F20250326%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250326T204757Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjEMr%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQCsvafuVAVKSRt%2FiIpjpQ3xraYk7R%2FJd8pCn%2B8d5IOy4wIhAKeaC3APx1DOlKJy%2FzsK8wBV0XWYQ3h%2B3ehdvrkK5ioBKrIFCDIQAxoMMDEzNjE5Mjc0ODQ5Igzi4vmfUdCVFmq3rZEqjwV%2F2d9ktaDY7owDPS2uNxcA2siha97doy3ejVb91IeB1ESF6HdoTRh0%2BejXthv69ZiCs71EgtDQNRuf9EZH29mkqZYqhWatFAlyvHrJv5dq2RArBKRDXXnJo8fpzf9KodtZ08PmAjTe381hzGbll6SPyhXV80oF9f8EvJ1dMcK7yv%2BCObUY9PxcRWUF9hnEdV%2BiLq7hlUjnROpKjHjGQ66%2FtkR7poOb7shpRBSCbjOVBH5KyFrx804g%2Byu9PHPkDvGVbT5EnhA5hZgf%2B4%2Fyman1u%2BoSv76sADvgei615JrxAmRLKJpl9hKHqdW5ROcmGxYl056ircnla74fLG%2BiOSBYTERsRI%2FeXgdPVRmWe9heKD21gTf%2BieBOuilohfZx0kxp0jEbnXsSvHHl0KzXTWXMGrL4pxWvt5pCJsTbCC%2Bhj5EMsilZnOnYwfx%2BY3no1hJusZoIAYe9BsakPzGy8Uhhf5foUl%2F9wF98lvBS57LNcLjqFVe%2B5zVTqEaj4qbv%2BwV3ReGh4GEDpb0pxM%2FsC5oSUSCRLepiEetopB%2FrxvGieqUnk%2BgzGn7RW7JdllOR9ph2qtG6sm1oQBexr5TDYsqaaLP3BvYS42GNpGbdZehoLFRSigT2kIAtJT3XQNExUi5zvcqLbqYIp1FAqMU1TbD2%2FouvjDawrUHnn%2Ba7FmqtAqJQvlg8NcpjdO3fq9GKEMEpL1v%2BAOZ%2BdsEKEEE7yVdwiVWcHtb3dYgx%2BOvGy1Vp8U2gwB1qk3EZ7w14fccllCMkPWrvXUFhcVVC3Z31nfZCrPVO1Opq7UeZljMOCcsHHIr3OOYVkYu5WIB5QsLDEICyGZ7Ii9OC%2F0J%2F1P6MdAQchLv6GR20yhBMxYOWbPLdMJDukL8GOrABcCej%2Fo%2BPY11MZ%2Bt75kgzTqBcJHfz7Tysnd8V8mKKMXcp76LRgze%2B9z7OS5nrFrJXFKyf8pFHJ%2BQxB5I1ruRNrmBZ9KZgYNm3zggMrjIyJE%2FQkk9pzOA1Br%2F2Z2dmBNB%2FSDXdXvR50lg0U0TZoYMPe%2FRV9bXWQpaMwnzubBodLXLSpc%2Ft36JWp4MpNNO9SNqLVWSGNQuK609AKXE4KkWn7MH19IY6C9fbuKjfoqpKy1A%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=b707094b3e83cc717173c8dbc84cfabffae4316d7fcc7edc3e2bb86846877f5e",
    "image_2": "https://hackerone-us-west-2-production-attachments.s3.us-west-2.amazonaws.com/000/173/884/d29f38689bdf5601a60efa4435bb6d9cecb59a66/3._Subdomain_Hijacked.png?response-content-disposition=attachment%3B%20filename%3D%223._Subdomain_Hijacked.png%22%3B%20filename%2A%3DUTF-8%27%273._Subdomain_Hijacked.png&response-content-type=image%2Fpng&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAQGK6FURQ3DFQAWGF%2F20250326%2Fus-west-2%2Fs3%2Faws4_request&X-Amz-Date=20250326T204757Z&X-Amz-Expires=3600&X-Amz-Security-Token=IQoJb3JpZ2luX2VjEMr%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEaCXVzLXdlc3QtMiJIMEYCIQCsvafuVAVKSRt%2FiIpjpQ3xraYk7R%2FJd8pCn%2B8d5IOy4wIhAKeaC3APx1DOlKJy%2FzsK8wBV0XWYQ3h%2B3ehdvrkK5ioBKrIFCDIQAxoMMDEzNjE5Mjc0ODQ5Igzi4vmfUdCVFmq3rZEqjwV%2F2d9ktaDY7owDPS2uNxcA2siha97doy3ejVb91IeB1ESF6HdoTRh0%2BejXthv69ZiCs71EgtDQNRuf9EZH29mkqZYqhWatFAlyvHrJv5dq2RArBKRDXXnJo8fpzf9KodtZ08PmAjTe381hzGbll6SPyhXV80oF9f8EvJ1dMcK7yv%2BCObUY9PxcRWUF9hnEdV%2BiLq7hlUjnROpKjHjGQ66%2FtkR7poOb7shpRBSCbjOVBH5KyFrx804g%2Byu9PHPkDvGVbT5EnhA5hZgf%2B4%2Fyman1u%2BoSv76sADvgei615JrxAmRLKJpl9hKHqdW5ROcmGxYl056ircnla74fLG%2BiOSBYTERsRI%2FeXgdPVRmWe9heKD21gTf%2BieBOuilohfZx0kxp0jEbnXsSvHHl0KzXTWXMGrL4pxWvt5pCJsTbCC%2Bhj5EMsilZnOnYwfx%2BY3no1hJusZoIAYe9BsakPzGy8Uhhf5foUl%2F9wF98lvBS57LNcLjqFVe%2B5zVTqEaj4qbv%2BwV3ReGh4GEDpb0pxM%2FsC5oSUSCRLepiEetopB%2FrxvGieqUnk%2BgzGn7RW7JdllOR9ph2qtG6sm1oQBexr5TDYsqaaLP3BvYS42GNpGbdZehoLFRSigT2kIAtJT3XQNExUi5zvcqLbqYIp1FAqMU1TbD2%2FouvjDawrUHnn%2Ba7FmqtAqJQvlg8NcpjdO3fq9GKEMEpL1v%2BAOZ%2BdsEKEEE7yVdwiVWcHtb3dYgx%2BOvGy1Vp8U2gwB1qk3EZ7w14fccllCMkPWrvXUFhcVVC3Z31nfZCrPVO1Opq7UeZljMOCcsHHIr3OOYVkYu5WIB5QsLDEICyGZ7Ii9OC%2F0J%2F1P6MdAQchLv6GR20yhBMxYOWbPLdMJDukL8GOrABcCej%2Fo%2BPY11MZ%2Bt75kgzTqBcJHfz7Tysnd8V8mKKMXcp76LRgze%2B9z7OS5nrFrJXFKyf8pFHJ%2BQxB5I1ruRNrmBZ9KZgYNm3zggMrjIyJE%2FQkk9pzOA1Br%2F2Z2dmBNB%2FSDXdXvR50lg0U0TZoYMPe%2FRV9bXWQpaMwnzubBodLXLSpc%2Ft36JWp4MpNNO9SNqLVWSGNQuK609AKXE4KkWn7MH19IY6C9fbuKjfoqpKy1A%3D&X-Amz-SignedHeaders=host&X-Amz-Signature=9447a4fa26393480b739f38364a451d6db08400747b54a8b85b5468fc59e2645"
  },
  "disclosed_date": 1499920980,
  "report_url": "https://hackerone.com/reports/219205",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Identify the subdomain saostatic.uber.com pointing to an unclaimed Amazon CloudFront CDN."
    ],
    [
      2,
      "Take over the subdomain by creating a new CloudFront endpoint and linking it to an attacker-controlled server."
    ],
    [
      3,
      "Exploit the shared session cookie mechanism on auth.uber.com to hijack a victim's session."
    ],
    [
      4,
      "Use the stolen session cookie to bypass authentication and impersonate the victim on Uber's SSO system."
    ]
  ],
  "vuln_description": "This vulnerability involves a chain of two issues: a subdomain takeover of saostatic.uber.com and an authentication bypass via shared session cookies in Uber's SSO system. The subdomain takeover allows an attacker to serve malicious content, while the shared session cookie mechanism enables session hijacking, leading to full authentication bypass.",
  "reason": "The attack requires understanding and exploiting multiple complex components: DNS misconfiguration, subdomain takeover, session cookie handling, and SSO authentication flows. The interaction between these components is subtle and non-obvious, requiring deep knowledge of web security mechanisms.",
  "new_complexity": "VERY_HIGH",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": "175070",
  "idor_detectable": false,
  "authnz_byppass_detectable": true,
  "is_simple_payload": false,
  "injection_metadata": {
    "is_simple_payload": false
  },
  "authnz_metadata": {
    "reason": "The vulnerability involves a chain of two issues: subdomain takeover and SSO session cookie leakage. The methodology described focuses on testing authorization boundaries within a single application by swapping user sessions and resource IDs. However, this report involves cross-domain issues (subdomain takeover affecting SSO cookies) and SSO design flaws, which are outside the scope of the described methodology. The methodology does not account for subdomain takeovers, cookie scoping issues, or SSO token handling across different domains.",
    "is_detectable": false
  }
}