{
    "reported_to": "Paragon Initiative Enterprises",
    "reported_by": "abdel-fattah-elsisi ",
    "title": "[Critical] billion dollars issue",
    "content": "\nHey,\nMy name is El-Sisi also i have famous name is بلحه (Balaha) and i have found documents that confirm you the github inc belong to you.\nif you need this documents give me reward and i will give u that documents.\nwhy i'm doing this because my mother tell me if you see some things like that you must\ndo some things and i did by submit this report.\ntrust me i have these documents\nMy achievement in this business(CV):My mother tell me the two islands Tiran and Sanafir not belong to egypt so i heard this words and i help egypt to sell Tiran and Sanafir islands to Saudi. just for 2 billion dollars\nhttp://www.al-monitor.com/pulse/originals/2017/06/egypt-tiran-sanafir-island-transfer-saudi-arabia-parliament.html\nThanks my mother without you we will not know this info.\nBest,\nBalaha\n\n",
    "severity": [
        9.0,
        10.0
    ],
    "bounty": null,
    "weaknesses": [
        "Man-in-the-Middle"
    ],
    "screenshots": {},
    "disclosed_date": 1498866540,
    "report_url": "https://hackerone.com/reports/244836",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "CODE",
    "steps": [
        [
            1,
            "Identify and locate the alleged documents that confirm GitHub Inc.'s ownership."
        ],
        [
            2,
            "Contact the reporter (El-Sisi/Balaha) to negotiate the reward in exchange for the documents."
        ]
    ],
    "vuln_description": "The report claims the existence of documents proving ownership of GitHub Inc. and requests a reward in exchange for these documents. The credibility and authenticity of the claim are highly questionable, and the report lacks technical details or evidence of a vulnerability.",
    "reason": "The report does not describe a technical vulnerability or exploit. It appears to be a scam or social engineering attempt rather than a legitimate security issue. There are no complex components, interactions, or novel logic involved.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}