{
    "reported_to": "Grab",
    "reported_by": "linkks ",
    "title": "Git repository found",
    "content": "\nGit metadata directory (.git) was found in this folder. An attacker can extract sensitive information by requesting the hidden metadata directory that version control tool Git creates. The metadata directories are used for development purposes to keep track of development changes to a set of source code before it is committed back to a central repository (and vice-versa). When code is rolled to a live server from a repository, it is supposed to be done as an export rather than as a local working copy, and hence this problem.\nRepository files/directories:\n.gitignore\nREADME.md\nansible/Vagrantfile\nansible/development\nansible/host_vars/development\nansible/host_vars/production\nansible/production\nansible/provision.yml\nansible/roles/common/files/id_rsa\nansible/roles/common/tasks/main.yml\nGET /wp-content/themes/.git/config HTTP/1.1\nHost: 54.255.134.3:443\nConnection: Keep-alive\nAccept-Encoding: gzip,deflate\nUser-Agent: Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.21 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.21\nAccept: /\nThese files may expose sensitive information that may help an malicious user to prepare more advanced attacks.\nRemove these files from production systems or restrict access to the .git directory. To deny access to all the .git folders you need to add the following lines in the appropriate context (either global config, or vhost/directory, or from .htaccess):\n<Directory ~ \".git\">\nOrder allow,deny\nDeny from all\n</Directory>\n\n",
    "severity": [
        7.5,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "Information Disclosure"
    ],
    "screenshots": {},
    "disclosed_date": 1502664900,
    "report_url": "https://hackerone.com/reports/248693",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Identify the presence of a .git directory in the web server's accessible paths by checking common locations or using automated tools."
        ],
        [
            2,
            "Access the .git directory and its contents (e.g., config, index, logs, objects) to extract sensitive information such as credentials, internal paths, or source code."
        ]
    ],
    "vuln_description": "The vulnerability involves the exposure of a Git metadata directory (.git) on a production server, which can be accessed by an attacker to extract sensitive information such as source code, configuration files, and credentials. This occurs when the deployment process includes the .git directory instead of exporting the code cleanly.",
    "reason": "The discovery difficulty is low because the presence of a .git directory is a well-known issue and can be easily detected using automated tools or manual checks. The attack does not involve complex interactions or states, and the methodology is straightforward once the directory is found.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}