{
    "reported_to": "MacTaggart Scott",
    "reported_by": "goedix ",
    "title": "Overwrite any file of the web server",
    "content": "\nSummary:\nWith this vulnerability an attacker can override all the files from the server due to a vulnerable module used to generate █████████s\nSteps To Reproduce:\nGo to ██████████ to check the actual payload (Save ███████ to:) to do it (███████goedix.php -> This will create a file in /██████_h1goedix.php but this can be edited to index.php and replacing any php file in the server or outside the web server) █████\nGo to ███████ to start the job that creates the ███ in the target filepath\nGo to https://██████████_h1goedix.php or the targeted file and check that it returns an empty page! ██████████\nAs note, if you want to do any action in /█████████ you must modify with burp the request from /█████████/index.php to /██████████, otherwises it won't work!\nImpact\nAn attacker can replace all the server files with empty pages! (I was finding to achieve RCE but I was not able to do it (I did tests injecting php code into the php files but it returns 500 internal server error)\n\n",
    "severity": [
        9.1,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "File Manipulation"
    ],
    "screenshots": {},
    "disclosed_date": 1730801460,
    "report_url": "https://hackerone.com/reports/2733190",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Access the vulnerable module used to generate files on the web server."
        ],
        [
            2,
            "Modify the payload to target a specific file (e.g., index.php) and overwrite it with an empty page."
        ]
    ],
    "vuln_description": "The vulnerability allows an attacker to overwrite any file on the web server due to a flaw in a module used for file generation. This can lead to denial of service by replacing critical files with empty content.",
    "reason": "The attack involves identifying and exploiting a vulnerable module, but the steps to reproduce are straightforward once the module is known. The complexity is reduced because the interaction between components is minimal and the attack does not require manipulating complex application states or novel logic.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}