{
    "reported_to": "Drugs.com",
    "reported_by": "duk3_ ",
    "title": "2FA Bypass leads to  impersonation of legimate users",
    "content": "\nSummary:\nHello team,\nI have discovered a logic flaw in the authentication system that allows an attacker (User A) to impersonate a legitimate user (User B) who has not yet registered. By abusing the email change functionality and bypassing 2FA, the attacker can retain access to the account until the legitimate user resets their password.\nSteps to re-produce\nGo to https://www.drugs.com/account/register/ and create an account using an email you own.\n██████\nComplete OTP verification and select \"Trust this device for 1 month\". This gives you a valid session that does not require 2FA for one month.\nGo to https://www.drugs.com/account/details/ and change the email to the victim's email (User B)\nNow, the attacker has a valid session associated with User B's email for one month, bypassing 2FA.\nNow, the attacker has a valid session associated with User B's email for one month, bypassing 2FA.\n███\nLog out and log back in to confirm that the application doesn't prompt for OTP.\nTo maintain this bypass indefinitely (until the original user resets the password):\nChange the email back to the attacker's email.\nRe-verify the new email by completing OTP verification and selecting \"Trust this device for 1 month\".\nChange the email back to the victim's email (or any other arbitrary email).\nBy repeating this process, the attacker can retain access without triggering 2FA.\nNote that the platform only notifying the attacker to activate the account , but not Terminating the session after the email has changed successfully\nFrom victim POV\nGo to Sign Up page\ntry to Sign up with the victim's email\nNote that the platform says that email's already used (while the original Owner of the email didn't create the account)\n███████\nImpact\nSummary:\nLoss of Trust: Users will lose confidence in the platform's security if they learn attackers had impersonated them.\nImpersonation Risk: Attackers can impersonate legitimate users and interact with the platform.\nEmail Ownership Not Protected: The platform fails to verify the original owner of the email, allowing attackers to use it.\n\n",
    "severity": [
        7.5,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "Improper Authentication - Generic"
    ],
    "screenshots": {},
    "disclosed_date": 1741980600,
    "report_url": "https://hackerone.com/reports/2885636",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Go to https://www.drugs.com/account/register/ and create an account using an email you own."
        ],
        [
            2,
            "Complete OTP verification and select 'Trust this device for 1 month' to get a valid session."
        ],
        [
            3,
            "Go to https://www.drugs.com/account/details/ and change the email to the victim's email (User B)."
        ],
        [
            4,
            "Log out and log back in to confirm that the application doesn't prompt for OTP."
        ],
        [
            5,
            "To maintain this bypass indefinitely, change the email back to the attacker's email, re-verify with OTP, and then change it back to the victim's email."
        ]
    ],
    "vuln_description": "A logic flaw in the authentication system allows an attacker to impersonate a legitimate user who has not yet registered by abusing the email change functionality and bypassing 2FA. The attacker can retain access to the account until the legitimate user resets their password.",
    "reason": "The vulnerability involves multiple components (account creation, 2FA bypass, email change) and requires understanding subtle interactions between these components, such as session persistence after email changes and the lack of proper email ownership verification.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null,
    "idor_detectable": false,
    "authnz_byppass_detectable": true,
    "is_simple_payload": false,
    "injection_metadata": {
        "is_simple_payload": false
    },
    "authnz_metadata": {
        "idor_detectable": false,
        "authnz_byppass_detectable": true
    }
}