{
    "reported_to": "Uber",
    "reported_by": "gregoryvperry ",
    "title": "The Uber Promo Customer Endpoint Does Not Implement Multifactor Authentication, Blacklisting or Rate Limiting",
    "content": "\nSummary\nThe https://cn-sjc1.uber.com/rt/users/apply-clients-promotions customer endpoint used to apply Uber promotions does not implement multifactor authentication, IP address blacklisting for multiple failed attempts, or IP address-based rate limiting to prevent brute force bearer token enumeration.\nSecurity Impact\nIssued x-uber-tokens are able to be enumerated at rates only limited by an attacker's available bandwidth.\nReproduction Steps\nA massively parallel Golang application was configured to spawn thousands of concurrent HTTP request workers, each with a PRNG-derived token. Unlike other endpoints within the Uber architecture, https://cn-sjc1.uber.com/rt/users/apply-clients-promotions only requires an x-uber-token and promo code to assess whether the token and/or promo code is valid. By using a valid promo code in conjunction with a randomly-derived x-uber-token, more than a million brute force attempts at enumerating valid bearer tokens was able to be accomplished in a matter of minutes, without any type of IP address blacklisting or rate limiting controls preventing the attack.\nSpecifics\nNo account was needed for this brute force enumeration attack against the https://cn-sjc1.uber.com/rt/users/apply-clients-promotions customer endpoint, only a valid promo code\nImpact\nAn attacker with sufficient bandwidth could enumerate valid x-uber-tokens at high rates of speed, in turn resulting in compromise of privileged account information and hijacking of user sessions associated with those x-uber-tokens.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Improper Restriction of Authentication Attempts"
    ],
    "screenshots": {},
    "disclosed_date": 1514164800,
    "report_url": "https://hackerone.com/reports/293359",
    "is_multi_component": false,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "API",
    "steps": [
        [
            1,
            "Configure a massively parallel Golang application to spawn thousands of concurrent HTTP request workers, each with a PRNG-derived token."
        ],
        [
            2,
            "Use a valid promo code in conjunction with randomly-derived x-uber-tokens to brute force enumerate valid bearer tokens via the endpoint https://cn-sjc1.uber.com/rt/users/apply-clients-promotions."
        ]
    ],
    "vuln_description": "The Uber promo customer endpoint lacks multifactor authentication, IP blacklisting, and rate limiting, allowing brute force enumeration of valid x-uber-tokens at high speed, leading to potential account compromise and session hijacking.",
    "reason": "The attack involves straightforward brute force techniques without the need for complex interactions or state manipulations. The vulnerability is primarily due to missing security controls rather than intricate logic or novel attack vectors.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}