{
    "reported_to": "Tor",
    "reported_by": "qab ",
    "title": "De-anonymization by visiting specially crafted bookmark.",
    "content": "\nThere is a way to import logs in 'about:memory' from local disk, however, (tested on windows) you can pass a network url that may point to attack controlled server which logs IP's. This connection is done by windows (presumably) and so doesn't hide real IP of Tor user.\nHave victim drag and drop an anchor tag pointing to 'about:memory?file=\\localhost\\q.json.gz' inside bookmarks bar.\nVictim then clicks on bookmark to visit URL.\nAn unproxied connection is made to 'localhost'\nImpact\nDe-anonymization. If coupled with a bug to open privileged pages (which about:memory is) one could theoretically achieve a very dangerous exploit to expose real ips of victims.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Information Disclosure"
    ],
    "screenshots": {},
    "disclosed_date": 1530606900,
    "report_url": "https://hackerone.com/reports/294364",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "HIGH",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Create a bookmark with an anchor tag pointing to 'about:memory?file=\\\\localhost\\q.json.gz'."
        ],
        [
            2,
            "Have the victim drag and drop the bookmark into their bookmarks bar and click on it."
        ]
    ],
    "vuln_description": "The vulnerability allows an attacker to de-anonymize a Tor user by exploiting the 'about:memory' page's ability to import logs from a network URL. When the victim clicks on a specially crafted bookmark, an unproxied connection is made to the attacker's server, revealing the victim's real IP address.",
    "reason": "The attack involves understanding the interaction between the 'about:memory' page and network URLs, as well as the behavior of Tor when handling such requests. The attack requires the victim to perform a specific action (dragging and dropping a bookmark), which adds to the complexity.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}