{
    "reported_to": "Internet Bug Bounty",
    "reported_by": "pwnsdx ",
    "title": "Mailsploit: a sender spoofing bug in over 30 email clients",
    "content": "\nMailsploit is a collection of bugs in email clients that allow effective sender spoofing and code injection attacks. The spoofing is not detected by Mail Transfer Agents (MTA) aka email servers, therefore circumventing spoofing protection mechanisms such as DMARC (DKIM/SPF) or spam filters.\nBugs were found in over 30 applications, including prominent ones like Apple Mail (macOS, iOS and watchOS), Mozilla Thunderbird, various Microsoft email clients, Yahoo! Mail, ProtonMail and others.\nIn addition to the spoofing vulnerability, some of the tested applications also proved to be vulnerable to XSS and code injection attacks.\nMore informations are available on mailsploit.com\nImpact\nIt allows the attacker to display an arbitrary sender email address to the email recipient while bypassing spoofing protection mechanisms such as DMARC (DKIM/SPF) or spam filters.\n\n",
    "severity": [
        7.4,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "User Interface (UI) Misrepresentation of Critical Information"
    ],
    "screenshots": {},
    "disclosed_date": 1568939640,
    "report_url": "https://hackerone.com/reports/295339",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "HIGH",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Identify an email client from the list of vulnerable applications (e.g., Apple Mail, Mozilla Thunderbird, Microsoft email clients, Yahoo! Mail, ProtonMail, etc.)."
        ],
        [
            2,
            "Craft an email with a spoofed sender address by manipulating the email headers or content in a way that bypasses DMARC (DKIM/SPF) and spam filters."
        ],
        [
            3,
            "Send the crafted email to a target recipient using the vulnerable email client."
        ],
        [
            4,
            "Observe that the recipient sees the spoofed sender address without any warnings or detection by the email client or server."
        ]
    ],
    "vuln_description": "Mailsploit is a collection of bugs in email clients that allow effective sender spoofing and code injection attacks. The spoofing is not detected by Mail Transfer Agents (MTA), thereby bypassing spoofing protection mechanisms like DMARC (DKIM/SPF) or spam filters. Some clients are also vulnerable to XSS and code injection attacks.",
    "reason": "The vulnerability involves understanding email header manipulation and the interaction between email clients and MTAs. While the attack itself is straightforward once the manipulation method is known, discovering the exact header or content manipulation that bypasses protections requires testing multiple email clients and understanding their parsing quirks.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}