{
    "reported_to": "Uber",
    "reported_by": "gregoryvperry ",
    "title": "udi-id Query Parameter Can Generate SSL-protected Reflected XSS in https://m.uber.com/0-dfffb25d2cf6ceeb0a27.js Endpoint",
    "content": "\nSummary\nThe udi-id request parameter at the https://m.uber.com/0-dfffb25d2cf6ceeb0a27.js mobile endpoint is copied into a javascript string encapsulated in double quotation marks, resulting in SSL-protected payloads being reflected unmodified in the application's response. The script-src whitelist at the endpoint includes a wildcard *.cloudfront.net host, which could be used by any attacker with an Amazon Web Services account to provision an arbitrary cloudfront.net host to serve trusted files from. The endpoint also has a missing base-uri, which allows the injection of base tags. They can be used to set the base URL for all relative (script) URLs to an attacker controlled domain. In addition to the reflected XSS issue, both the script-src and basi-uri issues are considered high severity findings under Content Security Policy 3.\nSecurity Impact\nUsing the udi-id query variable, arbitrary SSL-protected XSS can be reflected unescaped from the https://m.uber.com/0-dfffb25d2cf6ceeb0a27.js mobile endpoint, resulting in the ability for an attacker to generate arbitrary javascript and/or html content.\nReproduction Steps\nhttps://m.uber.com/0-dfffb25d2cf6ceeb0a27.js?udi-id=\"%7D}</script><div%20class%3D%27_b%20_c%20_d%20_e%20_f%20_g%20_h%20_i%20_a3%20_a4%20_a5%20_a6%20_a7%20_a8%20_a9%20_aa%20_ab%20_ac%20_ad%20_ae%20_af%20_ag%20_ah%20_ai%20_aj%20_ak%20_al%20_am%20_an%20_ao%20_ap%20_aq%20_ar%20_as%20_at%20_au%20_av%20_aw%27><a%20href%3D\"http%3A%2F%2Fwww.lyft.com\">Some%20arbitrary%20link%20text<%2Fa><%2Fdiv>%0A\nImpact\nWith a properly crafted javascript and/or html page, an attacker could harvest Uber login and password credentials, credit card payment information etc.\n\n",
    "severity": [
        9.1,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "Cross-site Scripting (XSS) - Reflected"
    ],
    "screenshots": {},
    "disclosed_date": 1514304240,
    "report_url": "https://hackerone.com/reports/300103",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Navigate to the vulnerable endpoint: https://m.uber.com/0-dfffb25d2cf6ceeb0a27.js?udi-id=PAYLOAD"
        ],
        [
            2,
            "Inject a malicious payload into the udi-id parameter that breaks out of the JavaScript string context and injects arbitrary HTML/JS (e.g., udi-id=\\\"}</script><div>Malicious Content</div>\\\")"
        ]
    ],
    "vuln_description": "The udi-id parameter in the specified Uber endpoint is vulnerable to reflected XSS due to improper input sanitization. The payload is reflected unmodified in the response, allowing execution of arbitrary JavaScript in the context of the Uber domain. Additionally, the CSP policy is insufficient as it allows wildcard *.cloudfront.net sources and lacks a base-uri directive, enabling further exploitation vectors.",
    "reason": "The vulnerability requires understanding of: 1) XSS payload construction that breaks JS string context, 2) CSP bypass techniques using allowed domains, and 3) base tag injection impacts. While each component is well-documented in security literature, combining them for effective exploitation requires careful coordination.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null,
    "authnz_metadata": {
        "reason": "The vulnerability involves a reflected XSS issue via the 'udi-id' query parameter in a specific endpoint, which is not directly related to authentication or authorization bypass. The methodology described focuses on testing AuthN/AuthZ boundaries by swapping user sessions or resource IDs, which does not apply to XSS vulnerabilities.",
        "is_detectable": false
    }
}