{
    "reported_to": "Ping Identity",
    "reported_by": "rijalrojan ",
    "title": "CSRF in Inviting users",
    "content": "\nNOTE! Thanks for submitting a report! Please replace all the [square] sections below with the pertinent details. Remember, the more detail you provide, the easier it is for us to triage and respond quickly, so be sure to take your time filling out the report!\nSummary: [add summary of the vulnerability]\nWhen a user is invited, a GET request is made. This can be used with a CSRF attack.\nDescription: [add more details about this vulnerability]\nUser invitations usually should be done through a POST request. In this case the app uses a GET request. For example: https://ort-admin.pingone.com/web-portal/ajax/user/directory/inviteuser/?alternate_email=rojan@netsecurity.tech&email=rojan@securifyinc.com\nWhich allows inviting another user easily.\nSteps To Reproduce:\n(Add details for how we can reproduce the issue)\nDownload the attached html.\nOpen it in a logged in browser.\nIt should invite my email to the website. ## Supporting Material/References:\nList any additional material (e.g. screenshots, logs, etc.)\nImpact\nAdding other users easily. Gives internal access.\nThe hacker selected the Cross-Site Request Forgery (CSRF) weakness. This vulnerability type requires contextual information from the hacker. They provided the following answers:\nURL\nhttps://ort-admin.pingone.com/web-portal/usermanagement#/\nVerified\nYes\nCan a victim be forced to perform a sensitive state-change operation unknowningly?\nYes\nWhat state-change operation can be performed?\nAdding users.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Cross-Site Request Forgery (CSRF)"
    ],
    "screenshots": {},
    "disclosed_date": 1553647260,
    "report_url": "https://hackerone.com/reports/323975",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Download the attached HTML file containing the CSRF exploit."
        ],
        [
            2,
            "Open the HTML file in a browser where the user is already logged into the vulnerable application."
        ]
    ],
    "vuln_description": "The vulnerability is a Cross-Site Request Forgery (CSRF) issue where user invitations are handled via a GET request instead of a POST request. This allows an attacker to craft a malicious HTML page that, when opened by a logged-in user, automatically sends a GET request to invite a new user without their knowledge or consent.",
    "reason": "The vulnerability is straightforward to discover as it involves a simple GET request for a sensitive action (user invitation) which is a well-known anti-pattern in web security. The attack does not require complex interactions or understanding of subtle application logic.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}