{
    "reported_to": "Valve",
    "reported_by": "chippy ",
    "title": "Malformed Skybox .TGA in Half-Life (GoldSRC) leads to Access Violation",
    "content": "\nA malformed .TGA when loaded as a Skybox on a map in a GoldSRC engine game (Half-Life) can lead to arbitrary code execution on a remote client.\nReproduction Steps\nLoad the attached map + resources on a local Half-Life listen server. The game will crash with an Access Violation as soon as the map with the malicious skybox is loaded.\nExploitability\nSince anyone can host a map with custom assets, and the custom assets are loaded onto a remote clients computer, a malicious server can distribute malformed skybox assets (.TGA's) that could cause remote code execution on clients. The inclusion of .DLL's on Steam without ASLR make exploitablility of this bug via ROP quite trivial.\nImpact\nImpact\nA malicious server could infect hundreds or perhaps thousands of clients with this bug. This bug could also be used in targeted attacks for the theft / compromise of high-value Steam accounts by attacking their Half-Life client.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Classic Buffer Overflow"
    ],
    "screenshots": {},
    "disclosed_date": 1535513820,
    "report_url": "https://hackerone.com/reports/351016",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "MEDIUM",
    "vuln_category": "CODE",
    "steps": [
        [
            1,
            "Load a maliciously crafted .TGA file as a skybox in a custom map for Half-Life (GoldSRC engine)"
        ],
        [
            2,
            "Host the map on a server and have clients connect to it"
        ]
    ],
    "vuln_description": "A malformed .TGA file used as a skybox in Half-Life (GoldSRC) can cause an access violation leading to arbitrary code execution on remote clients when they load the map. This is exploitable because custom assets are automatically downloaded and processed by clients connecting to a server.",
    "reason": "The vulnerability requires understanding of both the TGA file format and how the GoldSRC engine processes skybox textures. The interaction between the malformed file and the engine's memory handling is non-obvious, and the attack involves manipulating the engine into an exploitable state through a specific asset type.",
    "new_complexity": "HIGH",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}