{
    "reported_to": "Semmle",
    "reported_by": "flamezzz ",
    "title": "DOMXSS in redirect param",
    "content": "\nSummary\nThe redirect param can consist of a javascript: url, which results in XSS. If a victim visits a malicious URL and logs in, the attacker can perform actions on behalf of the victim.\nSteps to reproduce\n1) Logout\n2) Visit https://lgtm-com.pentesting.semmle.net/?redirect=javascript:prompt(document.domain)%2f%2f\n3) Log in through email\nImpact\nIf a victim visits a malicious URL and logs in, the attacker can perform actions on behalf of the victim.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Cross-site Scripting (XSS) - DOM"
    ],
    "screenshots": {},
    "disclosed_date": 1553099640,
    "report_url": "https://hackerone.com/reports/361287",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Logout from the application"
        ],
        [
            2,
            "Visit the URL: https://lgtm-com.pentesting.semmle.net/?redirect=javascript:prompt(document.domain)%2f%2f"
        ],
        [
            3,
            "Log in through email"
        ]
    ],
    "vuln_description": "The redirect parameter in the URL can be manipulated to include a JavaScript URL, leading to DOM-based XSS. When a victim visits a maliciously crafted URL and logs in, the attacker can execute arbitrary JavaScript in the context of the victim's session, potentially performing actions on their behalf.",
    "reason": "The vulnerability involves a straightforward manipulation of a URL parameter to inject JavaScript, which is a common and well-documented attack vector. The steps to reproduce are simple and do not require complex interactions or understanding of intricate application states.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null,
    "injection_metadata": {
        "is_simple_payload": true
    },
    "authnz_metadata": {
        "reason": "The DOMXSS vulnerability involves a redirect parameter that can execute JavaScript when a user logs in. This falls under the AuthZ bypass category where an unauthenticated or regular user can perform actions (XSS in this case) that should be restricted. The methodology covers AuthZ bypass by testing actions with different user sessions and unauthenticated sessions, which would include testing redirect parameters with malicious JavaScript payloads.",
        "is_detectable": true
    }
}