{
    "reported_to": "Ford",
    "reported_by": "march ",
    "title": "Subdomain takeover on usclsapipma.cv.ford.com",
    "content": "\nHello Ford H1 team,\nI want to report a Subdomain takeover vulnerability in this report, a pretty serious security issue in some context.\nOverview:\nOne of the ford.com subdomains is pointing to Azure, which has unclaimed CNAME record. ANYONE is able to own ford.com subdomain at the moment.\nThis vulnerability is called subdomain takeover. You can read more about it here:\nhttps://blog.sweepatic.com/subdomain-takeover-principles/\nhttps://labs.detectify.com/tag/hostile-subdomain-takeover/\nhttps://hackerone.com/reports/325336\nDetails:\nusclsapipma.cv.ford.com has CNAME usclsapipma.trafficmanager.net wich has a CNAME to feuscspma3fcvapi.eastus.cloudapp.azure.com. However, feuscspma3fcvapi.eastus.cloudapp.azure.com is not registered in Azure cloudapp Virtual machine anymore and thus can be registered as FQDN for a easus VM by anyone. After registering the Cloud App Virtual Machine in Azure portal, the person doing so has full control over traffic on dynatraceppeast01.cf.ford.com (so, not only HTTP/HTTPS but also mails traffic, etc, since we have full control over the virtual machine and it's OS).\nMitigation:\nRemove the CNAME record from ford.com DNS zone completely.\nOR\nClaim it back in Azure portal\nFiles :\nAzure-check-availability.png -> Screenshot of the Azure website api \"check availability\" for the \"eastus\" cloudapp virtual machine. on the link, you can see the location \"eastus\" part of the fqdn ad the DomainNameLabel \"feuscspma3fcvapi\" part of the FQDN, and the \"available : true\" response for this fqdn.\ndns-proof.png -> Result of a \"dig\" command for this domains, showing the \"NXDOMAIN\" reponse for the CNAME entry of the ford subdomain.\nCheers,\nMarch_42\nImpact\nSubdomain takeover can be abused to do several things like :\nMalware distribution\nPhishing / Spear phishing\nXSS\nAuthentication bypass\nLegitimate mail sending and receiving on behalf of ford subdomain\n...\nList goes on and on.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Privilege Escalation"
    ],
    "screenshots": {},
    "disclosed_date": 1553484360,
    "report_url": "https://hackerone.com/reports/484420",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "API",
    "steps": [
        [
            1,
            "Identify the subdomain usclsapipma.cv.ford.com and check its DNS records using a tool like dig or nslookup."
        ],
        [
            2,
            "Verify that the CNAME record points to an unclaimed Azure resource by checking the availability of feuscspma3fcvapi.eastus.cloudapp.azure.com in the Azure portal."
        ]
    ],
    "vuln_description": "The subdomain usclsapipma.cv.ford.com has a CNAME record pointing to an unclaimed Azure resource (feuscspma3fcvapi.eastus.cloudapp.azure.com). Since the Azure resource is not claimed, an attacker can register it and gain control over the subdomain, leading to potential malicious activities such as malware distribution, phishing, and unauthorized email operations.",
    "reason": "The vulnerability involves checking DNS records and verifying the availability of an Azure resource, which are straightforward steps. The interaction between the DNS configuration and Azure resource availability is not subtle or complex.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": "325336",
    "idor_detectable": false,
    "authnz_byppass_detectable": false,
    "is_simple_payload": false,
    "injection_metadata": {
        "is_simple_payload": true
    },
    "authnz_metadata": {
        "idor_detectable": false,
        "authnz_byppass_detectable": false
    }
}