{
    "reported_to": "Phabricator",
    "reported_by": "saidul_khan ",
    "title": "Issue:Form does not contain an anti-CSRF token",
    "content": "\n=============================\n#Form does not contain an anti-CSRF token\n\nThere are 15 instances of this issue ==>\n/\n/Z1336\n/applications/\n/auth/start/\n/auth/start/\n/book/phabricator/article/installation_guide/\n/dashboard/\n/dashboard/arrange/8/\n/differential/\n/diffusion/\n/diffusion/commit/\n/diffusion/commit/query/E1D1uHPOvfuP/\n/feed/query/all/\n/home/menu/view/245/\n/maniphest/\n\nIssue Details ==>\nCross-site Request Forgery (CSRF) is an attack which forces an end user to execute unwanted actions on a web application to which he/she is currently authenticated. With a little help of social engineering (like sending a link via email / chat), an attacker may trick the users of a web application into executing actions of the attacker's choosing. A successful CSRF exploit can compromise end user data and may allow an attacker to perform an account hijack. If the targeted end user is the administrator account, this can compromise the entire web application.\nIssue remediation ==>\nThe application should implement anti-CSRF tokens into all requests that perform actions which change the application state or which add/modify/delete content. An anti-CSRF token should be a long randomly generated value unique to each user so that attackers cannot easily brute-force it.\nIt is important that anti-CSRF tokens are validated when user requests are handled by the application. The application should both verify that the token exists in the request, and also check that it matches the user's current token. If either of these checks fails, the application should reject the request.\nImpact\nCross-site Request Forgery (CSRF) is an attack which forces an end user to execute unwanted actions on a web application to which he/she is currently authenticated. With a little help of social engineering (like sending a link via email / chat), an attacker may trick the users of a web application into executing actions of the attacker's choosing. A successful CSRF exploit can compromise end user data and may allow an attacker to perform an account hijack. If the targeted end user is the administrator account, this can compromise the entire web application.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Cross-Site Request Forgery (CSRF)"
    ],
    "screenshots": {},
    "disclosed_date": 1553275320,
    "report_url": "https://hackerone.com/reports/513134",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Identify forms in the application that perform state-changing actions (e.g., login, data modification)"
        ],
        [
            2,
            "Inspect the form source code or network requests to check for the presence of anti-CSRF tokens"
        ]
    ],
    "vuln_description": "The application lacks anti-CSRF tokens in multiple forms, making it vulnerable to Cross-Site Request Forgery (CSRF) attacks. This allows attackers to trick authenticated users into performing unintended actions by forging malicious requests.",
    "reason": "The vulnerability is straightforward to discover as it only requires inspecting form submissions for missing anti-CSRF tokens, a common and well-documented security practice. No complex interactions or novel logic is involved.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}