{
    "reported_to": "GitLab",
    "reported_by": "rioncool22 ",
    "title": "Stored XSS in \"Create Groups\"",
    "content": "\nNOTE! Thanks for submitting a report! Please replace all the (parenthesized) sections below with the pertinent details. Remember, the more detail you provide, the easier it is for us to triage and respond quickly, so be sure to take your time filling out the report!\nSummary\nStored attacks are those where the injected script is permanently stored on the target servers, such as in a database, in a message forum, visitor log, comment field, etc. The victim then retrieves the malicious script from the server when it requests the stored information. Stored XSS is also sometimes referred to as Persistent or Type-I XSS.\nSteps to reproduce\nLogin to Gitlab\nCreate a new group with xss payload payload i use = \"><img src=x onerror=prompt(123)>\nOpen Group\nTo trigger XSS you can click \"NEW PROJECT\"\nXSS Trigger\nImpact\nCan steal Cookie, Can run javascript code, etc\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": 2500,
    "weaknesses": [
        "Cross-site Scripting (XSS) - Stored"
    ],
    "screenshots": {},
    "disclosed_date": 1598465700,
    "report_url": "https://hackerone.com/reports/647130",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Login to Gitlab"
        ],
        [
            2,
            "Create a new group with XSS payload: \"><img src=x onerror=prompt(123)>"
        ],
        [
            3,
            "Open the newly created group"
        ],
        [
            4,
            "Click 'NEW PROJECT' to trigger the XSS"
        ]
    ],
    "vuln_description": "Stored XSS vulnerability in the 'Create Groups' feature of GitLab, where malicious JavaScript code is permanently stored and executed when a victim interacts with the affected group (e.g., by clicking 'NEW PROJECT'). This can lead to cookie theft, session hijacking, or arbitrary JavaScript execution.",
    "reason": "The vulnerability requires only basic XSS knowledge and straightforward steps to reproduce (input a standard XSS payload in a group name field). No complex application states or multi-component interactions are involved.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null,
    "authnz_metadata": {
        "reason": "The XSS vulnerability involves injecting a script into a stored field (group name) which is then executed when a user interacts with the group (e.g., clicking 'NEW PROJECT'). This does not involve authentication or authorization bypass, nor does it involve IDOR. The methodology described focuses on AuthN/AuthZ and IDOR vulnerabilities by testing session swapping and resource ID substitution, which are not relevant to detecting stored XSS.",
        "is_detectable": false
    }
}