{
    "reported_to": "U.S. Dept Of Defense",
    "reported_by": "gnarlygoat ",
    "title": "Publicly accessible Grafana install allows pivoting to Prometheus datasource",
    "content": "\nSummary:\nA publicly accessible Grafana install exposes semi sensitive Dashboards. This also exposes the Prometheus proxied datasources which allow direct queries to a Prometheus instance which reveals sensitive data an opens the instance up to potential DoS via crafted requests.\nDescription:\nImpact\nMedium-Low\nStep-by-step Reproduction Instructions\nGrafana instance - https://████████/stats/\nExample semi sensitive dashboard: https://████████/stats/d/███/\nThis dashboard reveals an unrestricted Prometheus proxy API at https://███/stats/api/datasources/proxy/1/api/v1/\nThis API can be queried in many ways to include resource intensive queries which could result in a DoS. An example of exposed datasets:\nhttps://██████/stats/api/datasources/proxy/1/api/v1/label/name/values. A query crafted to require high resource usage would result in a denial of service.\nThis can reveal much more sensitive data as well such as internal ip addresess assigned to interfaces https://████/stats/api/datasources/proxy/1/api/v1/query?query=node_network_address_assign_type\nor\ncurl -s 'https://██████/stats/api/datasources/proxy/1/api/v1/query?query=node_network_address_assign_type' | python2 -c \"import sys, json; print json.load(sys.stdin)['data']['result'][0]\"\n(Ip addresses are in decimal)\nProduct, Version, and Configuration (If applicable)\nGrafana v6.4.4\n## Suggested Mitigation/Remediation Actions\nImplement controls to disallow public access\nImpact\nDenial of Service\nUtilize exposed network and device data for network reconnaissance\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Information Disclosure"
    ],
    "screenshots": {},
    "disclosed_date": 1589490660,
    "report_url": "https://hackerone.com/reports/764731",
    "is_multi_component": true,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Access the publicly available Grafana instance at https://████████/stats/"
        ],
        [
            2,
            "Navigate to the Prometheus proxied datasource API endpoint at https://███/stats/api/datasources/proxy/1/api/v1/"
        ],
        [
            3,
            "Execute resource-intensive queries or retrieve sensitive data (e.g., internal IP addresses) via the exposed API endpoints"
        ]
    ],
    "vuln_description": "A publicly accessible Grafana installation exposes semi-sensitive dashboards and an unrestricted Prometheus proxy API. This allows attackers to perform direct queries to the Prometheus instance, potentially leading to sensitive data disclosure or denial of service via crafted requests.",
    "reason": "The vulnerability involves straightforward steps to access the Grafana instance and its Prometheus datasource. The interaction between Grafana and Prometheus is standard, and the attack does not require complex state manipulation or novel logic. The main challenge is knowing to explore the Prometheus API once the Grafana instance is discovered.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}