{
    "reported_to": "Stripo Inc",
    "reported_by": "ahmd_halabi ",
    "title": "CSRF - Modify Project Settings",
    "content": "\nTarget Url/Endpoint\nhttps://my.stripo.email/cabinet/stripeapi/v1/projects/{Project_Id}\nNote\nAttacker just need to know victim project Id.\nSummary:\nThis CSRF Vulnerability leads to change user's project settings including General Information, Contacts, Social Networks and Other Options.\nSteps To Reproduce:\nThis POC is a simple example on exploiting this bug. Attacker can exploit it with more advanced techniques and can really lead to critical issues.\nNavigate to Project Settings -> Modify any data and intercept the request, send it to repeater, and do the following.\nTake the HTML code format from burp suite -> Engagement Tools -> Generate CSRF POC.\nPut the piece of code in an html file, then open it.\nNow hit on the button and intercept its request.\nChange POST to PATCH.\nCopy the patch data from the old intercepted request from repeater and paste it to the current intercepted request and modify the data (email for example).\nModify the request header of Content-Type: Content-Type: application/json;charset=UTF-8\nForward the request and CSRF exploited successfully and the modified data changed successfully :)\nSupporting Material/References:\nPlease See this video where I recorded the above PoC in details\n██████\nImpact\nThis attack can be exploited in advanced way to modify all project settings and manipulate its data. Smart attacker can gain a big advantage from this bug. Hope you fix it asap.\nRegards\n\n",
    "severity": [
        9.0,
        10.0
    ],
    "bounty": null,
    "weaknesses": [
        "Cross-Site Request Forgery (CSRF)"
    ],
    "screenshots": {},
    "disclosed_date": 1580754720,
    "report_url": "https://hackerone.com/reports/766533",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "HIGH",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Navigate to Project Settings in the target application and modify any data, then intercept the request using a tool like Burp Suite."
        ],
        [
            2,
            "Use Burp Suite's 'Generate CSRF POC' tool to create an HTML file with the intercepted request. Open this HTML file in a browser."
        ],
        [
            3,
            "Intercept the request generated by the HTML file, change the method from POST to PATCH, and modify the data (e.g., email)."
        ],
        [
            4,
            "Update the request header to include 'Content-Type: application/json;charset=UTF-8' and forward the request."
        ]
    ],
    "vuln_description": "This CSRF vulnerability allows an attacker to modify a user's project settings (e.g., General Information, Contacts, Social Networks) by tricking the victim into executing a maliciously crafted request. The attacker only needs to know the victim's project ID.",
    "reason": "The attack involves multiple steps (intercepting, modifying, and replaying requests) but does not require deep understanding of complex application states or novel logic. The interactions between components (CSRF token handling, request method switching) are straightforward for a tester familiar with web security.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}