{
    "reported_to": "Stripo Inc",
    "reported_by": "brumens ",
    "title": "Authorization for wp-admin directory are vulnerable to brute force.",
    "content": "\nThe domain https://my.stripo.email in the directory /wp-admin are not blocking amount of request in the authorization form, this leads to bruteforce attack. Where the attacker are able to guess tons of passwords without getting blocked or the password field gets locked.\nThis attack make it possible to gain access as an admin extremely easy and quick to get a successfully login.\nTo test this security issue you need to visit the link https://my.stripo.email in the directory /wp-admin\nInstall a bruteforce tool like: Burp intruder, Wfuzz, Hydra, Ncrack\nI personality use Wfuzz and Burp.\nWfuzz command in Linux terminal: wfuzz -c -w /usr/share/seclists/Passwords/Common-Credentials/10k-most-common.txt -u https://my.stripo.email/wp-admin -d \"Authorization: Basic admin:FUZZ\"\nSupported links and fix tips:\nhttps://owasp.org/www-community/attacks/Brute_force_attack\nhttps://owasp.org/www-community/controls/Blocking_Brute_Force_Attacks\nThis Pictures below show status from my program as you can see with Wfuzz it hitted around 3000 passwords in like 40 secounds (calculated approximately.)\nMy Burp suite shows more exact response from your server.\nImpact\nGet access to anadmin login quickly and while logged in the attacker can do whatever an admin can.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Improper Restriction of Authentication Attempts"
    ],
    "screenshots": {},
    "disclosed_date": 1580935200,
    "report_url": "https://hackerone.com/reports/788420",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Visit the target URL: https://my.stripo.email/wp-admin"
        ],
        [
            2,
            "Use a brute force tool (e.g., Wfuzz, Burp Suite, Hydra) to send multiple login attempts with common passwords. Example command: wfuzz -c -w /usr/share/seclists/Passwords/Common-Credentials/10k-most-common.txt -u https://my.stripo.email/wp-admin -d \"Authorization: Basic admin:FUZZ\""
        ]
    ],
    "vuln_description": "The /wp-admin directory on the target domain does not implement rate limiting or account lockout mechanisms, making it vulnerable to brute force attacks. An attacker can systematically guess passwords without being blocked, potentially gaining admin access.",
    "reason": "The vulnerability is straightforward to discover as it involves a common security flaw (lack of brute force protection) and requires no complex interactions or state manipulation. Standard tools and techniques are sufficient to identify and exploit it.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}