{
    "reported_to": "BTFS",
    "reported_by": "dagamosst90 ",
    "title": "misconfigured CORS let to HPP and SOP bypass",
    "content": "\nHello team,\nI found a bug on your website that let me bypass the SOP policy.\nHope you fix it, everything is in the video\nhttps://www.youtube.com/watch?v=PYsU350S-s4\nImpact\nThe attacker my direct a victim to a phishing page of www.bitterrent.com/login and he/she will be convince to enter their email and password or even hijack csrf-token and sending him a password or email reset link.\nI also found a link that expose the csrf-token on the URL and you should check this link in the black.svg host header URL\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Misconfiguration"
    ],
    "screenshots": {},
    "disclosed_date": 1588903020,
    "report_url": "https://hackerone.com/reports/867436",
    "is_multi_component": false,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Identify a misconfigured CORS policy on the target website (www.bitterrent.com)."
        ],
        [
            2,
            "Exploit the misconfigured CORS to bypass Same-Origin Policy (SOP) and perform HTTP Parameter Pollution (HPP)."
        ],
        [
            3,
            "Craft a phishing page mimicking www.bitterrent.com/login to capture user credentials or CSRF tokens."
        ],
        [
            4,
            "Use the exposed CSRF token from the black.svg host header URL to hijack user sessions or perform unauthorized actions."
        ]
    ],
    "vuln_description": "The vulnerability involves a misconfigured CORS policy that allows attackers to bypass SOP and perform HPP. This can lead to phishing attacks where victims are tricked into entering their credentials on a fake login page. Additionally, the exposure of CSRF tokens in URLs further exacerbates the risk by enabling session hijacking or unauthorized actions.",
    "reason": "The attack requires understanding and exploiting multiple components (CORS misconfiguration, SOP bypass, HPP, CSRF token exposure) and their interactions. However, these are well-documented attack vectors, and the steps to exploit them are relatively straightforward once the misconfiguration is identified.",
    "new_complexity": "MEDIUM",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}