{
  "reported_to": "Khan Academy",
  "reported_by": "5kyw41k3r ",
  "title": "Unauthorised Account Detail Modification ",
  "content": "\nIntroduction\nHi 5kyw41k3r here,\nI found an Unauthorised Account Detail Modification in KA website...\nDefination\nCode 166 Bytes\n1It is a flaw which allows a malicious actor to modify the details of an account. I have included a video made by me for demonstration purposes using a test account...\nReproduction Steps:-\n============\n==I have included a video in the attachments\nYou need burp proxy correctly configured and working properly.\nGo to settings and make minor changes to your account.\nHit save and then intercept that request.\nDisconnect your browser and your proxy\nSend the Step 3 request to the repeater and forward all unnecessary requests.\nModify the request as shown in the video There you have it! Notice how you can change you nickname and DOB which is actually not authorized in the browser itself.\nHere's the vid=====> ████████\nImpact\nImpact\nWell, khan academy being used in schools like mine as it says on the page;\nThis is because Khan Academy is used in many schools...\nAnyone can change these details by getting hold of those requests, which you can do through the inspect element...No rocket science!\nThis can lead to a lot of issues such as leakage of sensitive data(Such as parent emails and accounts)\nThey could also perform identity theft through this method.\nI strongly recommend to fix this as soon as possible.\nHoping for swag!\nThanks and Stay Safe at Home,\n5kyw41k3r\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": null,
  "weaknesses": [
    "Improper Access Control - Generic"
  ],
  "screenshots": {},
  "disclosed_date": 1592595420,
  "report_url": "https://hackerone.com/reports/868146",
  "is_multi_component": true,
  "complexity": "HIGH",
  "novelty": "HIGH",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Configure Burp proxy and ensure it is working properly."
    ],
    [
      2,
      "Navigate to the settings page of the KA website and make minor changes to your account details."
    ],
    [
      3,
      "Intercept the save request using Burp proxy."
    ],
    [
      4,
      "Disconnect the browser and proxy, then send the intercepted request to Burp Repeater."
    ],
    [
      5,
      "Modify the request to change unauthorized fields like nickname and date of birth."
    ],
    [
      6,
      "Forward the modified request to observe the unauthorized changes."
    ]
  ],
  "vuln_description": "This vulnerability allows an attacker to modify unauthorized account details (such as nickname and date of birth) by intercepting and manipulating the request sent to the server, bypassing client-side restrictions.",
  "reason": "The attack involves using a proxy to intercept and modify requests, which is a common technique in web security testing. The steps are straightforward and do not require deep understanding of complex application states or novel logic.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": true,
  "authnz_byppass_detectable": false,
  "is_simple_payload": false,
  "injection_metadata": {
    "is_simple_payload": false
  },
  "authnz_metadata": {
    "reason": "The vulnerability involves modifying account details by intercepting and altering HTTP requests, which falls under the IDOR (Insecure Direct Object Reference) vulnerability class. The methodology described involves testing (user_session, action, resource_id) tuples by swapping user sessions and resource IDs, which would detect this type of vulnerability. The unauthorized modification of account details can be detected by substituting the resource_id (account details) with another user's details and testing the request with different user sessions.",
    "is_detectable": true
  }
}