{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "un4gi ",
  "title": "Support incident can be opened for any user via /███████ and PII leak via █████████ field",
  "content": "\nSummary:\nA malicious user can open an incident for any user via the ████/████████ page. This would allow the attacker to trick the victim into taking actions such as clicking a link or opening a file that has been attached to the incident.\nImpact\nA victim could be tricked into visiting a link, opening a file, or sending PII to the attacker via the incident. Because the attacker opened the incident, they can see all comments left by the victim.\nStep-by-step Reproduction Instructions\nBrowse to ████ and create an account or login.\nBrowse to ██████████/█████████. You will be able to create an incident on this page.\nIn the █████████ field, you can select any user you want to assign the incident to. The i button beside the caller field also allows you to view various PII about the user. ███████ ██████\nYou can attach files in the top right corner using the attachment button.\nOnce you have chosen a victim (██████) and filled in the additional comments section with your phishing message, you can click Submit in the top right corner. ██████\nBrowse to ███████/home.do and you can see a list of your open incidents. You may need to filter by All.\nClick the incident that you assigned to the victim. ███████\nYou can now use this page to monitor the victims response. This could be used to communicate with the victim, posing as an administrator and soliciting PII or causing other malicious effects. █████████\nThe victim will receive an e-mail that the incident has been submitted on their behalf. Once they log-in, they will see the following: ██████████ ███████\nObviously an adversary would create an account posing as an Air University administrator or something believable, but here is what a phishing attempt could look like using this vulnerability: ███\nMeanwhile, the attacker is monitoring the incident waiting on the victim to respond and can even see when the victim has viewed the incident. ███\nSuggested Mitigation/Remediation Actions\nThis feature should be locked down to administrative access only. Regular users should not be allowed to submit tickets directly to other users or view other users PII.\nImpact\nA victim could be tricked into visiting a link, opening a file, or sending PII to the attacker via the incident. Because the attacker opened the incident, they can see all comments left by the victim.\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": null,
  "weaknesses": [
    "Improper Access Control - Generic"
  ],
  "screenshots": {},
  "disclosed_date": 1613693100,
  "report_url": "https://hackerone.com/reports/869450",
  "is_multi_component": true,
  "complexity": "MEDIUM",
  "novelty": "MEDIUM",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Browse to the application and create an account or log in."
    ],
    [
      2,
      "Navigate to the incident creation page (/█████████/█████████)."
    ],
    [
      3,
      "In the █████████ field, select any user to assign the incident to."
    ],
    [
      4,
      "Attach files and fill in the comments section with a phishing message."
    ],
    [
      5,
      "Click Submit to create the incident."
    ],
    [
      6,
      "Monitor the incident page to track the victim's response."
    ]
  ],
  "vuln_description": "A malicious user can open a support incident for any user, potentially tricking the victim into clicking malicious links or revealing PII. The attacker can also view PII via the caller field and monitor all victim responses.",
  "reason": "The vulnerability involves straightforward steps without complex interactions or novel logic. The attacker simply exploits a lack of access control on the incident creation feature.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": true,
  "authnz_byppass_detectable": true,
  "is_simple_payload": false,
  "injection_metadata": {
    "is_simple_payload": false
  },
  "authnz_metadata": {
    "reason": "The vulnerability involves an attacker using their own authenticated session to perform actions (opening incidents and viewing PII) on behalf of other users. This fits the IDOR vulnerability class where (user_session, action, resource_id) tuples are manipulated. The methodology would detect this by swapping user sessions and testing authorization boundaries for the incident creation and PII access functionality.",
    "is_detectable": true
  }
}