{
    "reported_to": "U.S. Dept Of Defense",
    "reported_by": "un4gi ",
    "title": "PII Leak via /██████",
    "content": "\nSummary:\nAn attacker is able to access ServiceNow e-mail notification modules via █████/██████████. Once on this page, the attacker can click any of the notifications, select Preview Notification, and choose a user to view their profile data to include Full Name, rank, organization, e-mail address, physical address, and phone number.\nStep-by-step Reproduction Instructions\nBrowse to ██████ and create an account or sign in.\nBrowse to █████████/███████.\nClick on any of the notification names. Once the notification menu appears, click Preview Notification in the top right corner of the screen.\nThe ████ field can now be used to query a user. Once a user is identified, the (i) icon can be clicked to view the users PII. ██████\nSuggested Mitigation/Remediation Actions\nRestrict access to the █████ and sysevent_email_action.do modules to prevent unauthorized viewing of PII.\nImpact\nAn adversary can gather PII of all ███████ users via this endpoint.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Information Disclosure"
    ],
    "screenshots": {},
    "disclosed_date": 1613693460,
    "report_url": "https://hackerone.com/reports/905688",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Browse to the specified URL and create an account or sign in."
        ],
        [
            2,
            "Navigate to the notification modules page and click on any notification."
        ],
        [
            3,
            "Click 'Preview Notification' and query a user to view their PII."
        ]
    ],
    "vuln_description": "An attacker can access ServiceNow e-mail notification modules to view sensitive user profile data, including Full Name, rank, organization, e-mail address, physical address, and phone number, by querying a user in the notification preview feature.",
    "reason": "The vulnerability involves straightforward steps to access PII without requiring complex interactions or manipulation of application states. The attack path is linear and does not involve novel or non-obvious logic.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}