{
    "reported_to": "Courier",
    "reported_by": "vaalici ",
    "title": "disable test send feature if user's email address isn't verified",
    "content": "\nSummary:\nThere is no mechanism to limit the request in places while send the preview email\nSteps To Reproduce:\nThere is a weak account registration process, which allow user to register and login without any email confirmation.\nL'say say for example that i'm the user A that want to send a phishing email or perform DOS against a targeted user\nRegistration process by using the victim email address\nCraft the email example\nProced with the sent to me functionality to try the email send\nIntercept the request with a Proxy (Burp)\nResend the request any times you want\nSupporting Material/References:\nCWE-400: Uncontrolled Resource Consumption\nhttps://cwe.mitre.org/data/definitions/400.html\nBelow i have attached the evidence for the POC\nImpact\nThe most common result of resource exhaustion is denial of service.\n\n",
    "severity": [
        7.6,
        null
    ],
    "bounty": null,
    "weaknesses": [
        "Uncontrolled Resource Consumption"
    ],
    "screenshots": {},
    "disclosed_date": 1593491280,
    "report_url": "https://hackerone.com/reports/906226",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Register an account without email verification using the victim's email address."
        ],
        [
            2,
            "Use the 'send test email' feature, intercept the request with a proxy (e.g., Burp Suite), and replay it multiple times to perform a DoS attack."
        ]
    ],
    "vuln_description": "The application allows unverified users to send test emails without rate limiting, enabling potential DoS attacks or phishing campaigns by replaying intercepted requests.",
    "reason": "The vulnerability involves a straightforward exploitation of missing email verification and lack of rate limiting. The steps are simple and do not require deep understanding of complex application states or novel logic.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}