{
    "reported_to": "Acronis",
    "reported_by": "salna_kuruvi ",
    "title": "ClickJacking",
    "content": "\nI have found the vulnerability called Clickjacking.\nPlease find the details below:\nDescription\nClickjacking is an exploit in which malicious coding is hidden beneath apparently legitimate buttons or other clickable content on a website.\nOWASP Benchmark A6- Security Misconfiguration\nSteps to Reproduce\n1.Craft an HTML page and add the following\n( https://www.acronis.com/en-in/ ) of the application within an iframe.\n2.Save the file as *.html and run the file.\n3.Open the HTML page in a browser.\n4.The following attached screenshot shows webiste is in frame.\nPlease find the attached screenshot for your reference.\nHigh Level Fix Recommendation\nClickjacking attacks can be avoided by setting the X-Frame-Options header or by using frame busting code which check if the current web page is the top web page (not within a frame).\nImpact\nImpact\nMultitude of attacks including key logging and stealing user credentials.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "UI Redressing (Clickjacking)"
    ],
    "screenshots": {},
    "disclosed_date": 1615902240,
    "report_url": "https://hackerone.com/reports/947690",
    "is_multi_component": false,
    "complexity": "LOW",
    "novelty": "LOW",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Craft an HTML page and embed the target website (https://www.acronis.com/en-in/) within an iframe."
        ],
        [
            2,
            "Save the file as *.html, open it in a browser, and observe the target website loading within the frame."
        ]
    ],
    "vuln_description": "Clickjacking is an exploit where malicious content is hidden beneath legitimate clickable elements on a website, allowing attackers to trick users into performing unintended actions. The vulnerability occurs when the target website does not implement X-Frame-Options headers or frame-busting scripts to prevent being embedded in an iframe.",
    "reason": "The attack involves a straightforward process of embedding a website in an iframe and does not require complex interactions, multiple components, or novel logic. The vulnerability is easily reproducible with basic web development knowledge.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}