{
    "reported_to": "U.S. Dept Of Defense",
    "reported_by": "un4gi ",
    "title": "Password Cracking - Weak Password Used to Secure ████ Containing a Plaintext Password",
    "content": "\nSummary:\nI was able to crack the password to the ████████ located at ██████, as the pdf was protected with a weak password contained in a common word list. This guide contains steps to set-up the ███████ secure communication application with the unprotected configuration file located at██████████. This guide also contains a plaintext password for the configuration file.\nStep-by-step Reproduction Instructions\nBrowse to ███\nClick ████████. You will be prompted for a password.\nUsing wget, download the pdf: wget ████████.\nOnce downloaded, you can use pdf2john to convert the pdf password into a format that is parse-able by john: perl /path/to/john/pdf2john.pl █████████.pdf\nThis will produce a hash. Cracking this hash with john and the rockyou wordlist will produce the password:\nCode 532 Bytes\n1root@kali:/home/kali# john --wordlist=/usr/share/wordlists/rockyou.txt hash.txt \n2Using default input encoding: UTF-8\n3Loaded 1 password hash (PDF [MD5 SHA2 RC4/AES 32/64])\n4Cost 1 (revision) is 6 for all loaded hashes\n5Will run 4 OpenMP threads\n6Press 'q' or Ctrl-C to abort, almost any other key for status\n7█████████           (████████.pdf)\n81g 0:00:00:00 DONE (2020-09-18 01:08) 1.785g/s 2285p/s 2285c/s 2285C/s 753951..poohbear1\n9Use the \"--show --format=PDF\" options to display all of the cracked passwords reliably\n10Session completed\nYou can now browse to █████████, click ███, and type in the password █████████ to view the pdf (or view it on your local system).\nReading the setup instructions, and attacker can download the Messaging Configto download the ████ configuration file. This mobile guide contains the plaintext password for the configuration file (███████). They can then attempt to use the configuration file and a compromised .mil/.gov/etc. account to gain access to ████ secure communications.\nReferences\nhttps://github.com/openwall/john/blob/bleeding-jumbo/run/pdf2john.pl\nSuggested Mitigation/Remediation Actions\nUse a strong password for this .pdf file in order to prevent successful password cracking attempts.\nImpact\nThis guide contains steps to set-up the ███████ secure communication application with the unprotected configuration file located at█████. This guide also contains a plaintext password for the configuration file. An attacker could potentially join the secure communication channel if they were able to obtain access to the DoD ID number of an ███ member.\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Storing Passwords in a Recoverable Format"
    ],
    "screenshots": {},
    "disclosed_date": 1613693640,
    "report_url": "https://hackerone.com/reports/985133",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Browse to the target URL and attempt to access the protected PDF."
        ],
        [
            2,
            "Use wget to download the PDF file."
        ],
        [
            3,
            "Convert the PDF password hash using pdf2john.pl."
        ],
        [
            4,
            "Crack the hash using John the Ripper with the rockyou.txt wordlist."
        ],
        [
            5,
            "Use the cracked password to access the PDF and extract the plaintext configuration password."
        ],
        [
            6,
            "Use the extracted password to access the secure communication configuration file."
        ]
    ],
    "vuln_description": "The vulnerability involves cracking a weakly protected PDF password using a common wordlist, which then reveals a plaintext password for a secure communication configuration file. This allows unauthorized access to secure communications if combined with a compromised .mil/.gov account.",
    "reason": "The attack is straightforward and relies on common tools and techniques (password cracking with John the Ripper and a known wordlist). There are no complex interactions or novel logic involved; the vulnerability stems from weak password practices.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null
}