{
    "reported_to": "Nextcloud",
    "reported_by": "xcracker420 ",
    "title": "Recently change email but still login with old email",
    "content": "\nHi team,\nI have been found vulnerability on email verification which can be account takeover (Authentication bypass)\nRecently I have been change my email ████ but still login with old email ██████\n--https://efss.qloud.my/index.php/settings/user\nImpact\nImpact\nIf victim's email account is still logged into his/her old gmail account . Then any external attacker can use the unused same email for account takeover\nhttps://efss.qloud.my/index.php/settings/user\n\n",
    "severity": [
        7.0,
        8.9
    ],
    "bounty": null,
    "weaknesses": [
        "Improper Authentication - Generic"
    ],
    "screenshots": {},
    "disclosed_date": 1601379960,
    "report_url": "https://hackerone.com/reports/986459",
    "is_multi_component": false,
    "complexity": "MEDIUM",
    "novelty": "MEDIUM",
    "vuln_category": "WEB_APP",
    "steps": [
        [
            1,
            "Log in to the application with the old email address that was previously associated with the account."
        ],
        [
            2,
            "Observe that the system still allows authentication with the old email despite it being changed in the user settings."
        ]
    ],
    "vuln_description": "The vulnerability allows an attacker to bypass email verification and potentially take over an account by using an old email address that was previously associated with the account but has since been changed. This occurs because the system fails to invalidate the old email address for authentication purposes after an email change.",
    "reason": "The vulnerability is straightforward to discover as it only requires the tester to attempt logging in with an old email address after changing it in the user settings. There are no complex interactions or states involved, and the logic flaw is relatively obvious once the email change process is understood.",
    "new_complexity": "LOW",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null,
    "idor_detectable": false,
    "authnz_byppass_detectable": true,
    "is_simple_payload": false,
    "injection_metadata": {
        "is_simple_payload": false
    },
    "authnz_metadata": {
        "idor_detectable": false,
        "authnz_byppass_detectable": true
    }
}