{
  "reported_to": "U.S. Dept Of Defense",
  "reported_by": "fiveguyslover ",
  "title": "Improper Access Control - Generic on https://████",
  "content": "\nGreetings, I found on one of your sub-domains some tickets that are not supposed to be readable by everyone, we even have the possibility to delete the tickets.\nLink :\nhttps://███/█████/latest\nhttps://█████/███████/all\nhttps://█████/███████ (DELETE HEADER METHOD)\nBest regards,\nfrenchvlad\nImpact\na malicious person can delete tickets and see the progress of tickets in progress\n\n",
  "severity": [
    7.0,
    8.9
  ],
  "bounty": null,
  "weaknesses": [
    "Improper Access Control - Generic"
  ],
  "screenshots": {},
  "disclosed_date": 1617403500,
  "report_url": "https://hackerone.com/reports/992618",
  "is_multi_component": false,
  "complexity": "LOW",
  "novelty": "LOW",
  "vuln_category": "WEB_APP",
  "steps": [
    [
      1,
      "Navigate to the sub-domain URLs provided in the report: https://███/█████/latest and https://█████/███████/all"
    ],
    [
      2,
      "Attempt to delete a ticket by sending a DELETE request to https://█████/███████ with the appropriate headers"
    ]
  ],
  "vuln_description": "The vulnerability involves improper access control on a sub-domain, allowing unauthorized users to view and delete tickets. This exposes sensitive ticket information and allows malicious actors to disrupt operations by deleting tickets.",
  "reason": "The vulnerability is straightforward to discover as it involves accessing publicly available URLs and performing basic HTTP methods. No complex interactions or state manipulations are required.",
  "new_complexity": "LOW",
  "requires_code": false,
  "requires_CVE": false,
  "is_ctf": false,
  "other_report": null,
  "idor_detectable": true,
  "authnz_byppass_detectable": true,
  "is_simple_payload": false,
  "injection_metadata": {
    "is_simple_payload": false
  },
  "authnz_metadata": {
    "reason": "The vulnerability involves improper access control where unauthenticated or unauthorized users can access and delete tickets. This matches the methodology's focus on testing authorization boundaries by swapping user sessions or using unauthenticated sessions to access resources (steps d and e). The ability to delete tickets and view progress without proper authorization is a clear case of IDOR and AuthZ bypass, which the methodology is designed to detect.",
    "is_detectable": true
  }
}