{
    "reported_to": "Brave Software",
    "reported_by": "nishimunea ",
    "title": "Universal XSS through FIDO U2F register from subframe",
    "content": "\nSummary:\nThere are three weaknesses in Brave's FIDO U2F implementation.\nu2f.register() can be executed from cross-origin subframe by invoking U2F.postMessage directly\nThen, FIDO related modals show the name of top frame origin (but not caller subframe)\nThe version parameter sent from the above postMessage is embedded in an evaluateJavaScript without escape\nThe combination of these weaknesses allows cross-domain subframe to inject any JavaScript code to the top frame through fake U2F registration process.\n## Products affected:\nBrave iOS Version 1.20 (20.09.11.20), also current Nightly\nSteps To Reproduce:\nOpen UXSS Victim hosted on alice.csrf.jp. This site has a cross-origin iframe that opens evil.csrf.jp.\nReady to Scan dialog is shown with the name of top frame\nInsert your FIDO device such as YubiKey 5Ci and touch\nInjected JavaScript alert() is executed on the top frame\nSupporting Material/References:\nSee attached movie file for the demonstration\nImpact\nAs written in summary, malicious web content in subframe can UXSS on the top frame origin.\n\n",
    "severity": [
        7.4,
        null
    ],
    "bounty": 1000,
    "weaknesses": [
        "Cross-site Scripting (XSS) - Generic"
    ],
    "screenshots": {},
    "disclosed_date": 1687427520,
    "report_url": "https://hackerone.com/reports/993670",
    "is_multi_component": true,
    "complexity": "HIGH",
    "novelty": "HIGH",
    "vuln_category": "MOBILE",
    "steps": [
        [
            1,
            "Open UXSS Victim hosted on alice.csrf.jp. This site has a cross-origin iframe that opens evil.csrf.jp."
        ],
        [
            2,
            "Ready to Scan dialog is shown with the name of top frame"
        ],
        [
            3,
            "Insert your FIDO device such as YubiKey 5Ci and touch"
        ],
        [
            4,
            "Injected JavaScript alert() is executed on the top frame"
        ]
    ],
    "vuln_description": "The vulnerability involves three weaknesses in Brave's FIDO U2F implementation: the ability to execute u2f.register() from a cross-origin subframe via U2F.postMessage, the display of the top frame origin in FIDO modals instead of the caller subframe, and the embedding of the version parameter from postMessage into an evaluateJavaScript call without proper escaping. This combination allows a cross-domain subframe to inject arbitrary JavaScript code into the top frame through a fake U2F registration process.",
    "reason": "The attack requires understanding and combining multiple components (cross-origin subframe execution, modal origin display, and JavaScript injection via unescaped parameters) and involves subtle interactions between these components. Additionally, the manipulation of the FIDO registration process to execute arbitrary JavaScript is not a commonly exploited path.",
    "new_complexity": "HIGH",
    "requires_code": false,
    "requires_CVE": false,
    "is_ctf": false,
    "other_report": null,
    "authnz_metadata": {
        "reason": "The vulnerability involves cross-origin subframe execution and JavaScript injection through FIDO U2F registration, which is not covered by the methodologies focusing on session/resource ID swapping within the same application.",
        "is_detectable": false
    }
}